;=== Ver. どいつ =====

		onbankgroup

;************************************************************************
;*									*
;*	タイトル    ：	ＣＧＢゼルダ					*
;*	ファイル名  ：	ZATR.DMG					*
;*	処理内容    ：	アトリビュートセット				*
;*	作成日付    ：  １９９８／０７／２９				*
;*									*
;************************************************************************
;
;==============	バンク０ ================================================
BANK0		GROUP	0
;-------------<	ZCO >----------------------------------------------------
		EXTERN	VRAMTR,VRAMTR1,DATA_MOV
;
;-------------<	ZBS >----------------------------------------------------
		EXTERN	UNSTSB_SP
;
;==============	バンク２１ ==============================================
BANK21		GROUP	21
;-------------<	ZCOL >---------------------------------------------------
		EXTERN	MORI_FRCNT
;
;==============	バンク２４ ==============================================
BANK24		GROUP	24
;-------------<	ZATRSUB >------------------------------------------------
		EXTERN	AT_OPENBG3,AT_LOGODT
;
;========================================================================
		PUBALL
		NLIST

BANK24		GROUP	$24
;------------------------------------------------------------------------
		LIB	zram.s	; RAM ＥＱＵＡＴＥ ファイル
		LIB	zbn.s	; BG unit no file !
;------------------------------------------------------------------------
		LIST
		KANJI
		isdmg

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	Ｖ－ＲＡＭ アトリビュート( $9800 - $9FFF V-BANK1 ) クリア	x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
V_RAMC_ATR
		LD	A,(CGBFLG)
		AND	A		; カラーゲームボーイ？
		RET	Z		; ＮＯ
;------------------------------------------------------------------------
		LD	A,$01
		LD	(VBK),A		; バンク（１）セット

		LD	BC,$0800	; 個数
		LD	HL,$9800	; Ｖ－ＲＡＭアドレス
V_RAMC_100
		LD	A,$0		; アトリビュート（０）
		LD	(HLI),A
		DEC	BC
		LD	A,B
		OR	C
		JR	NZ,V_RAMC_100

		XOR	A
		LD	(VBK),A		; バンク（０）セット
		RET

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	ＢＧアトリビュートデータ セット（ VRAMD_AT 対応 ）		x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
VRAMTR_ATR
		LD	A,(CGBFLG)
		AND	A		; カラーゲームボーイ？
		RET	Z		; ＮＯ
;------------------------------------------------------------------------
		LD	A,$01
		LD	(VBK),A		; バンク（１）セット

		LD	DE,VRAMD_AT+1
		CALL	VRAMTR		; Ｖ－ＲＡＭ トラスファー

		XOR	A
		LD	(VBK),A		; バンク（０）セット
		RET

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	ＢＧアトリビュートデータ セット（ VRFLG 対応 ）			x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
VRAMST_ATR
		LD	A,(CGBFLG)
		AND	A		; カラーゲームボーイ？
		RET	Z		; ＮＯ
;------------------------------------------------------------------------
		LD	A,$01
		LD	(VBK),A		; バンク（１）セット

		LD	HL,VRDATA_ATR
		LD	B,$0
		LD	A,(VRFLG)
		SLA	A
		LD	C,A
		ADD	HL,BC
		LD	A,(HLI)
		LD	E,A		; データアドレスＨＩＧＨ
		LD	A,(HL)
		LD	D,A		; データアドレスＬＯＷ

		CALL	VRAMTR1		; Ｖ－ＲＡＭ トラスファー

		XOR	A
		LD	(VBK),A		; バンク（０）セット
		RET

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	ＢＧアトリビュートデータアドレス テーブル			x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
VRDATA_ATR
		DEFW	00		; ( 0) VRAMD+1
		DEFW	AT_ENDYMBG	; ( 1) エンディング山遠景  BG;00 ;TITLBG
		DEFW	AT_WINDBG	; ( 2) アイテムウィンドウ画面
		DEFW	AT_PSLCTBG	; ( 3) 誰で遊戯すんねん？画面
		DEFW	AT_PSLCTBG2	; ( 4) 名前を消すＯＲ移動ＳＥＬＥＣＴ欄
		DEFW	AT_NSLCTBG	; ( 5) 名前を決めやう画面
		DEFW	AT_NCLERBG	; ( 6) 誰を消してまうねん？画面
;;;;;;;		DEFW	VRAMD2+1	; ( 7) ダンジョンマップ？
		DEFW	AT_DMCLDT	; ( 7) ダンジョンマップ？
		DEFW	AT_GMAPBG	; ( 8) 
		DEFW	AT_GMAPCLB	; ( 9) 
		DEFW	AT_GOVERBG	; ( A) ゲームオーバー
		DEFW	AT_WINDBG2	; ( B) ODEMOBG
		DEFW	AT_NCOPYBG	; ( C) 
		DEFW	AT_TSAVEBG	; ( D) 強制セーブ
		DEFW	AT_OPENBG	; ( E) Opening BG !
		DEFW	AT_OPENBG2	; ( F) Opening BG 2!
		DEFW	AT_OPENBG3	; (10) Opening BG 3!
		DEFW	AT_LOGODT	; (11) 無理矢理タイトルロゴ！
		DEFW	AT_PEACHDT	; (12) ピーチ写真！
		DEFW	AT_LOVEDT	; (13) 海岸デモ！
		DEFW	AT_MAMUUBG	; (14) マムー部屋ベタ！
		DEFW	AT_KABEDT1	; (15) 壁画１
;----------------------------------------------
		DEFW	AT_ENDBGA	; (16) エンディング A BG
		DEFW	AT_ENDBGB2	; (17) エンディング B2 BG
		DEFW	AT_ENDBGC	; (18) エンディング C BG
		DEFW	AT_ENDBGB	; (19) エンディング B BG
		DEFW	AT_ENDBGD	; (1A) エンディング D BG
		DEFW	AT_ENDBGE	; (1B) エンディング E BG
		DEFW	AT_ENDBGF	; (1C) エンディング F BG
		DEFW	AT_ENDBGG	; (1D) エンディング G BG
;- - - - - - - - - - - - - - - - - - - - - - -
		DW	AT_ENDBGA1	; (1E) 
		DW	AT_ENDBGA2	; (1F) 
		DW	AT_ENDBGA3	; (20) 
		DW	AT_ENDBGA4	; (21) 
		DW	AT_ENDBGA5	; (22) 
;
		DW	AT_KABADT	; (23) カバの絵！
		DW	AT_TOUBGDT	; (24) ７塔デモ！
;
		DEFW	AT_OPENBG_CGB	; (25) (CGB) Opening BG !
;
;------------------------------------------------------------------------
;	VRFLG ラベルＮｏ
;------------------------------------------------------------------------
;TITLBGS	EQU	1	; エンディング山遠景
;EBGY		EQU	1
;WINDBGS	EQU	2
;PSLBGS		EQU	3
;PSLBG2		EQU	4
;NSLBGS		EQU	5
;NCLBGS		EQU	6
;BLVRDS		EQU	7
;GMAPBGS	EQU	8	; G. map waku BG 
;GMAPCL		EQU	9
;GOVBG		EQU	$A	; ゲームオーバー
;ODMBG		EQU	$B
;WINDBGS2	EQU	$B
;NCPBGS		EQU	$C
;TSVBG		EQU	$D	; 強制セーブ
;OPBGS		EQU	$E	; Opening BG !
;OPBG2		EQU	$F	; Opening BG 2!
;OPBG3		EQU	$10	; Opening BG 3!
;LOGOS		EQU	$11	; 無理矢理タイトルロゴ！
;PECBG		EQU	$12	; ピーチ写真！
;LOVBG		EQU	$13	; 海岸デモ！
;MMBG		EQU	$14	; マムー部屋ベタ！
;KB1BG		EQU	$15	; 壁画１
;----------------------------------------------
;EBGA		EQU	$16	; エンディング A BG
;EBGB2		EQU	$17	; エンディング B2 BG
;EBGC 		EQU	$18	; エンディング C BG
;EBGB 		EQU	$19	; エンディング B BG
;EBGD 		EQU	$1A	; エンディング D BG
;EBGE 		EQU	$1B	; エンディング E BG
;EBGF 		EQU	$1C	; エンディング F BG
;EBGG 		EQU	$1D	; エンディング G BG
;EBGA1		EQU	$1E
;EBGA2		EQU	$1F
;EBGA3		EQU	$20
;EBGA4		EQU	$21
;EBGA5		EQU	$22
;
;KABBG		EQU	$23	; カバの絵！
;TOUBG		EQU	$24	; ７塔デモ！
;
;EWAKU	 	EQU	$1E	;未使用！
;EWAKU2 	EQU	$1F	;  "
;
;
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	アトリビュート 仮データ（すべて「０」をいれる）			x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;VRAMD2+1		; ( 7) 
AT_GMAPCLB		; ( 9) 
AT_WINDBG2		; ( B) ODEMOBG
	DB	$98,$00,$7F,$00
	DB	$98,$20,$7F,$00
	DB	$98,$40,$7F,$00
	DB	$98,$60,$7F,$00
	DB	$98,$80,$7F,$00
	DB	$98,$a0,$7F,$00
	DB	$98,$c0,$7F,$00
	DB	$98,$e0,$7F,$00

	DB	$99,$00,$7F,$00
	DB	$99,$20,$7F,$00
	DB	$99,$40,$7F,$00
	DB	$99,$60,$7F,$00
	DB	$99,$80,$7F,$00
	DB	$99,$a0,$7F,$00
	DB	$99,$c0,$7F,$00
	DB	$99,$e0,$7F,$00

	DB	$9a,$00,$7F,$00
	DB	$9a,$20,$7F,$00
	DB	$9a,$40,$7F,$00
	DB	$9a,$60,$7F,$00
	DB	$9a,$80,$7F,$00
	DB	$9a,$a0,$7F,$00
	DB	$9a,$c0,$7F,$00
	DB	$9a,$e0,$7F,$00

	DB	$9b,$00,$7F,$00
	DB	$9b,$20,$7F,$00
	DB	$9b,$40,$7F,$00
	DB	$9b,$60,$7F,$00
	DB	$9b,$80,$7F,$00
	DB	$9b,$a0,$7F,$00
	DB	$9b,$c0,$7F,$00
	DB	$9b,$e0,$7F,$00

	DB	0

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	オープニング１（嵐の海）					x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_OPENBG
AT_OPENBG_CGB
;(1998/06/24)	DB	$98,$00,$5F,$06
;(1998/06/24)	DB	$98,$20,$5F,$06
;(1998/06/24)	DB	$98,$40,$5F,$06
;(1998/06/24)	DB	$98,$60,$5F,$06
;(1998/06/24);
;(1998/06/24)	DB	$98,$80,$1F
;(1998/06/24)	DB	    $06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06
;(1998/06/24)	DB	    $06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06
;(1998/06/24)	DB	    $06,$06,$06,$06,$06,$06,$06,$06
;(1998/06/24);
;(1998/06/24)	DB	$98,$A0,$1F
;(1998/06/24)	DB	    $06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06
;(1998/06/24)	DB	    $06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06
;(1998/06/24)	DB	    $06,$06,$06,$06,$06,$06,$06,$06
;(1998/06/24);
;(1998/06/24)	DB	$98,$C0,$1F
;(1998/06/24)	DB	    $06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06
;(1998/06/24)	DB	    $06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06
;(1998/06/24)	DB	    $06,$06,$06,$06,$06,$06,$06,$06
;(1998/06/24);
;(1998/06/24)	DB	$98,$E0,$5F,$06
;(1998/06/24)	DB	$99,$00,$5F,$06
;(1998/06/24)	DB	$99,$20,$5F,$06
;(1998/06/24);
;(1998/06/24)	DB	$99,$40,$1F
;(1998/06/24)	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24)	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24)	DB	    $07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24);
;(1998/06/24)	DB	$99,$60,$1F
;(1998/06/24)	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24)	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24)	DB          $07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24);
;(1998/06/24)	DB	$99,$80,$1F
;(1998/06/24)	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24)	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24)	DB	    $07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24);
;(1998/06/24)	DB	$99,$A0,$1F
;(1998/06/24)	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24)	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24)	DB	    $07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24);
;(1998/06/24)	DB	$99,$C0,$1F
;(1998/06/24)	DB          $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24)	DB          $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24)	DB          $07,$07,$07,$07,$07,$07,$07,$07
;(1998/06/24);
;(1998/06/24)	DB	$99,$E0,$5F,$07
;(1998/06/24)	DB	$9A,$00,$5F,$07
;(1998/06/24)	DB	$9A,$20,$5F,$07
;(1998/06/24)	DB	$9A,$40,$5F,$07
;(1998/06/24)	DB	$9A,$60,$5F,$07
;(1998/06/24);
;(1998/06/24)	DB	0
;
	DB	$98,$00,$5F,$06
	DB	$98,$20,$5F,$06
	DB	$98,$40,$5F,$06
	DB	$98,$60,$5F,$06
;
	DB	$98,$80,$5F,$06
;;;;;	DB	$98,$80,$1F
;;;;;	DB	    $06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06
;;;;;	DB	    $06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06
;;;;;	DB	    $06,$06,$06,$06,$06,$06,$06,$06
;
	DB	$98,$A0,$5F,$06
;;;;;	DB	$98,$A0,$1F
;;;;;	DB	    $06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06
;;;;;	DB	    $06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06
;;;;;	DB	    $06,$06,$06,$06,$06,$06,$06,$06
;
	DB	$98,$C0,$5F,$06
;;;;;	DB	$98,$C0,$1F
;;;;;	DB	    $06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06
;;;;;	DB	    $06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06,$06
;;;;;	DB	    $06,$06,$06,$06,$06,$06,$06,$06
;
	DB	$98,$E0,$5F,$07
	DB	$99,$00,$5F,$07
	DB	$99,$20,$5F,$07
;
	DB	$99,$40,$5F,$07
;;;;;	DB	$99,$40,$1F
;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07
;
	DB	$99,$60,$5F,$07
;;;;;	DB	$99,$60,$1F
;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;;;;;	DB          $07,$07,$07,$07,$07,$07,$07,$07
;
	DB	$99,$80,$5F,$07
;;;;;	DB	$99,$80,$1F
;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07
;
	DB	$99,$A0,$5F,$07
;;;;;	DB	$99,$A0,$1F
;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07
;
	DB	$99,$C0,$5F,$07
;;;;;	DB	$99,$C0,$1F
;;;;;	DB          $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;;;;;	DB          $07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07,$07
;;;;;	DB          $07,$07,$07,$07,$07,$07,$07,$07
;
	DB	$99,$E0,$5F,$07
	DB	$9A,$00,$5F,$07
	DB	$9A,$20,$5F,$07
	DB	$9A,$40,$5F,$07
	DB	$9A,$60,$5F,$07
;
	DB	0
;
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	オープニング２（リンクあやうし！）				x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_OPENBG2
	DB	$98,$00,$5F,$00
	DB	$98,$20,$5F,$00
;
	DB	$98,$40,$1F
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
	DB          $05,$05,$05,$05,$05,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$98,$60,$1F
	DB	    $00,$00,$00,$00,$00,$00,$00,$05
	DB          $05,$05,$05,$05,$05,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$98,$80,$1F
	DB	    $00,$00,$00,$00,$00,$00,$00,$05
	DB          $05,$05,$05,$05,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$98,$A0,$1F
	DB	    $00,$00,$05,$00,$00,$00,$00,$05
	DB          $05,$05,$04,$04,$00,$02,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$98,$C0,$1F
	DB	    $00,$00,$05,$05,$00,$05,$05,$05
	DB          $05,$04,$04,$04,$04,$04,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$98,$E0,$1F
	DB	    $00,$00,$05,$05,$05,$05,$05,$05
	DB          $05,$04,$04,$04,$04,$04,$04,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$99,$00,$1F
	DB	    $00,$00,$05,$05,$05,$05,$05,$05
	DB          $05,$04,$04,$04,$04,$04,$04,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$99,$20,$1F
	DB	    $00,$00,$00,$05,$05,$05,$05,$05
	DB          $05,$04,$05,$05,$02,$02,$02,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$99,$40,$1F
	DB	    $00,$00,$00,$00,$05,$05,$05,$05
	DB          $05,$00,$02,$05,$05,$02,$02,$02
	DB	    $02,$02,$00,$00,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$99,$60,$1F
	DB	    $00,$00,$00,$00,$05,$05,$05,$05
	DB          $05,$05,$02,$05,$05,$03,$03,$02
	DB	    $02,$02,$00,$00,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$99,$80,$1F
	DB	    $00,$00,$00,$05,$05,$05,$05,$05
	DB          $05,$05,$05,$03,$01,$03,$03,$02
	DB	    $02,$02,$00,$00,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$99,$A0,$1F
	DB	    $00,$00,$00,$05,$05,$05,$05,$05
	DB          $05,$05,$05,$02,$02,$02,$02,$02
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$99,$C0,$1F
	DB	    $00,$00,$05,$05,$05,$05,$05,$00
	DB          $00,$00,$02,$02,$02,$02,$02,$02
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$99,$E0,$1F
	DB	    $00,$00,$05,$05,$05,$05,$05,$00
	DB          $00,$00,$00,$01,$02,$01,$01,$02
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
	DB	    $00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$9A,$00,$5F,$00
	DB	$9A,$20,$5F,$00
	DB	$9A,$40,$5F,$00
	DB	$9A,$60,$5F,$00
	DB	$9B,$A0,$5F,$00
	DB	$9B,$C0,$5F,$00
;
	DB	0
;
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	オープニング３（玉子山ふもと）					x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;;;;;;;;AT_OPENBG3
;;;;;;;;	DB	$98,$00,$5F,$03
;;;;;;;;;;;;;	DB	$98,$00,$1F
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03,$03,$03,$03,$03
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03,$03,$03,$03,$03
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03
;;;;;;;;;
;;;;;;;;	DB	$98,$20,$5F,$03
;;;;;;;;;;;;;	DB	$98,$20,$1F
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03,$03,$03,$03,$03
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03,$03,$03,$03,$03
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03
;;;;;;;;;
;;;;;;;;	DB	$98,$40,$5F,$03
;;;;;;;;;;;;;	DB	$98,$40,$1F
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03,$03,$03,$03,$03
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03,$03,$03,$03,$03
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03
;;;;;;;;;
;;;;;;;;	DB	$98,$60,$5F,$03
;;;;;;;;;;;;;	DB	$98,$60,$1F
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03,$03,$03,$03,$03
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03,$03,$03,$03,$03
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03
;;;;;;;;;;;;;	DB	    $03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03
;;;;;;;;;----------------------------------------------------
;;;;;;;;	DB	$98,$80,$5F,$03
;;;;;;;;	DB	$98,$A0,$5F,$03
;;;;;;;;	DB	$98,$C0,$5F,$03
;;;;;;;;	DB	$98,$E0,$5F,$03
;;;;;;;;;
;;;;;;;;	DB	$99,$00,$5F,$01
;;;;;;;;;;;;;	DB	$99,$00,$1F
;;;;;;;;;;;;;	DB          $05,$05,$05,$05,$05,$05,$05,$05
;;;;;;;;;;;;;	DB          $05,$05,$05,$05,$05,$05,$05,$05
;;;;;;;;;;;;;	DB          $05,$05,$05,$05,$05,$05,$05,$05
;;;;;;;;;;;;;	DB          $05,$05,$05,$05,$05,$05,$05,$05
;;;;;;;;;
;;;;;;;;	DB	$99,$20,$5F,$01
;;;;;;;;;;;;;	DB	$99,$20,$1F
;;;;;;;;;;;;;	DB	    $05,$05,$05,$05,$05,$05,$05,$05
;;;;;;;;;;;;;	DB	    $05,$05,$05,$05,$05,$05,$05,$05
;;;;;;;;;;;;;	DB	    $05,$05,$05,$05,$05,$05,$05,$05
;;;;;;;;;;;;;	DB	    $05,$05,$05,$05,$05,$05,$05,$05
;;;;;;;;;
;;;;;;;;	DB	$99,$40,$5F,$04
;;;;;;;;;;;;;	DB	$99,$40,$1F
;;;;;;;;;;;;;	DB	    $04,$04,$04,$04,$04,$04,$04,$04
;;;;;;;;;;;;;	DB	    $04,$04,$04,$04,$04,$04,$04,$04
;;;;;;;;;;;;;	DB	    $04,$04,$04,$04,$04,$04,$04,$04
;;;;;;;;;;;;;	DB	    $04,$04,$04,$04,$04,$04,$04,$04
;;;;;;;;;
;;;;;;;;	DB	$99,$60,$5F,$04
;;;;;;;;;;;;;	DB	$99,$60,$1F
;;;;;;;;;;;;;	DB	    $04,$04,$04,$04,$04,$04,$04,$04
;;;;;;;;;;;;;	DB	    $04,$04,$04,$04,$04,$04,$04,$04
;;;;;;;;;;;;;	DB	    $04,$04,$04,$04,$04,$04,$04,$04
;;;;;;;;;;;;;	DB	    $04,$04,$04,$04,$04,$04,$04,$04
;;;;;;;;;
;;;;;;;;	DB	$99,$80,$5F,$04
;;;;;;;;	DB	$99,$A0,$5F,$04
;;;;;;;;	DB	$99,$C0,$5F,$04
;;;;;;;;;
;;;;;;;;	DB	$99,$E0,$5F,$06
;;;;;;;;;;;;;	DB	$99,$E0,$1F
;;;;;;;;;;;;;	DB	    $06,$06,$06,$06,$06,$06,$06,$06
;;;;;;;;;;;;;	DB	    $06,$06,$06,$06,$06,$06,$06,$06
;;;;;;;;;;;;;	DB	    $06,$06,$06,$06,$06,$06,$06,$06
;;;;;;;;;;;;;	DB	    $06,$06,$06,$06,$06,$06,$06,$06
;;;;;;;;;
;;;;;;;;	DB	$9A,$00,$5F,$07
;;;;;;;;;;;;;	DB	$9A,$00,$1F
;;;;;;;;;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07
;;;;;;;;;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07
;;;;;;;;;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07
;;;;;;;;;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$07
;;;;;;;;;
;;;;;;;;	DB	$9A,$20,$5F,$07
;;;;;;;;;
;;;;;;;;	DB	0
;;;;;;;;;
;;;;;;;;;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;;;;;;;;;x	無理矢理タイトルロゴ！						x
;;;;;;;;;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;;;;;;;;AT_LOGODT
;;;;;;;;	DB	$98,$00,$53,$03
;;;;;;;;	DB	$98,$20,$53,$03
;;;;;;;;	DB	$98,$40,$13
;;;;;;;;	DB	    $03,$03,$00,$00,$00,$00,$00,$00,$00,$00
;;;;;;;;	DB	    $00,$00,$00,$00,$00,$00,$00,$00,$03,$03
;;;;;;;;	DB	$98,$60,$13
;;;;;;;;	DB	    $03,$03,$00,$00,$00,$00,$00,$00,$00,$00
;;;;;;;;	DB	    $00,$00,$00,$00,$00,$00,$00,$00,$03,$03
;;;;;;;;	DB	$98,$80,$13
;;;;;;;;	DB	    $03,$03,$00,$00,$00,$00,$00,$00,$00,$00
;;;;;;;;	DB	    $00,$00,$00,$00,$00,$00,$00,$00,$03,$03
;;;;;;;;	DB	$98,$A0,$13
;;;;;;;;	DB	    $03,$03,$00,$00,$00,$00,$00,$00,$00,$00
;;;;;;;;	DB	    $00,$00,$00,$00,$00,$00,$00,$00,$03,$03
;;;;;;;;	DB	$98,$C0,$13
;;;;;;;;	DB	    $03,$03,$00,$00,$00,$00,$00,$00,$00,$00
;;;;;;;;	DB	    $00,$00,$00,$00,$00,$00,$00,$00,$03,$03
;;;;;;;;	DB	$98,$E0,$13
;;;;;;;;	DB	    $03,$03,$00,$00,$00,$00,$00,$00,$00,$00
;;;;;;;;	DB	    $00,$00,$00,$00,$00,$00,$00,$00,$03,$03
;;;;;;;;	DB	$99,$00,$13
;;;;;;;;	DB	    $03,$03,$00,$00,$00,$00,$00,$00,$00,$00
;;;;;;;;	DB	    $00,$00,$00,$00,$00,$00,$00,$00,$03,$03
;;;;;;;;	DB	$99,$20,$53,$03
;;;;;;;;	DB	$99,$40,$53,$03
;;;;;;;;	DB	$99,$60,$53,$03
;;;;;;;;	DB	$99,$80,$53,$03
;;;;;;;;	DB	$99,$a0,$53,$03
;;;;;;;;	DB	$99,$c0,$53,$03
;;;;;;;;	DB	$99,$E0,$13
;;;;;;;;	DB	    $03,$03,$03,$07,$07,$07,$07,$07,$07,$07
;;;;;;;;	DB	    $07,$07,$07,$07,$07,$07,$07,$03,$03,$03
;;;;;;;;	DB	$9a,$00,$53,$03
;;;;;;;;	DB	$9a,$20,$53,$03
;;;;;;;;;
;;;;;;;;	DB	00
;;;;;;;;;
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	名前を消すＯＲ移動ＳＥＬＥＣＴ欄				x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_PSLCTBG2
	DB	$99,$E4,$43,$00
	DB	$99,$EB,$41,$00
	DB	$99,$EF,$42,$00
;
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	誰で遊戯すんねん？画面						x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_PSLCTBG
	db	$98,$00,$09
	db		$04,$04,$00,$00,$04,$04,$04,$04,$03,$03
;
	DB	$98,$20,$08
	DB		$04,$00,$00,$00,$00,$00,$00,$04,$04
	DB	$98,$40,$08
	DB		$03,$03,$03,$03,$03,$03,$03,$03,$04
	DB	$98,$60,$08
	DB		$04,$01,$01,$01,$01,$01,$01,$04,$04
;
	db	$98,$80,$13
	db		$04,$04,$01,$01,$01,$01,$04,$04,$04,$04
	db		$03,$03,$04,$04,$04,$04,$03,$03,$04,$04
;
	db	$98,$a0,$8c
	db		$04,$04,$03,$04,$03,$03,$04,$04,$03,$04
	db		$03,$04,$04
;
	db	$9a,$21,$12
	db		$03,$03,$04,$04,$04,$04,$03,$03,$04,$04
	db		$03,$03,$04,$04,$03,$03,$04,$04,$04
;
	db	$98,$b3,$8b
	db		$04,$04,$03,$03,$04,$03,$03,$03,$04,$04
	db		$03,$04
;
	DB	$98,$0A,$49,$07
	DB	$98,$29,$4A,$07
	DB	$98,$49,$4A,$07
	DB	$98,$69,$4A,$07
;
	DB	$98,$C4,$00,$00
	DB	$99,$24,$00,$00
	DB	$99,$84,$00,$00
;
	db	$99,$c2,$0f
	db		$00,$03,$00,$03,$00,$03,$00,$03,$00,$03
	db		$00,$03,$00,$03,$00,$03
;
	DB	$98,$cb,$46,$02		; ハートを赤く
	DB	$98,$eb,$46,$02
	DB	$99,$2b,$46,$02
	DB	$99,$4b,$46,$02
	DB	$99,$8b,$46,$02
	DB	$99,$ab,$46,$02
;
	DB	00
;
;
;	DB	$99,$07,$04
;	DB	$E8,$7F,$E8,$7F,$E8
;;
;	DB	0
;======================================================
S	EQU	$7E
T	EQU	$C9
M	EQU	$C8
;
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	名前を決めやう画面						x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_NSLCTBG
	DB	$98,$00,$11
	DB		$03,$03,$00,$00,$00,$00,$03,$03,$03,$03
	DB		$04,$04,$03,$03,$04,$04,$04,$04
;
	DB	$98,$20,$07
	DB		$03,$00,$00,$00,$00,$00,$00,$03
	DB	$98,$40,$47
	DB		$01
	DB	$98,$60,$07
	DB		$04,$00,$00,$00,$00,$00,$00,$04
;
	DB	$98,$30,$00,$04
	DB	$98,$50,$00,$03
	DB	$98,$70,$00,$04
;
	DB	$98,$12,$41,$07
	DB	$98,$31,$42,$07
	DB	$98,$51,$42,$07
	DB	$98,$71,$42,$07
;
	DB	$98,$28,$47,$00		; 黒（文字）の部分
	DB	$98,$48,$47,$00
	DB	$98,$68,$47,$00
	DB	$98,$a1,$53,$00
;
	DB	$98,$c1,$51,$00		; 黒（名前）の部分
	DB	$98,$e1,$51,$00
	DB	$99,$01,$51,$00
	DB	$99,$21,$51,$00
	DB	$99,$41,$51,$00
	DB	$99,$61,$51,$00
	DB	$99,$81,$51,$00
	DB	$99,$a1,$51,$00
	DB	$99,$c1,$51,$00
	DB	$99,$e0,$53,$00
	DB	$9a,$00,$53,$00
;
	DB	$98,$80,$13
	DB		$04,$04,$00,$00,$00,$00,$04,$04,$04,$04
	DB		$03,$03,$04,$04,$03,$03,$04,$04,$04,$04
;
	DB	$98,$A0,$89+2
	DB		$04,$04,$03,$04,$03,$03,$04,$04,$03,$04
	db		$04,$03
;
	DB	$98,$b3,$89+2
	DB		$03,$04,$04,$03,$04,$03,$04,$03,$04,$04
	db		$03,$04
;
	DB	$9a,$20,$13
	DB		$04,$03,$03,$04,$04,$04,$04,$03,$03,$01
	DB		$01,$03,$03,$03,$03,$04,$04,$04,$04,$03
;
	DB	00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	誰を消してまうねん？画面					x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_NCLERBG
	DB	$98,$00,$13
	DB		$00,$00,$04,$04,$00,$00,$04,$04,$04,$04
	DB		$00,$00,$04,$04,$00,$00,$00,$00,$04,$04

	DB	$98,$20,$8f
	DB		$00,$04,$00,$00,$04,$00,$04,$00,$00,$04
	DB		$00,$04,$04,$00,$04,$00

	DB	$98,$33,$8f
	DB		$04,$00,$00,$04,$00,$04,$04,$00,$04,$00
	DB		$00,$00,$04,$00,$00,$04

	DB	$99,$c1,$0f
	DB		$00,$03,$00,$03,$00,$03,$00,$03,$00,$03
	DB		$00,$03,$00,$03,$00,$03

	DB	$9a,$20,$13
	DB		$04,$04,$04,$00,$00,$04,$04,$04,$04,$00
	DB		$00,$04,$04,$00,$00,$00,$00,$04,$04,$04

	DB	00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	コピ－しちゃうわよん画面					x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_NCOPYBG
	DB	$98,$00,$13
	DB		$01,$01,$03,$03,$01,$01,$03,$03,$03,$03
	DB		$01,$01,$03,$03,$01,$01,$01,$01,$03,$03

	DB	$98,$20,$8f
	DB		$01,$03,$03,$01,$03,$03,$01,$03,$03,$01
	DB		$01,$03,$01,$03,$03,$01

	DB	$98,$33,$8f
	DB		$03,$01,$01,$03,$01,$03,$01,$03,$01,$01
	DB		$01,$03,$03,$01,$01,$03

	DB	$99,$c1,$0f
	DB		$00,$03,$00,$03,$00,$03,$00,$03,$00,$03
	DB		$00,$03,$00,$03,$00,$03

	DB	$9a,$20,$13
	DB		$01,$01,$01,$03,$03,$01,$01,$01,$01,$03
	DB		$03,$01,$01,$03,$03,$01,$01,$03,$03,$03

	DB	00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	ゲームオーバー画面						x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_GOVERBG
	DB	$98,$00,$53
	DB		$05
	DB	$98,$20,$53
	DB		$05
	DB	$98,$40,$53
	DB		$05
	DB	$98,$60,$CC
	DB		$05
	DB	$98,$61,$CC
	DB		$05
	DB	$98,$71,$CC
	DB		$05
	DB	$98,$72,$CC
	DB		$05
	DB	$98,$73,$CC
	DB		$05
	DB	$9a,$00,$53
	DB		$05
	DB	$9a,$20,$53
	DB		$05
;
	DB	$98,$83,$4d
	DB		$01
	DB	$98,$a3,$4d
	DB		$01
	DB	$98,$c3,$4d
	DB		$01
	DB	$98,$e3,$4d
	DB		$01
	DB	$99,$03,$4d
	DB		$01
	DB	$99,$23,$4d
	DB		$01
	DB	$99,$63,$4d
	DB		$01
	DB	$99,$83,$4d
	DB		$01
	DB	$99,$a3,$4d
	DB		$01
	DB	$99,$c3,$4d
	DB		$01
;
	DB	$98,$65,$49
	DB		$02
	DB	$98,$85,$49
	DB		$02
	DB	$98,$a5,$49
	DB		$02
	DB	$98,$c5,$49
	DB		$02
	DB	$98,$e5,$49
	DB		$02
;
	DB	$00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	続けてゲームする画面						x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_TSAVEBG
	DB	$98,$A5,$4B
	DB		$03
	DB	$98,$C3,$4D
	DB		$03
	DB	$98,$E3,$4D
	DB		$03
	DB	$99,$03,$4D
	DB		$03
	DB	$99,$23,$4D
	DB		$03
	DB	$99,$43,$4D
	DB		$03
;
	DB	$98,$82,$4F,$06
;;;;;	DB	$98,$82,$0F
;;;;;	DB  		$06,$06,$06,$06,$06,$06,$06,$06
;;;;;	DB		$06,$06,$06,$06,$06,$06,$06,$06
;
	DB	$98,$A2,$42,$06
;;;;;	DB	$98,$A2,$02
;;;;;	DB		$06,$06,$06
;
	DB	$98,$C2,$C4,$06
;;;;;	DB	$98,$C2,$84
;;;;;	DB	$06,$06,$06,$06,$06
;
	DB	$98,$B1,$C5,$06
;;;;;	DB	$98,$B1,$85
;;;;;	DB	$06,$06,$06,$06,$06,$06
;
	DB	$99,$62,$4F,$06
;;;;;	DB	$99,$62,$0F
;;;;;	DB		$06,$06,$06,$06,$06,$06,$06,$06
;;;;;	DB		$06,$06,$06,$06,$06,$06,$06,$06
;
	DB	$99,$83,$4F,$06
;;;;;	DB	$99,$83,$0E
;;;;;	DB		$06,$06,$06,$06,$06,$06,$06,$06
;;;;;	DB		$06,$06,$06,$06,$06,$06,$06,$06
;
	DB	$98,$C8,$43,$00
;;;;;	DB	$98,$C8,$03
;;;;;	DB		$00,$00,$00,$00
	DB	$98,$E6,$47,$00
;;;;;	DB	$98,$E6,$07
;;;;;	DB		$00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$99,$08,$00
	DB		$00
	DB	$99,$26,$47,$00
;;;;;	DB	$99,$26,$07
;;;;;	DB		$00,$00,$00,$00,$00,$00,$00,$00
;
	DB	$00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	海岸デモ							x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_LOVEDT
	DB	$98,$00,$53,$03
	DB	$98,$20,$53,$03
	DB	$98,$40,$53,$03
	DB	$98,$60,$53,$03
	DB	$98,$80,$53,$03
	DB	$98,$a0,$53,$03

	DB	$98,$c0,$53,$02
	DB	$98,$c3,$4d,$03

	DB	$98,$e0,$53,$02
	DB	$98,$e4,$4b,$03

	DB	$99,$00,$53,$02
	DB	$99,$04,$4b,$03

	DB	$99,$20,$53,$02
	DB	$99,$24,$4b,$05

	DB	$99,$40,$03
	DB		$02,$02,$04,$04
	DB	$99,$44,$4b,$00
	DB	$99,$50,$03
	DB		$04,$04,$02,$02

	DB	$99,$60,$01
	DB		$01,$06
	DB	$99,$62,$4f,$00
	DB	$99,$72,$01
	DB		$06,$01

	DB	$99,$80,$53,$01
	DB	$99,$82,$4f,$05

	DB	$99,$a0,$53,$01
	DB	$99,$a2,$4f,$07

	DB	$99,$c0,$53,$01
	DB	$99,$e0,$53,$01
	DB	$9A,$00,$53,$01
	DB	$9A,$20,$53,$01

;- - - - - - - - - - - - - - - - - - - - - 
;	ベタ部
;- - - - - - - - - - - - - - - - - - - - - 
	DB	$9A,$40,$53,$03
	DB	$9A,$60,$53,$03
	DB	$9A,$80,$53,$03
	DB	$9A,$A0,$53,$03
	DB	$9A,$C0,$53,$03
	DB	$9A,$E0,$53,$03
	DB	$9B,$00,$53,$03
	DB	$9B,$20,$53,$03
	DB	$9B,$40,$53,$03
	DB	$9B,$60,$53,$03
	DB	$9B,$80,$53,$03
	DB	$9B,$A0,$53,$03
	DB	$9B,$C0,$53,$03
	DB	$9B,$E0,$53,$03
;
	DB	00
;
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	アイテムウィンドウ画面						x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_WINDBG
	DB	$9c,$00,$7F,$01
	DB	$9c,$20,$7F,$01
	DB	$9c,$40,$7F,$01
	DB	$9c,$60,$7F,$01
	DB	$9c,$80,$7F,$01
	DB	$9c,$a0,$7F,$01
	DB	$9c,$c0,$7F,$01
	DB	$9c,$e0,$7F,$01

	DB	$9d,$00,$7F,$01
	DB	$9d,$20,$7F,$01
	DB	$9d,$40,$7F,$01
	DB	$9d,$60,$7F,$01
	DB	$9d,$80,$7F,$01
	DB	$9d,$a0,$7F,$01
	DB	$9d,$c0,$7F,$01
	DB	$9d,$e0,$7F,$01

	DB	$9e,$00,$7F,$01
	DB	$9e,$20,$7F,$01
	DB	$9e,$40,$7F,$01
	DB	$9e,$60,$7F,$01
	DB	$9e,$80,$7F,$01
	DB	$9e,$a0,$7F,$01
	DB	$9e,$c0,$7F,$01
	DB	$9e,$e0,$7F,$01

	DB	$9f,$00,$7F,$01
	DB	$9f,$20,$7F,$01
	DB	$9f,$40,$7F,$01
	DB	$9f,$60,$7F,$01
	DB	$9f,$80,$7F,$01
	DB	$9f,$a0,$7F,$01
	DB	$9f,$c0,$7F,$01
	DB	$9f,$e0,$7F,$01

;-----------------------------------------------

	DB	$9C,$0A,$49,$02		; ルピー＆ハート（上）
	DB	$9C,$2d,$46,$02		; ハート（下）

	DB	$9C,$40,$53,$01

	DB	$9C,$68,$D3,$01

; 右側アイテム
	DB	$9C,$6a,$07
	DB	$04,$00,$01,$00,$00,$00,$00,$03
	DB	$9C,$8a,$07
	DB	$04,$00,$02,$00,$00,$00,$00,$03
;
;;;;;;;;	DB	$9C,$6a,$02
;;;;;;;;	DB	$04,$00,$01
;;;;;;;;	DB	$9C,$8a,$02
;;;;;;;;	DB	$04,$00,$02
;;;;;;;;	db	09ch,071h,081h,003h
; ダンジョンキー
	DB	$9C,$aa,$06
	DB	$06,$00,$06,$00,$06,$00,$06
	DB	$9C,$ca,$06
	DB	$06,$00,$06,$00,$06,$00,$06
; 楽器
	DB	$9d,$0c,$44,$07
	DB	$9d,$2c,$44,$07
	DB	$9d,$4a,$C4,$07
	DB	$9d,$4b,$C4,$07
	DB	$9d,$51,$C4,$07
	DB	$9d,$52,$C4,$07
	DB	$9d,$ec,$44,$07
	DB	$9e,$0c,$44,$07

;;;KK;;;	DB	$9d,$0c,$04
;;;KK;;;	DB	$06,$06,$00,$02,$02
;;;KK;;;	DB	$9d,$2c,$04
;;;KK;;;	DB	$00,$00,$00,$02,$02
;;;KK;;;	DB	$9d,$4a,$84
;;;KK;;;	DB	$04,$04,$00,$01,$01
;;;KK;;;	DB	$9d,$4b,$84
;;;KK;;;	DB	$04,$04,$00,$01,$01
;;;KK;;;	DB	$9d,$51,$84
;;;KK;;;	DB	$04,$04,$00,$06,$06
;;;KK;;;	DB	$9d,$52,$84
;;;KK;;;	DB	$04,$04,$00,$06,$06
;;;KK;;;	DB	$9d,$ec,$04
;;;KK;;;	DB	$04,$04,$00,$00,$00
;;;KK;;;	DB	$9e,$0c,$04
;;;KK;;;	DB	$04,$04,$00,$00,$00

	DB	0

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	ダンジョンマップ画面？						x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_DMCLDT
	DB	$9C,$E9,$49,$01
	DB	$9D,$09,$49,$01
	DB	$9D,$29,$49,$01
	DB	$9D,$49,$49,$01
	DB	$9D,$69,$49,$01
	DB	$9D,$89,$49,$01
	DB	$9D,$A9,$49,$01
	DB	$9D,$C9,$49,$01
	DB	$9D,$E9,$49,$01
	DB	$9E,$09,$49,$01
	DB	$00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	マムー部屋ベタ							x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_MAMUUBG
;;;;	DB	$9A,$00,$53,$7E
;;;;	DB	$9A,$20,$53,$7E
;;;;	DB	$9A,$40,$53,$7E
;;;;	DB	$9A,$60,$53,$7E
;;;;	DB	$9A,$80,$53,$7E
;;;;	DB	$9A,$A0,$53,$7E
;;;;	DB	$9A,$C0,$53,$7E
;;;;	DB	$9A,$E0,$53,$7E
;;;;	DB	$9B,$00,$53,$7E
;;;;	DB	$9B,$20,$53,$7E
;;;;	DB	$9B,$40,$53,$7E
;;;;	DB	$9B,$60,$53,$7E
;;;;	DB	$9B,$80,$53,$7E
;;;;	DB	$9B,$A0,$53,$7E
;;;;	DB	$9B,$C0,$53,$7E
;;;;	DB	$9B,$E0,$53,$7E
	DB	$00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	ピーチ写真！							x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_PEACHDT
;ベタ
	DB	$98,$00,$53,$07
	DB	$98,$20,$53,$07
	DB	$98,$40,$53,$07
	DB	$98,$60,$53,$07
	DB	$98,$80,$53,$07
	DB	$98,$A0,$53,$07
	DB	$98,$C0,$53,$07
	DB	$98,$E0,$53,$07
;
	DB	$99,$00,$53,$07
	DB	$99,$20,$53,$07
	DB	$99,$40,$53,$07
	DB	$99,$60,$53,$07
	DB	$99,$80,$53,$07
	DB	$99,$A0,$53,$07
	DB	$99,$C0,$53,$07
	DB	$99,$E0,$53,$07
;
	DB	$9A,$00,$53,$07
	DB	$9A,$20,$53,$07
;- - - - - - - - - - - - - - - - - - - - 
;こっからデータ部
;- - - - - - - - - - - - - - - - - - - - 
	DB	$98,$45,$49,$02
	DB	$98,$65,$09
	DB	    $02,$06,$06,$06,$06,$06,$06,$04,$04,$02
	DB	$98,$85,$09
	DB	    $02,$06,$06,$03,$03,$03,$06,$06,$06,$02
	DB	$98,$A5,$09
	DB	    $02,$06,$06,$03,$03,$03,$03,$06,$06,$02
	DB	$98,$C5,$09
	DB	    $02,$06,$03,$00,$00,$05,$03,$03,$06,$02
	DB	$98,$E5,$09
	DB	    $02,$06,$06,$00,$00,$05,$05,$03,$06,$02
	DB	$99,$05,$09
	DB	    $02,$06,$04,$00,$00,$05,$04,$03,$06,$02
	DB	$99,$25,$09
	DB	    $02,$06,$04,$00,$00,$00,$00,$02,$06,$02
	DB	$99,$45,$09
	DB	    $02,$04,$04,$00,$00,$00,$00,$02,$06,$02
	DB	$99,$65,$09
	DB	    $02,$04,$04,$00,$00,$00,$00,$00,$03,$02
	DB	$99,$85,$0A
	DB	    $02,$04,$04,$04,$00,$00,$00,$01,$01,$06
	DB	    $01
	DB	$99,$A5,$0A
	DB	    $02,$06,$06,$06,$06,$02,$01,$01,$01,$01
	DB	    $01
	DB	$99,$CA,$46,$01
	DB	$99,$EB,$45,$01
	DB	$9A,$0B,$45,$01
	DB	$9A,$2B,$45,$01
;
	DB	00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	壁画								x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_KABEDT1
	DB	$98,$00,$53,$01		; 外壁
	DB	$98,$20,$53,$01
	DB	$98,$40,$CD,$01
	DB	$98,$41,$CD,$01
	DB	$98,$52,$CD,$01
	DB	$98,$53,$CD,$01
	DB	$9A,$00,$53,$01
	DB	$9A,$20,$53,$01

	DB	$98,$42,$4F,$00		; 内壁
	DB	$98,$62,$4F,$00
	DB	$98,$82,$4F,$00
	DB	$98,$A2,$4F,$00
	DB	$98,$C2,$4F,$00
	DB	$98,$E2,$4F,$00
	DB	$99,$02,$4F,$00
	DB	$99,$22,$4F,$00
	DB	$99,$42,$4F,$00
	DB	$99,$62,$4F,$00
	DB	$99,$82,$4F,$00
	DB	$99,$A2,$4F,$00
	DB	$99,$C2,$4F,$00
	DB	$99,$E2,$4F,$00

	DB	$98,$89,$46,$02		; 文字
	DB	$98,$A9,$46,$02
	DB	$98,$C9,$46,$02
	DB	$98,$E9,$46,$02

	DB	00


;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	私とカバとワニとバスともしかして？				x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_KABADT
	DB	$98,$00,$53,$00
	DB	$98,$20,$53,$00

	DB	$98,$40,$CC,$00
	DB	$98,$41,$CC,$00
	DB	$98,$42,$CC,$00
	DB	$98,$43,$CC,$00
	DB	$98,$44,$CB,$00
	DB	$98,$45,$CB,$02

	DB	$98,$46,$8B
	DB	    $02,$01,$07,$07,$07,$07,$02,$02
	DB	    $02,$02,$02,$02

	DB	$98,$47,$8B
	DB	    $02,$07,$07,$07,$07,$02,$02,$03
	DB	    $02,$02,$02,$03

	DB	$98,$48,$8B
	DB	    $02,$07,$07,$07,$07,$07,$06,$06
	DB	    $03,$03,$03,$06

	DB	$98,$49,$8B
	DB	    $02,$07,$07,$07,$07,$07,$06,$06
	DB	    $06,$06,$06,$06

	DB	$98,$4A,$8B
	DB	    $07,$07,$07,$07,$07,$02,$05,$06
	DB	    $06,$06,$03,$03

	DB	$98,$4B,$8B
	DB	    $02,$07,$07,$07,$07,$05,$05,$02
	DB	    $02,$03,$03,$02

	DB	$98,$4C,$8B
	DB	    $02,$05,$05,$02,$02,$04,$04,$04
	DB	    $04,$04,$02,$02

	DB	$98,$4D,$8B
	DB	    $02,$05,$05,$05,$05,$05,$04,$04
	DB	    $04,$04,$02,$02

	DB	$98,$4E,$8B
	DB	    $05,$05,$05,$05,$05,$05,$04,$04
	DB	    $04,$02,$02,$02

	DB	$98,$4F,$CB,$00
	DB	$98,$50,$CC,$00
	DB	$98,$51,$CC,$00
	DB	$98,$52,$CC,$00
	DB	$98,$53,$CC,$00

	DB	$99,$C4,$4B,$01

	DB	$99,$E0,$53,$00
	DB	$9A,$00,$53,$00
	DB	$9A,$20,$53,$00

	DB	00


;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	ＬＥＶＥＬ－７ 塔デモ						x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_TOUBGDT
	DB	$9B,$E0,$53,$00
	DB	$98,$00,$53,$00
	DB	$98,$20,$53,$00
	DB	$98,$40,$53,$00
	DB	$98,$60,$53,$00
	DB	$98,$80,$53,$00
	DB	$98,$A0,$53,$00
	DB	$98,$C0,$53,$00
	DB	$98,$E0,$53,$00
	DB	$99,$00,$53,$00
	DB	$99,$20,$53,$00
	DB	$99,$40,$53,$00
	DB	$99,$60,$53,$00
	DB	$99,$80,$53,$00
	DB	$99,$A0,$53,$00
	DB	$99,$C0,$53,$00
	DB	$99,$E0,$53,$00
	DB	$9A,$00,$53,$00
	DB	$9A,$20,$53,$00

	DB	$99,$86,$47,$05
	DB	$99,$A7,$45,$05
	DB	$99,$C7,$45,$05
	DB	$99,$E7,$45,$05
	DB	$9A,$06,$47,$05
	DB	$9A,$26,$47,$05

	DB	00


;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	地上マップ							x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_GMAPBG
	DB	$98,$00,$53,$04

	DB	$98,$20,$cf,$04
	DB	$98,$21,$cf,$04

	DB	$98,$32,$cf,$04
	DB	$98,$33,$cf,$04

	DB	$9a,$20,$53,$04

	DB	0
;
;
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング（ エンディング用卵山だけ ）			x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_ENDYMBG		; ( 1)エンディング山遠景  BG;00 ;TITLBG
	DB	$98,$00,$53,$00
	DB	$98,$20,$53,$00
	DB	$98,$40,$53,$02
	DB	$98,$60,$53,$03
	DB	$98,$80,$53,$03
	DB	$98,$A0,$53,$03
	DB	$98,$C0,$53,$03
	DB	$98,$E0,$53,$03
	DB	$99,$00,$53,$03
	DB	$99,$20,$53,$03
	DB	$99,$40,$53,$04
	DB	$99,$60,$53,$04
	DB	$99,$80,$53,$04
	DB	$99,$A0,$53,$04
	DB	$99,$C0,$53,$04
	DB	$99,$E0,$53,$04
	DB	$9A,$00,$53,$04
	DB	$9A,$20,$53,$04
;
;;;;;;	DB	$98,$49,$00,$03
;;;;;;	DB	$98,$68,$42,$03
;;;;;;
;;;;;;	DB	$98,$88,$42,$03
;;;;;;	DB	$98,$A7,$44,$03
;;;;;;	DB	$98,$C6,$47,$03
;;;;;;	DB	$98,$E5,$49,$03
;;;;;;	DB	$99,$03,$4D,$03
;;;;;;	DB	$99,$21,$51,$03
;;;;;;	DB	$99,$40,$53,$03
;;;;;;	DB	$99,$60,$41,$04
;;;;;;	DB	$99,$72,$41,$04
;
	DB	00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング（ くじらBG & 雲 ）					x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_ENDBGA
	DB	$9C,$00,$5F,$00
	DB	$9C,$20,$5F,$00
	DB	$9C,$40,$5F,$00
	DB	$9C,$60,$5F,$00
	DB	$9C,$80,$5F,$00
	DB	$9C,$A0,$5F,$00
	DB	$9C,$C0,$5F,$00
	DB	$9C,$E0,$5F,$00
;
	DB	$9D,$00,$5F,$00
	DB	$9D,$20,$5F,$00
	DB	$9D,$40,$5F,$00
	DB	$9D,$60,$5F,$00
	DB	$9D,$80,$5F,$00
	DB	$9D,$A0,$5F,$00
	DB	$9D,$C0,$5F,$00
	DB	$9D,$E0,$5F,$00
	DB	$9E,$00,$5F,$00
	DB	$9E,$20,$5F,$00
;
;- - 水柱 - - -
					; べた
	DB	$9E,$40,$cd,$00
	DB	$9E,$41,$cd,$00
	DB	$9E,$42,$cd,$00
	DB	$9E,$43,$cd,$00
	DB	$9E,$44,$cd,$00

	DB	$9E,$e5,$c7,$00
	DB	$9E,$ee,$c7,$00

	DB	$9E,$4f,$cd,$00
	DB	$9E,$50,$cd,$00
	DB	$9E,$51,$cd,$00
	DB	$9E,$52,$cd,$00
	DB	$9E,$53,$cd,$00
					; 水柱本体
	DB	$9E,$45,$49,$03
	DB	$9E,$64,$4b,$03
	DB	$9E,$83,$4d,$03
	DB	$9E,$a2,$4f,$03
	DB	$9E,$c2,$4f,$03
	DB	$9E,$e3,$0d
	DB		$03,$03,$03,$06,$05,$04,$04,$04
	DB		$04,$05,$06,$03,$03,$03
	DB	$9f,$06,$c7,$02
	DB	$9f,$07,$c7,$01
	DB	$9f,$08,$c7,$00
	DB	$9f,$09,$c7,$00
	DB	$9f,$0a,$c7,$00
	DB	$9f,$0b,$c7,$00
	DB	$9f,$0c,$c7,$01
	DB	$9f,$0d,$c7,$02

;;---雲----
					; べた
	DB 	$98,$00,$5F,$00
	DB 	$98,$20,$5F,$00
	DB 	$98,$40,$5F,$00
	DB 	$98,$60,$5F,$00
	DB 	$98,$80,$5F,$00
	DB 	$98,$A0,$5F,$00
	DB 	$98,$C0,$5F,$00
	DB 	$98,$E0,$5F,$00
	DB 	$99,$00,$5F,$00
	DB 	$99,$20,$5F,$00
	DB 	$99,$40,$5F,$00
	DB 	$99,$60,$5F,$00
	DB 	$99,$80,$5F,$00
	DB 	$99,$A0,$5F,$00
	DB 	$99,$C0,$5F,$00
	DB 	$99,$E0,$5F,$00
	DB 	$9A,$00,$5F,$00
	DB 	$9A,$20,$5F,$00
	DB 	$9B,$00,$5F,$00
	DB 	$9B,$20,$5F,$00
	DB 	$9B,$40,$5F,$00
	DB 	$9B,$80,$5F,$00
	DB 	$9B,$A0,$5F,$00
	DB 	$9B,$C0,$5F,$00
	DB 	$9B,$E0,$5F,$00
					; 雲本体
	DB 	$98,$a8,$05
	DB		$06,$00,$00,$00,06,$06

	DB 	$98,$c5,$09
	DB		$04,$04,$05,$06,$00,$00,$00,$05
	DB		$06,$01

	DB 	$98,$e5,$04
	DB		$03,$04,$04,$05,$05

	DB 	$99,$05,$0a
	DB		$07,$03,$04,$04,$05,$00,$00,$05
	DB		$00,$01,$01

	DB 	$99,$27,$09
	DB		$04,$04,$00,$00,$00,$00,$02,$02
	DB		$02,$01

	DB 	$99,$70,$01
	DB		$05,$06

	DB 	$99,$80,$00,$01

	DB 	$99,$8f,$03
	DB		$05,$05,$05,$06

	DB 	$99,$ab,$07
	DB		$05,$06,$00,$04,$05,$05,$05,$05

	DB 	$99,$c6,$0b
	DB		$02,$07,$07,$00,$00,$04,$05,$00
	DB		$04,$04,$05,$05

	DB 	$99,$e1,$0b
	DB		$07,$07,$00,$00,$00,$02,$02,$07
	DB		$00,$00,$03,$04

	DB 	$9a,$01,$13
	DB		$00,$03,$07,$07,$07,$02,$02,$02
	DB		$02,$00,$00,$03,$03,$00,$00,$00
	DB		$00,$05,$06,$00

	DB 	$9a,$21,$13
	DB		$00,$03,$03,$07,$07,$07,$07,$02
	DB		$02,$00,$00,$07,$00,$00,$03,$03
	DB		$04,$05,$05,$00
;
;(CGB：いらんはず)	DB	$9A,$40,$53,$00
;(CGB：いらんはず)	DB	$9A,$60,$53,$00
;(CGB：いらんはず)	DB	$9A,$80,$53,$00
;(CGB：いらんはず)	DB	$9A,$A0,$53,$00
;(CGB：いらんはず)	DB	$9A,$C0,$53,$00
;(CGB：いらんはず)	DB	$9A,$E0,$53,$00
;(CGB：いらんはず);
;(CGB：いらんはず)	DB	$9B,$00,$53,$00
;(CGB：いらんはず)	DB	$9B,$20,$53,$00
;(CGB：いらんはず)	DB	$9B,$40,$53,$00
;(CGB：いらんはず)	DB	$9B,$60,$53,$00
;(CGB：いらんはず)	DB	$9B,$80,$53,$00
;(CGB：いらんはず)	DB	$9B,$A0,$53,$00
;(CGB：いらんはず)	DB	$9B,$C0,$53,$00
;(CGB：いらんはず)	DB	$9B,$E0,$53,$00
	DB	00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング（ 海＋リンク 斜め後ろ ）				x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_ENDBGB2		; (17)エンディング B2 BG
	DB 	$98,$00,$5F,$00
	DB 	$98,$20,$5F,$00
	DB 	$98,$40,$5F,$00
	DB 	$98,$60,$5F,$00
	DB 	$98,$80,$5F,$00
	DB 	$98,$A0,$5F,$00
	DB 	$98,$C0,$5F,$04
	DB 	$98,$E0,$5F,$04
	DB 	$99,$00,$5F,$04
	DB 	$99,$20,$5F,$04
	DB 	$99,$40,$5F,$04
	DB 	$99,$60,$5F,$04
	DB 	$99,$80,$5F,$04
	DB 	$99,$A0,$5F,$04
	DB 	$99,$C0,$5F,$04
	DB 	$99,$E0,$5F,$04
	DB 	$9A,$00,$5F,$04
	DB 	$9A,$20,$5F,$04
	DB	00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング（ 真上画面 ）					x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_ENDBGC		; (18)エンディング C BG
	DB 	$98,$00,$5F,$00
	DB 	$98,$20,$5F,$00
	DB 	$98,$40,$5F,$00
	DB 	$98,$60,$5F,$00
	DB 	$98,$80,$5F,$00
	DB 	$98,$A0,$5F,$00
	DB 	$98,$C0,$5F,$00
	DB 	$98,$E0,$5F,$00
	DB 	$99,$00,$5F,$00
	DB 	$99,$20,$5F,$00
	DB 	$99,$40,$5F,$00
	DB 	$99,$60,$5F,$00
	DB 	$99,$80,$5F,$00
	DB 	$99,$A0,$5F,$00
	DB 	$99,$C0,$5F,$00
	DB 	$99,$E0,$5F,$00
	DB 	$9A,$00,$5F,$00
	DB 	$9A,$20,$5F,$00
;--太陽--
	DB	$98,$c8,$43,$07
	DB	$98,$e8,$43,$07
	DB	$99,$08,$43,$07
	DB	$99,$28,$43,$07
	DB	00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング（ 大リンク浮遊画面 ）				x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_ENDBGB		; (19)エンディング B BG
	DB 	$98,$00,$5F,$00
	DB 	$98,$20,$5F,$00
	DB 	$98,$40,$5F,$00
	DB 	$98,$60,$5F,$00
	DB 	$98,$80,$5F,$00
	DB 	$98,$A0,$5F,$00
	DB 	$98,$C0,$5F,$04
	DB 	$98,$E0,$5F,$04
	DB 	$99,$00,$5F,$04
	DB 	$99,$20,$5F,$04
	DB 	$99,$40,$5F,$04
	DB 	$99,$60,$5F,$04
	DB 	$99,$80,$5F,$04
	DB 	$99,$A0,$5F,$04
	DB 	$99,$C0,$5F,$04
	DB 	$99,$E0,$5F,$04
	DB 	$9A,$00,$5F,$04
	DB 	$9A,$20,$5F,$04
	DB 	$9A,$40,$5F,$04
	DB 	$9A,$60,$5F,$04
	DB 	$9A,$80,$5F,$04
	DB 	$9A,$A0,$5F,$04
	DB 	$9A,$E0,$5F,$04
	DB 	$9B,$C0,$5F,$04
	DB 	$9B,$E0,$5F,$04
;--------------------------------------------------
;- - 大リンク - -
	DB	$99,$68,$43,$03
	DB	$99,$86,$05
	DB		$01,$01,$01,$05,$05,$03
	DB	$99,$A6,$07
	DB		$01,$01,$05,$05,$05,$02,$06,$06
	DB	$99,$C4,$0C
	DB		$07,$07,$01,$01,$05,$05,$01,$02
	DB		$02,$06,$06,$07,$07
	DB	$99,$E2,$4F,$02
	DB	$99,$E8,$41,$05
	DB	$9A,$02,$00,$06
	DB	$9A,$03,$4E,$02
	DB	$9A,$22,$4F,$07
;
	DB	$00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング（ ラストスクロール画面 リンク横向き ）		x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_ENDBGD		; (1A)エンディング D BG
	DB	$98,$00,$53,$00
	DB	$98,$20,$53,$00
	DB	$98,$40,$53,$00
	DB	$98,$60,$53,$00
	DB	$98,$80,$53,$00
	DB	$98,$a0,$53,$00
	DB	$98,$c0,$53,$00
	DB	$98,$e0,$53,$00
	DB	$99,$00,$53,$00
	DB	$99,$20,$53,$00
	DB	$99,$40,$53,$04
	DB	$99,$60,$53,$04
	DB	$99,$80,$53,$04
	DB	$99,$a0,$53,$04
	DB	$99,$c0,$53,$04
	DB	$99,$e0,$53,$04
	DB	$9a,$00,$53,$04
	DB	$9a,$20,$53,$04

	DB	$9b,$e0,$53,$00

	DB	00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング（ Ｅ リンク笑う ）					x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_ENDBGE		; (1B)エンディング E BG
	DB	$98,$00,$53,$00
	DB	$98,$20,$53,$00
	DB	$98,$40,$53,$00
	DB	$98,$60,$53,$00
	DB	$98,$80,$53,$00
	DB	$98,$a0,$53,$00
	DB	$98,$c0,$53,$00
	DB	$98,$e0,$53,$00
	DB	$99,$00,$53,$00
	DB	$99,$20,$53,$00
	DB	$99,$40,$53,$00
	DB	$99,$60,$53,$00
	DB	$99,$80,$53,$00
	DB	$99,$a0,$53,$00
	DB	$99,$c0,$53,$00
	DB	$99,$e0,$53,$00
	DB	$9a,$00,$53,$00
	DB	$9a,$20,$53,$00
	DB	$9a,$40,$53,$00
	DB	$9a,$60,$53,$00

	DB	$00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング（Ｆ）						x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_ENDBGF		; (1C)エンディング F BG
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング（Ｇ）						x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_ENDBGG		; (1D)エンディング G BG
	DB 	$98,$00,$5F,$00
	DB 	$98,$20,$5F,$00
	DB 	$98,$40,$5F,$00
	DB 	$98,$60,$5F,$00
	DB 	$98,$80,$5F,$00
	DB 	$98,$A0,$5F,$00
	DB 	$98,$C0,$5F,$00
	DB 	$98,$E0,$5F,$00
	DB 	$99,$00,$5F,$00
	DB 	$99,$20,$5F,$00
	DB 	$99,$40,$5F,$00
	DB 	$99,$60,$5F,$00
	DB 	$99,$80,$5F,$04
	DB 	$99,$A0,$5F,$04
	DB 	$99,$C0,$5F,$04
	DB 	$99,$E0,$5F,$04
	DB 	$9A,$00,$5F,$04
	DB 	$9A,$20,$5F,$04
	DB 	$9A,$40,$5F,$00
	DB 	$9A,$60,$5F,$00
	DB 	$9A,$80,$5F,$00
	DB 	$9A,$A0,$5F,$00
	DB 	$9A,$C0,$5F,$00
	DB 	$9A,$E0,$5F,$00
	DB 	$9B,$00,$5F,$00
	DB 	$9B,$20,$5F,$00
	DB 	$9B,$40,$5F,$00
	DB 	$9B,$60,$5F,$00
	DB 	$9B,$80,$5F,$00
	DB 	$9B,$A0,$5F,$00
	DB 	$9B,$C0,$5F,$00
	DB 	$9B,$E0,$5F,$00
;
	DB 	$9C,$00,$5F,$00
	DB 	$9C,$20,$5F,$00
	DB 	$9C,$40,$5F,$00
	DB 	$9C,$60,$5F,$00
	DB 	$9C,$80,$5F,$00
	DB 	$9C,$A0,$5F,$00
	DB 	$9C,$C0,$5F,$00
	DB 	$9C,$E0,$5F,$00
	DB 	$9D,$00,$5F,$00
	DB 	$9D,$20,$5F,$00
	DB 	$9D,$40,$5F,$00
	DB 	$9D,$60,$5F,$00
	DB 	$9D,$80,$5F,$00
	DB 	$9D,$A0,$5F,$00
	DB 	$9D,$C0,$5F,$00
	DB 	$9D,$E0,$5F,$00
	DB 	$9E,$00,$5F,$00
	DB 	$9E,$20,$5F,$00
	DB	00


;**********************************************************
;*							  *
;*	　エンディング用思い出シーン(うるりらー)          *
;*							  *
;*	１：図書室					  *
;*	２：風見鳥					  *
;*	３：ワンワン					  *
;*	４：森						  *
;*	５：浜辺					  *
;*							  *
;**********************************************************
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング（ 図書館内では静かにうるりらー ）			x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_ENDBGA1		; (1E) 
	DB	$99,$E0,$13
	DB	    $1B,$1B,$48,$49,$30,$31,$32,$33,$7F,$5A
	DB	    $74,$74,$7F,$5A,$30,$31,$32,$33,$30,$31
	DB	$98,$00,$13
	DB	    $1B,$1B,$48,$49,$1A,$5A,$5A,$7F,$5A,$7F
	DB	    $5A,$7F,$5A,$7F,$74,$74,$5A,$7F,$24,$25
	DB	$98,$20,$13
	DB	    $1B,$1B,$48,$49,$5A,$1A,$7F,$5A,$7F,$5A
	DB	    $7F,$5A,$7F,$5A,$74,$74,$7F,$5A,$34,$35
	DB	$98,$40,$13
	DB	    $1B,$1B,$48,$49,$5E,$5E,$5E,$5E,$5E,$5E
	DB	    $5A,$7F,$5A,$7F,$74,$74,$5A,$7F,$20,$21
	DB	$98,$60,$13
	DB	    $1B,$1B,$48,$49,$5F,$5F,$5F,$5F,$5F,$5F
	DB	    $7F,$5A,$7F,$5A,$74,$74,$7F,$5A,$30,$31
	DB	$98,$80,$13
	DB	    $1B,$1B,$48,$49,$2C,$2D,$2E,$2F,$2C,$2D
	DB	    $5A,$7F,$5A,$7F,$74,$74,$5A,$7F,$24,$25
	DB	$98,$A0,$13
	DB	    $1B,$1B,$48,$49,$3C,$3D,$3E,$3F,$3C,$3D
	DB	    $7F,$5A,$7F,$5A,$74,$74,$7F,$5A,$34,$35
	DB	$98,$C0,$13
	DB	    $1B,$1B,$48,$49,$5A,$7F,$5A,$7F,$5A,$7F
	DB	    $5A,$7F,$74,$74,$74,$74,$1A,$5A,$20,$21
	DB	$98,$E0,$13
	DB	    $1B,$1B,$48,$49,$7F,$5A,$7F,$5A,$7F,$5A
	DB	    $7F,$5A,$74,$74,$74,$74,$5A,$1A,$30,$31
;
	DB	$99,$00,$13
	DB	    $1B,$1B,$48,$49,$5A,$7F,$5A,$7F,$5A,$7F
	DB	    $74,$74,$74,$74,$5A,$7F,$14,$16,$24,$25
	DB	$99,$20,$13
	DB	    $1B,$1B,$48,$49,$7F,$5A,$7F,$5A,$7F,$5A
	DB	    $74,$74,$74,$74,$7F,$5A,$15,$17,$34,$35
	DB	$99,$40,$13
	DB	    $1B,$1B,$48,$49,$5A,$7F,$5A,$7F,$5A,$7F
	DB	    $74,$74,$5A,$7F,$5A,$7F,$14,$16,$20,$21
	DB	$99,$60,$13
	DB	    $1B,$1B,$48,$49,$7F,$5A,$7F,$5A,$7F,$5A
	DB	    $74,$74,$7F,$5A,$7F,$5A,$15,$17,$30,$31
	DB	$99,$80,$13
	DB	    $1B,$1B,$48,$49,$5A,$7F,$5A,$7F,$5A,$7F
	DB	    $74,$74,$5A,$7F,$5A,$7F,$20,$21,$22,$29
	DB	$99,$A0,$13
	DB	    $1B,$1B,$48,$49,$7F,$5A,$7F,$5A,$7F,$5A
	DB	    $74,$74,$7F,$5A,$7F,$5A,$30,$31,$32,$33
	DB	$99,$C0,$13
	DB	    $1B,$1B,$48,$49,$20,$21,$22,$23,$5A,$7F
	DB	    $74,$74,$5A,$7F,$20,$21,$22,$29,$28,$21
	DB	$99,$E0,$13
	DB	    $1B,$1B,$48,$49,$30,$31,$32,$33,$7F,$5A
	DB	    $74,$74,$7F,$5A,$30,$31,$32,$33,$30,$31
	DB	$9A,$00,$13
	DB	    $1B,$1B,$48,$49,$24,$25,$26,$27,$5A,$7F
	DB	    $74,$74,$5A,$7F,$24,$25,$28,$21,$22,$29
	DB	$9A,$20,$13
	DB	    $1B,$1B,$48,$49,$34,$35,$36,$37,$7F,$5A
	DB	    $74,$74,$7F,$5A,$34,$35,$30,$31,$32,$33
;
	DB	00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング（ 必殺！風見鳥旋風脚でうるりらー ）		x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_ENDBGA2		; (1F) 
	DB	$98,$00,$13
	DB	    $26,$27,$5A,$7F,$44,$56,$55,$56,$55,$56
	DB	    $55,$56,$55,$56,$55,$56,$55,$56,$55,$56
	DB	$98,$20,$13
	DB	    $36,$37,$7F,$5A,$54,$56,$55,$56,$55,$56
	DB	    $55,$56,$55,$56,$55,$56,$55,$56,$55,$56
	DB	$98,$40,$13
	DB	    $22,$23,$5A,$7F,$5A,$7F,$EF,$EF,$EF,$EF
	DB	    $EF,$EF,$EF,$EF,$EF,$EF,$5A,$7F,$5A,$7F
	DB	$98,$60,$13
	DB	    $32,$33,$7F,$5A,$7F,$5A,$EF,$EF,$EF,$EF
	DB	    $EF,$EF,$EF,$EF,$EF,$EF,$7F,$5A,$7F,$5A
	DB	$98,$80,$13
	DB	    $26,$27,$5A,$7F,$EF,$EF,$EF,$EF,$1A,$5A
	DB	    $1A,$5A,$1A,$5A,$EF,$EF,$EF,$EF,$5A,$7F
	DB	$98,$A0,$13
	DB	    $36,$37,$7F,$5A,$EF,$EF,$EF,$EF,$5A,$1A
	DB	    $5A,$1A,$5A,$1A,$EF,$EF,$EF,$EF,$7F,$5A
	DB	$98,$C0,$13
	DB	    $22,$23,$5A,$7F,$EF,$EF,$1A,$5A,$EF,$EF
	DB	    $E0,$E1,$EF,$EF,$1A,$5A,$EF,$EF,$5A,$7F
	DB	$98,$E0,$13
	DB	    $32,$33,$7F,$5A,$EF,$EF,$5A,$1A,$EF,$EF
	DB	    $F0,$F1,$EF,$EF,$5A,$1A,$EF,$EF,$7F,$5A
;
	DB	$99,$00,$13
	DB	    $26,$27,$5A,$7F,$EF,$EF,$1A,$5A,$EF,$EF
	DB	    $E2,$E3,$EF,$EF,$1A,$5A,$EF,$EF,$5A,$7F
	DB	$99,$20,$13
	DB	    $36,$37,$7F,$5A,$EF,$EF,$5A,$1A,$EF,$EF
	DB	    $F2,$F3,$EF,$EF,$5A,$1A,$EF,$EF,$7F,$5A
	DB	$99,$40,$13
	DB	    $22,$23,$5A,$7F,$EF,$EF,$1A,$5A,$EF,$EF
	DB	    $EF,$EF,$EF,$EF,$1A,$5A,$EF,$EF,$5A,$7F
	DB	$99,$60,$13
	DB	    $32,$33,$7F,$5A,$EF,$EF,$5A,$1A,$EF,$EF
	DB	    $EF,$EF,$EF,$EF,$5A,$1A,$EF,$EF,$7F,$5A
	DB	$99,$80,$13
	DB	    $26,$27,$5A,$7F,$EF,$EF,$EF,$EF,$1A,$5A
	DB	    $1A,$5A,$1A,$5A,$EF,$EF,$EF,$EF,$74,$74
	DB	$99,$A0,$13
	DB	    $36,$37,$7F,$5A,$EF,$EF,$EF,$EF,$5A,$1A
	DB	    $5A,$1A,$5A,$1A,$EF,$EF,$EF,$EF,$74,$74
	DB	$99,$C0,$13
	DB	    $22,$23,$5A,$7F,$5A,$7F,$EF,$EF,$EF,$EF
	DB	    $EF,$EF,$EF,$EF,$EF,$EF,$5A,$7F,$5A,$7F
	DB	$99,$E0,$13
	DB	    $32,$33,$7F,$5A,$7F,$5A,$EF,$EF,$EF,$EF
	DB	    $EF,$EF,$EF,$EF,$EF,$EF,$7F,$5A,$7F,$5A
	DB	$9A,$00,$13
	DB	    $26,$27,$5A,$7F,$5A,$7F,$5A,$7F,$5A,$7F
	DB	    $5A,$7F,$5A,$7F,$5A,$7F,$5A,$7F,$5A,$7F
	DB	$9A,$20,$13
	DB	    $36,$37,$7F,$5A,$7F,$5A,$7F,$5A,$7F,$5A
	DB	    $7F,$5A,$7F,$5A,$7F,$5A,$7F,$5A,$7F,$5A
;
	DB	00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング（ 犬っころでうるりワンワン ）			x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_ENDBGA3		; (20) 
	DB	$98,$00,$13
	DB	    $24,$25,$26,$27,$24,$25,$26,$27,$75,$75
	DB	    $75,$75,$75,$75,$24,$25,$26,$27,$24,$25
	DB	$98,$20,$13
	DB	    $34,$35,$36,$37,$34,$35,$36,$37,$75,$75
	DB	    $75,$75,$75,$75,$34,$35,$36,$37,$34,$35
	DB	$98,$40,$13
	DB	    $74,$74,$74,$74,$E6,$E7,$E7,$E7,$E7,$E8
	DB	    $75,$75,$5A,$7F,$5A,$7F,$5A,$7F,$5A,$7F
	DB	$98,$60,$13
	DB	    $74,$74,$74,$74,$E9,$7C,$7C,$7C,$7C,$F9
	DB	    $75,$75,$7F,$5A,$7F,$5A,$7F,$5A,$7F,$5A
	DB	$98,$80,$13
	DB	    $5A,$7F,$74,$74,$E9,$7C,$7C,$7C,$7C,$F9
	DB	    $5E,$5E,$1A,$5A,$5A,$7F,$5A,$7F,$5A,$7F
	DB	$98,$A0,$13
	DB	    $7F,$5A,$74,$74,$F6,$F7,$F7,$F7,$F7,$F8
	DB	    $5F,$5F,$5A,$1A,$7F,$5A,$7F,$5A,$7F,$5A
	DB	$98,$C0,$13
	DB	    $5A,$7F,$74,$74,$2C,$2D,$2E,$2F,$2C,$2D
	DB	    $2E,$2F,$EC,$EC,$75,$75,$5A,$7F,$5A,$7F
	DB	$98,$E0,$13
	DB	    $7F,$5A,$74,$74,$3C,$3D,$3E,$3F,$3C,$3D
	DB	    $3E,$3F,$FC,$FC,$75,$75,$7F,$5A,$7F,$5A
;
	DB	$99,$00,$13
	DB	    $5A,$7F,$74,$74,$74,$74,$74,$74,$74,$EC
	DB	    $75,$75,$75,$75,$75,$75,$75,$75,$5A,$7F
	DB	$99,$20,$13
	DB	    $7F,$5A,$74,$74,$74,$74,$74,$74,$74,$FC
	DB	    $75,$75,$75,$75,$75,$75,$75,$75,$7F,$5A
	DB	$99,$40,$13
	DB	    $5A,$7F,$5A,$7F,$1A,$5A,$75,$75,$75,$75
	DB	    $75,$75,$75,$75,$75,$75,$5A,$7F,$5A,$7F
	DB	$99,$60,$13
	DB	    $7F,$5A,$7F,$5A,$5A,$1A,$75,$75,$75,$75
	DB	    $75,$75,$75,$75,$75,$75,$7F,$5A,$7F,$5A
	DB	$99,$80,$13
	DB	    $74,$74,$74,$74,$5A,$7F,$5A,$7F,$5A,$7F
	DB	    $5A,$7F,$5A,$7F,$5A,$7F,$1A,$5A,$5A,$7F
	DB	$99,$A0,$13
	DB	    $74,$74,$74,$74,$7F,$5A,$7F,$5A,$7F,$5A
	DB	    $7F,$5A,$7F,$5A,$7F,$5A,$5A,$1A,$7F,$5A
	DB	$99,$C0,$13
	DB	    $22,$23,$74,$74,$74,$74,$74,$74,$74,$74
	DB	    $74,$74,$74,$74,$74,$74,$74,$74,$74,$74
	DB	$99,$E0,$13
	DB	    $32,$33,$74,$74,$74,$74,$74,$74,$74,$74
	DB	    $74,$74,$74,$74,$74,$74,$74,$74,$74,$74
	DB	$9A,$00,$13
	DB	    $26,$27,$5A,$7F,$5A,$7F,$5A,$7F,$5A,$7F
	DB	    $5A,$7F,$5A,$7F,$5A,$7F,$5A,$7F,$5A,$7F
	DB	$9A,$20,$13
	DB	    $36,$37,$7F,$5A,$7F,$5A,$7F,$5A,$7F,$5A
	DB	    $7F,$5A,$7F,$5A,$7F,$5A,$7F,$5A,$7F,$5A
;
	DB	00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング（ 森，森で待ってうるりらー BY ﾌｸﾛｳ ）		x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_ENDBGA4		; (21) 
	DB	$98,$00,$13
	DB	    $92,$7C,$92,$7C,$92,$83,$5A,$7F,$5A,$7F
	DB	    $5A,$7F,$75,$75,$82,$7C,$92,$7C,$24,$25
	DB	$98,$20,$13
	DB	    $7C,$92,$7C,$84,$80,$89,$7F,$5A,$7F,$5A
	DB	    $7F,$5A,$75,$75,$82,$92,$7C,$92,$8E,$8F
	DB	$98,$40,$13
	DB	    $92,$7C,$92,$83,$5A,$7F,$5A,$7F,$5A,$7F
	DB	    $5A,$7F,$75,$75,$82,$7C,$92,$7C,$28,$21
	DB	$98,$60,$13
	DB	    $7C,$84,$80,$89,$7F,$5A,$7F,$5A,$7F,$5A
	DB	    $7F,$5A,$75,$75,$88,$80,$85,$92,$30,$31
	DB	$98,$80,$13
	DB	    $92,$83,$8C,$8D,$5A,$7F,$14,$16,$14,$16
	DB	    $5A,$7F,$5A,$7F,$1A,$5A,$82,$7C,$24,$25
	DB	$98,$A0,$13
	DB	    $7C,$83,$9C,$9D,$7F,$5A,$15,$17,$15,$17
	DB	    $7F,$5A,$7F,$5A,$5A,$1A,$82,$92,$8E,$8F
	DB	$98,$C0,$13
	DB	    $92,$83,$5A,$7F,$14,$16,$20,$21,$22,$23
	DB	    $14,$16,$1A,$5A,$75,$75,$82,$7C,$28,$21
	DB	$98,$E0,$13
	DB	    $7C,$83,$7F,$5A,$15,$17,$30,$31,$32,$33
	DB	    $15,$17,$5A,$1A,$75,$75,$82,$92,$30,$31
;
	DB	$99,$00,$13
	DB	    $92,$83,$5A,$7F,$14,$16,$24,$25,$26,$27
	DB	    $14,$16,$5A,$7F,$75,$75,$82,$7C,$24,$25
	DB	$99,$20,$13
	DB	    $7C,$83,$7F,$5A,$15,$17,$34,$35,$36,$37
	DB	    $15,$17,$7F,$5A,$75,$75,$82,$92,$8E,$8F
	DB	$99,$40,$13
	DB	    $92,$83,$5A,$7F,$5A,$7F,$14,$16,$14,$16
	DB	    $5A,$7F,$75,$75,$75,$75,$82,$7C,$28,$21
	DB	$99,$60,$13
	DB	    $7C,$83,$7F,$5A,$7F,$5A,$15,$17,$15,$17
	DB	    $7F,$5A,$75,$75,$75,$75,$82,$92,$30,$31
	DB	$99,$80,$13
	DB	    $92,$83,$5A,$7F,$5A,$7F,$1A,$5A,$8C,$8D
	DB	    $5A,$7F,$75,$75,$8A,$81,$92,$7C,$24,$25
	DB	$99,$A0,$13
	DB	    $7C,$83,$7F,$5A,$7F,$5A,$5A,$1A,$9C,$9D
	DB	    $7F,$5A,$75,$75,$82,$92,$7C,$92,$8E,$8F
	DB	$99,$C0,$13
	DB	    $92,$86,$81,$81,$81,$8B,$5A,$7F,$5A,$7F
	DB	    $5A,$7F,$75,$75,$82,$7C,$92,$7C,$28,$21
	DB	$99,$E0,$13
	DB	    $7C,$92,$7C,$92,$7C,$83,$7F,$5A,$7F,$5A
	DB	    $7F,$5A,$75,$75,$82,$92,$7C,$92,$30,$31
	DB	$9A,$00,$13
	DB	    $92,$7C,$92,$7C,$92,$83,$5A,$7F,$5A,$7F
	DB	    $75,$75,$75,$75,$82,$7C,$92,$7C,$24,$25
	DB	$9A,$20,$13
	DB	    $7C,$92,$7C,$92,$7C,$83,$7F,$5A,$7F,$5A
	DB	    $75,$75,$75,$75,$82,$92,$7C,$92,$8E,$8F
;
	DB	00

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング（ 哀愁の浜辺(黄昏のうるりらー) ）			x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
AT_ENDBGA5		; (22) 
	DB	$98,$00,$13
	DB	    $76,$76,$49,$59,$AC,$AD,$AC,$AD,$AC,$AD
	DB	    $AC,$AD,$AC,$AD,$44,$56,$48,$51,$45,$45
	DB	$98,$20,$13
	DB	    $76,$76,$49,$59,$BC,$BD,$BC,$BD,$BC,$BD
	DB	    $BC,$BD,$BC,$BD,$44,$56,$44,$56,$55,$56
	DB	$98,$40,$13
	DB	    $45,$45,$52,$59,$AC,$AD,$AC,$AD,$AC,$AD
	DB	    $AC,$AD,$AA,$AB,$44,$56,$44,$56,$55,$56
	DB	$98,$60,$13
	DB	    $55,$56,$55,$47,$BC,$BD,$BC,$BD,$BC,$BD
	DB	    $BC,$BD,$BA,$BB,$54,$56,$44,$56,$55,$56
	DB	$98,$80,$13
	DB	    $55,$56,$55,$47,$AC,$AD,$AC,$AD,$AC,$AD
	DB	    $AC,$AD,$AC,$AD,$AC,$AD,$44,$56,$55,$56
	DB	$98,$A0,$13
	DB	    $55,$56,$55,$57,$BC,$BD,$BC,$BD,$BC,$BD
	DB	    $BC,$BD,$BC,$BD,$BC,$BD,$54,$56,$55,$56
	DB	$98,$C0,$13
	DB	    $AC,$AD,$AC,$AD,$AC,$AD,$AC,$AD,$AC,$AD
	DB	    $AE,$AF,$AC,$AD,$AC,$AD,$AA,$AB,$AC,$AD
	DB	$98,$E0,$13
	DB	    $BC,$BD,$BC,$BD,$BC,$BD,$BC,$BD,$BC,$BD
	DB	    $BE,$BF,$BC,$BD,$BC,$BD,$BA,$BB,$BC,$BD
;
	DB	$99,$00,$13
	DB	    $4A,$4A,$4A,$4D,$AC,$AD,$AC,$AD,$AE,$AF
	DB	    $AC,$AD,$AC,$AD,$A8,$A9,$AC,$AD,$AC,$AD
	DB	$99,$20,$13
	DB	    $45,$45,$5D,$59,$BC,$BD,$BC,$BD,$BE,$BF
	DB	    $BC,$BD,$BC,$BD,$B8,$B9,$BC,$BD,$BC,$BD
	DB	$99,$40,$13
	DB	    $76,$76,$49,$59,$1C,$1D,$1C,$1D,$1C,$1D
	DB	    $1C,$1D,$1C,$1D,$1C,$1D,$1C,$1D,$1C,$1D
	DB	$99,$60,$13
	DB	    $76,$76,$49,$59,$1E,$1F,$1E,$1F,$1E,$1F
	DB	    $1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F
	DB	$99,$80,$13
	DB	    $45,$45,$52,$59,$1E,$1F,$1E,$1F,$1E,$1F
	DB	    $1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F
	DB	$99,$A0,$13
	DB	    $55,$56,$55,$47,$1E,$1F,$1E,$1F,$1E,$1F
	DB	    $1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F
	DB	$99,$C0,$13
	DB	    $55,$56,$55,$47,$1E,$1F,$1E,$1F,$1E,$1F
	DB	    $1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F
	DB	$99,$E0,$13
	DB	    $55,$56,$55,$57,$1E,$1F,$1E,$1F,$1E,$1F
	DB	    $1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F
	DB	$9A,$00,$13
	DB	    $1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F
	DB	    $1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F
	DB	$9A,$20,$13
	DB	    $1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F
	DB	    $1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F,$1E,$1F
;
	DB	00





;┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
;┃	zcol.s のプログラムをここに移動				       ┃
;┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	迷いの森 カラーチェンジ						x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;------------------------------------------------------------------------
;	カラーデータアドレス
;------------------------------------------------------------------------
;-----<	迷いの森ＩＮ >---------------------------------------------------
MORIIN_COL_ADRS
		DW	CL_MORI_2	; (0) 中間（２）
		DW	CL_MORI_2+0020H	; (1)      ”
		DW	CL_MORI_1	; (2) 中間（１）
		DW	CL_MORI_1+0020H	; (3)      ”
		DW	CL_MORI_0	; (4) bg_0.col 迷いの森
		DW	CL_MORI_0+0020H	; (5)      ”

;-----<	迷いの森ＯＵＴ >-------------------------------------------------
MORIOUT_COL_ADRS
		DW	CL_MORI_1	; (0) 中間（１）
		DW	CL_MORI_1+0020H	; (1)      ”
		DW	CL_MORI_2	; (2) 中間（２）
		DW	CL_MORI_2+0020H	; (3)      ”
		DW	CL_MORI_3	; (4) cz3.col  メーベの村
		DW	CL_MORI_3+0020H	; (5)      ”

;------------------------------------------------------------------------
;	カラー転送先アドレス
;------------------------------------------------------------------------
MORI_TRAN_ADRS
		DW	CGWORK		; (0)
		DW	CGWORK+0020H	; (1)
		DW	CGWORK		; (2)
		DW	CGWORK+0020H	; (3)
		DW	CGWORK		; (4)
		DW	CGWORK+0020H	; (5)
;========================================================================

MORI_COL_CHANGE
;;;;;;;		LD	A,(CGBFLG)
;;;;;;;		AND	A		; カラーゲームボーイ？
;;;;;;;		RET	Z		; ＮＯ
		LD	A,(DJFLAG)
		AND	A		; 地上？
		RET	NZ		; ＮＯ
		LD	A,(MORIFLG)
		AND	A		; カラーチェンジ？
		RET	Z		; ＮＯ
;------------------------------------------------------------------------
		LD	A,(MORIFCT)
		DEC	A
		LD	(MORIFCT),A	; 下位２０Ｈチェンジ？
		JR	Z,MORI_COL_050	; ＹＥＳ
		CP	$01		; 上位２０Ｈチェンジ？
		RET	NZ		; ＮＯ
MORI_COL_050
		LD	A,(MORIFLG)
		BIT	7,A		; 迷いの森を出る？
		JR	NZ,MORI_COL_100	; ＹＥＳ
;------------------------------------------------------------------------
;	迷いの森ＩＮ
;------------------------------------------------------------------------
		LD	HL,MORIIN_COL_ADRS
		JR	MORI_COL_150
;------------------------------------------------------------------------
;	迷いの森ＯＵＴ
;------------------------------------------------------------------------
MORI_COL_100
		LD	HL,MORIOUT_COL_ADRS
;------------------------------------------------------------------------
MORI_COL_150
		LD	A,(MORIFCT)
		CP	$01
		JR	Z,MORI_COL_160

		LD	A,MORI_FRCNT	; フレームカウンタリセット
		LD	(MORIFCT),A
MORI_COL_160
		PUSH	HL
		LD	A,(MORIFLG)
		AND	%00111111
		SLA	A
		LD	C,A
		LD	B,$0
		LD	HL,MORI_TRAN_ADRS
		ADD	HL,BC
		LD	A,(HLI)
		LD	E,A		; 転送先アドレス（ＬＯＷ）
		LD	D,(HL)		;     ”        （ＨＩＧＨ）
		POP	HL
		ADD	HL,BC
		LD	A,(HLI)
		LD	H,(HL)		; 転送元アドレス（ＬＯＷ）
		LD	L,A		;     ”        （ＨＩＧＨ）
		LD	BC,$0020	; 個数

		CALL	DATA_MOV	; データ転送

		LD	A,(MORIFLG)
		AND	%00000001
		SWAP	A		; 0 or 4*4
		LD	(COLOFS),A	; 転送オフセット
		LD	A,4*4
		LD	(COLLNG),A	; 転送長さ
		LD	A,BGCOL_BITFG|$80
		LD	(CGDMAF),A	; 転送フラグ（部分転送）

		LD	A,(MORIFLG)
		INC	A
		LD	(MORIFLG),A
		AND	%00111111
		CP	%00000110	; 森カラーチェンジ終了？
		RET	NZ		; ＮＯ

		XOR	A
		LD	(MORIFLG),A	; フラグクリア
		RET

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	迷いの森 入れ替えカラーデータ（０）				x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
CL_MORI_0
; ＜ ＢＧ： cz0.col BANK=0 ＞
		DW	$76f3,$098d,$0ca9,$0000	; ( 0 )
		DW	$76f3,$51ac,$2066,$0000	; ( 1 )
		DW	$76f3,$1417,$100c,$0000	; ( 2 )
		DW	$76f3,$0997,$088b,$0000	; ( 3 )
		DW	$76f3,$30c0,$1801,$0000	; ( 4 )
		DW	$094f,$098d,$0ca9,$0000	; ( 5 )
		DW	$76f3,$3626,$1963,$0000	; ( 6 )
		DW	$47ff,$76f3,$2562,$0000	; ( 7 )

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	迷いの森 入れ替えカラーデータ（１）				x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
CL_MORI_1
; ＜ ＢＧ： cz0.col BANK=1 ＞
		DW	$5b33,$120a,$0465,$0000	; ( 0 )
		DW	$5b33,$5212,$28a5,$0000	; ( 1 )
		DW	$5b33,$1417,$100b,$0000	; ( 2 )
		DW	$5b33,$11d9,$0cae,$0000	; ( 3 )
		DW	$5b33,$48c1,$1c01,$0000	; ( 4 )
		DW	$0972,$120a,$0465,$0000	; ( 5 )
		DW	$5b33,$2a68,$1964,$0000	; ( 6 )
		DW	$5bff,$5b33,$1901,$0000	; ( 7 )

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	迷いの森 入れ替えカラーデータ（２）				x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
CL_MORI_2
; ＜ ＢＧ： cz0.col BANK=2 ＞
		DW	$4b78,$1a67,$0cc3,$0000	; ( 0 )
		DW	$4b78,$5212,$2886,$0000	; ( 1 )
		DW	$4b78,$1417,$100a,$0000	; ( 2 )
		DW	$4b78,$11d9,$0cae,$0000	; ( 3 )
		DW	$4b78,$60c2,$2401,$0000	; ( 4 )
		DW	$0d95,$1a67,$0cc3,$0000	; ( 5 )
		DW	$4b78,$1eaa,$1985,$0000	; ( 6 )
		DW	$6fff,$4b78,$1503,$0000	; ( 7 )

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	迷いの森 入れ替えカラーデータ（３）				x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
CL_MORI_3
; ＜ ＢＧ： cz3.col ＞
		DW	$47ff,$26c4,$1521,$0000	; ( 0 )
		DW	$47ff,$51f3,$2867,$0000	; ( 1 )
		DW	$47ff,$1419,$100a,$0000	; ( 2 )
		DW	$47ff,$11d9,$10ce,$0000	; ( 3 )
		DW	$47ff,$7cc3,$2c00,$0000	; ( 4 )
		DW	$11d9,$26c4,$1521,$0000	; ( 5 )
		DW	$47ff,$12ec,$15a6,$0000	; ( 6 )
		DW	$47ff,$7c75,$3c07,$0000	; ( 7 )


;┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
;┃	zbs.s のプログラムをここに移動				       ┃
;┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	特殊ユニットセット						x
;x----------------------------------------------------------------------x
;x	    ＥＮＴＲＹ							x
;x		Ｄ         ： ユニットＮｏ．				x
;x		Ｅ         ： ユニット個数				x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
Ground_SPunit_set
;;;;;;;		LD	A,(BC)

		PUSH	DE
		LD	A,D		; LD   A,(BC)
		SUB	EXUNST
		SLA	A
		LD	D,$0
		LD	E,A
		LD	HL,SPunit_table
		ADD	HL,DE
		LD	A,(HLI)
		LD	H,(HL)
		LD	L,A

		POP	DE		; DEC  BC
		LD	A,E		; LD   A,(BC)
		JP	(HL)

SPunit_table
		DW	BWOOD0ST	; (F5) Big wood
		DW	HOUSE0ST	; (F6) Side long home (house)
		DW	HOUSE2ST	; (F7) Nomal home (house)
		DW	SEKIZOST	; (F8) Sekizou and dangon in
		DW	CASINSET	; (F9) Casle in set(iriguchi)
		DW	BOMGZSET	; (FA) Bomb de kowareru big iwa00
		DW	UWOODSET	; (FB) 海の木
		DW	TOIRESET	; (FC) トイレセット
		DW	PREHBSET	; (FD) プレハブ(常駐の家)

;-------------------------------------
;	でっかい木
;-------------------------------------
BWOOD0ST
	DEC	BC
;
;(いらん)	LD	A,(BC)
	ADD	A,$11
	LD	E,A
	AND	$0F
	JR	NZ,BWS010
;
	LD	A,E
	SUB	$10
	LD	E,A
BWS010
	LD	D,$0
	LD	HL,BGUNDT
	ADD	HL,DE
;
	LD	A,(WORK0)
	AND	A
	JR	Z,WD0SUB	; Kahen ?
;				; yes !
	AND	$0F
	LD	E,A
WD0S06
	CALL	WD0SUB
	DEC	BC
;
	LD	A,(WORK0)
	AND	%01000000
	LD	D,$F1
	JR	Z,WD0S08
	LD	D,$0F
WD0S08
	LD	A,L
	ADD	A,D
	LD	L,A
	DEC	E
	JR	NZ,WD0S06
;
	INC	BC
	RET
;-------------------------------------
WD0SUB
;- - Uper set - -
	LD	A,(HL)
	CP	$10  ;WOD00
	LD	A,WOD00
	JR	C,WD0S10	; Already seted ?
	ADD	A,$04		; yes ! mixed unit set !
WD0S10
	LD	(HLI),A
;
	LD	A,(HL)
	CP	$10  ;WOD00
	LD	A,WOD01
	JR	C,WD0S20
	ADD	A,$04
WD0S20
	LD	(HLD),A
;- - Lower set - -
	LD	A,L
	ADD	A,$10
	LD	L,A
;
	LD	A,(HL)
	CP	STB06
	JR	NC,WD0S28
	CP	$10  ;WOD00
	LD	A,WOD02
	JR	C,WD0S30	; Already set->Mix set
;
	LD	A,WOD05
	JR	WD0S30
WD0S28
	LD	A,MWOD1
WD0S30
	LD	(HLI),A
	LD	A,(HL)
	CP	STB06
	JR	NC,WDS038
	CP	$10  ;WOD00
	LD	A,WOD03
	JR	C,WDS050
;
	LD	A,WOD04
	JR	WDS050
WDS038
	LD	A,MWOD2
WDS050
	LD	(HL),A
	INC	BC
	RET
;=========================================
SEKISAD
	DB      $00,$01,$02
	DB      $10,$11,$12
	DB	$0FF
SEKISNO
	DB	SEKZ0,SEKZ1,SEKZ2
	DB	SEKZ3,ANA02,SEKZ4
	
;-------------------------------------
;-------------------------------------
SEKIZOST
	PUSH    BC
;
;(CGB)	CALL	SSUB
		CALL	SSUB_SP
;
	LD	BC,SEKISAD
;
	LD	DE,SEKISNO
;(CGB)	JP	UNSTSB
		JP	UNSTSB_SP
;-------------------------------------
SSUB_SP
	DEC	BC
;;;;;;;;	LD	A,(BC)
	LD	E,A
	LD	D,$0
	LD	HL,BGUNDT+$11
	ADD	HL,DE
	RET
;
;-------------------------------------
HOU0SAD
	DB      $00,$01,$02,$03,$04
	DB      $10,$11,$12,$13,$14
	DB      $20,$21,$22,$23,$24
	DB	$0FF
HOU0SNO
	DB	YANE2,YANE7,YANE7,YANE7,YANE3
	DB	YANE4,YANE6,YANE6,YANE6,YANE5
	DB	WIND0,ANA01,WIND0,ANA01,WIND0
;=========================================
HOUSE0ST
	PUSH    BC
;
;(CGB)	CALL	SSUB
		CALL	SSUB_SP
;
	LD	BC,HOU0SAD
;
	LD	DE,HOU0SNO
;(CGB)	JP	UNSTSB
		JP	UNSTSB_SP
;=========================================
HOU2SAD
	DB      $00,$01,$02
	DB      $10,$11,$12
	DB      $20,$21,$22
	DB	$0FF
HOU2SNO
	DB	YANE2,YANE7,YANE3
	DB	YANE4,YANE6,YANE5
	DB	WIND0,ANA01,WIND0
;=========================================
HOUSE2ST
	PUSH    BC
;
;(CGB)	CALL	SSUB
		CALL	SSUB_SP
;
	LD	BC,HOU2SAD
;
	LD	DE,HOU2SNO
;(CGB)	JP	UNSTSB
		JP	UNSTSB_SP
;=========================================
CASISAD
	DB      $00,$01,$02
	DB      $10,$11,$12
;	DB      $20,$21,$22
;	DB      $30,$31,$32
	DB	$0FF
CASISNO
	DB	CAIN0,CAIN1,CAIN2
	DB	CAIN3,ANA02,CAIN4
;	DB	TIL01,TIL00,TIL01
;	DB	TIL01,TIL01,TIL01
;=========================================
CASINSET
	PUSH    BC
;
;(CGB)	CALL	SSUB
		CALL	SSUB_SP
;
	LD	BC,CASISAD
;
	LD	DE,CASISNO
;(CGB)	JP	UNSTSB
		JP	UNSTSB_SP
;=========================================
;=========================================
;=========================================
BOMGSAD
	DB      $00,$01
	DB      $10,$11
	DB	$0FF
BOMGSNO
	DB	BOMG0,BOMG1
	DB	BOMG2,BOMG3
;
BOMG2NO
	DB	STON2,STON2
	DB	STON2,STON2
;=========================================
BOMGZSET
	PUSH    BC
;
;(CGB)	CALL	SSUB
		CALL	SSUB_SP
;
	LD	BC,BOMGSAD
;
	LD	DE,BOMGSNO
;
	LD	A,(DJSVBF)
	AND	%00000100
	JR	Z,BO2020
;
	LD	DE,BOMG2NO
BO2020
;(CGB)	JP	UNSTSB
		JP	UNSTSB_SP
;=========================================
;=========================================
;=========================================
;=========================================
;=========================================
;=========================================
UWOODAD
	DB      $00,$01
	DB      $10,$11
	DB	$0FF
UWOODNO
	DB	UWOD0,UWOD1
	DB	UWOD2,UWOD3
;=========================================
UWOODSET
	PUSH    BC
;
;(CGB)	CALL	SSUB
		CALL	SSUB_SP
;
	LD	BC,UWOODAD
;
	LD	DE,UWOODNO
;(CGB)	JP	UNSTSB
		JP	UNSTSB_SP
;=========================================
;=========================================
;=========================================
TOIREAD
	DB      	$00,$01,$02
	DB     	        $10,$11,$12
	DB          $1F,$20,$21,$22,$23
	DB              $30,$31,$32
	DB	        $0FF
TOIRENO
	DB	      GAK00,GAK01,GAK02
	DB	      GAK10,ANA03,GAK12
	DB	KUSA2,GAK08,GAK04,GAK09,KUSA2
	DB	      KUSA2,KUSA2,KUSA2
;=========================================
TOIRESET
	PUSH    BC
;
;(CGB)	CALL	SSUB
		CALL	SSUB_SP
;
	LD	BC,TOIREAD
;
	LD	DE,TOIRENO
;(CGB)	JP	UNSTSB
		JP	UNSTSB_SP
;=========================================
;=========================================
;=========================================
;=========================================
PREHBAD
	DB	$00,$01,$02
	DB	$10,$11,$12
	DB	$0FF
PREHBNO
	DB	YANEZ,YANEZ,YANEZ
	DB	WIND0,ANA01,WIND0
;=========================================
PREHBSET
	PUSH    BC
;
;(CGB)	CALL	SSUB
		CALL	SSUB_SP
;
	LD	BC,PREHBAD
;
	LD	DE,PREHBNO
;(CGB)	JP	UNSTSB
		JP	UNSTSB_SP



;┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
;┃	zend.s のプログラムをここに移動				       ┃
;┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	シーン７：雲明るくなる						x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
KUMO_BRIGHT_70
;;;;;;;		DW	$3ca4,$3129,$3129,$3def	; ( 0 )
		DW	$4107,$3129,$3129,$4231	; ( 4 )
		DW	$458b,$3129,$3129,$4673	; ( 0 )
		DW	$4a0f,$2d08,$2d08,$4ab5	; ( 4 )
		DW	$4e73,$2d08,$2d08,$4f18	; ( 0 )
		DW	$52f7,$2d08,$2d08,$535a	; ( 4 )
		DW	$577b,$28e7,$28e7,$579c	; ( 0 )
		DW	$5bff,$28e7,$28e7,$5bff	; ( 4 )

		DW	$5bff,$28e7,$28e7,$5bff	; ( 1 )
		DW	$5fbc,$2d08,$2d08,$5fff	; ( 5 )
		DW	$6359,$354a,$354a,$63ff	; ( 1 )
		DW	$66f6,$3d6b,$3d6b,$67ff	; ( 5 )
		DW	$6e92,$45ad,$45ad,$6fff	; ( 1 )
		DW	$722f,$4dce,$4dce,$73ff	; ( 5 )
		DW	$75cc,$5610,$5610,$77ff	; ( 1 )
		DW	$7d68,$5e52,$5e52,$7fff	; ( 5 )

KUMO_BRIGHT_77
;;;;;;;		DW	$3ca4,$0e39,$33ff,$77ff	; ( 2 )
		DW	$4107,$1679,$37ff,$73ff	; ( 6 )
		DW	$458b,$22ba,$3bff,$6fff	; ( 2 )
		DW	$4a0f,$2efb,$43ff,$6bff	; ( 6 )
		DW	$4e73,$373c,$47ff,$67ff	; ( 2 )
		DW	$52f7,$437d,$4fff,$63ff	; ( 6 )
		DW	$577b,$4fbe,$53ff,$5fff	; ( 2 )
		DW	$5bff,$5bff,$5bff,$5bff	; ( 6 )

		DW	$5bff,$5bff,$5bff,$5bff	; ( 3 )
		DW	$5fbc,$4fbe,$53ff,$5fff	; ( 7 )
		DW	$6359,$437d,$4fff,$63ff	; ( 3 )
		DW	$66f6,$373c,$47ff,$67ff	; ( 7 )
		DW	$6e92,$2efb,$43ff,$6bff	; ( 3 )
		DW	$722f,$22ba,$3bff,$6fff	; ( 7 )
		DW	$75cc,$1679,$37ff,$73ff	; ( 3 )
		DW	$7d68,$0e39,$33ff,$77ff	; ( 7 )
;========================================================================

KUMO_BRIGHT7_sub
		LD	A,(EDCNT2)
		CP	$22
		RET	NC

		SBC	A,4		; イニシャルは「４」の為
		LD	B,A
		AND	%00000001
		RET	NZ

		LD	A,B
		SLA	A
		SLA	A
		LD	C,A
		LD	B,$0

		PUSH	BC
		LD	HL,KUMO_BRIGHT_70
		ADD	HL,BC
		LD	BC,$0008	; ４パレット
		LD	DE,CGWORK	; ＢＧ ０－０から
		CALL	DATA_MOV	; データ転送
		POP	BC

		LD	HL,KUMO_BRIGHT_77
		ADD	HL,BC
		LD	BC,$0008	; ４パレット
		LD	DE,CGWORK+0038H	; ＢＧ ７－０から
		CALL	DATA_MOV	; データ転送

		XOR	A
		LD	(COLOFS),A	; 転送オフセット
		LD	A,4*8
		LD	(COLLNG),A	; 転送長さ
		LD	A,BGCOL_BITFG|$80
		LD	(CGDMAF),A	; 転送フラグ（部分転送）
		RET

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	シーン８：りんくフェード					x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;------------------------------------------------------------------------
;	蛍光燈パターン
;------------------------------------------------------------------------
;;;;;;;;LINK_FADE_80
;;;;;;;;		DW	$7eb3,$0000,$10c3,$190b	; ( 4 )
;;;;;;;;		DW	$7eb3,$0000,$08cb,$0867	; ( 5 )
;;;;;;;;		DW	$7eb3,$0000,$0867,$0424	; ( 6 )
;;;;;;;;		DW	$7eb3,$0000,$10c3,$1060	; ( 7 )
;;;;;;;;		DW	$7eb3,$0000,$0cab,$190b	; ( 4 )
;;;;;;;;		DW	$7eb3,$0000,$0867,$10c3	; ( 5 )
;;;;;;;;		DW	$7eb3,$0000,$1060,$190b	; ( 6 )
;;;;;;;;		DW	$7eb3,$0000,$1060,$0867	; ( 7 )
;;;;;;;;LINK_FADE_81
;;;;;;;;		DW	$7eb3,$0000,$2166,$31f4	; ( 4 )
;;;;;;;;		DW	$7eb3,$0000,$0d47,$10cd	; ( 5 )
;;;;;;;;		DW	$7eb3,$0000,$10cd,$0447	; ( 6 )
;;;;;;;;		DW	$7eb3,$0000,$2166,$20c0	; ( 7 )
;;;;;;;;		DW	$7eb3,$0000,$1934,$31f4	; ( 4 )
;;;;;;;;		DW	$7eb3,$0000,$10cd,$2166	; ( 5 )
;;;;;;;;		DW	$7eb3,$0000,$20c0,$31f4	; ( 6 )
;;;;;;;;		DW	$7eb3,$0000,$20c0,$10cd	; ( 7 )
;;;;;;;;LINK_FADE_82
;;;;;;;;		DW	$4cc5,$0000,$3228,$4b1f	; ( 0 )
;;;;;;;;		DW	$7eb3,$0000,$121f,$1915	; ( 1 )
;;;;;;;;		DW	$7eb3,$0000,$1915,$046b	; ( 2 )
;;;;;;;;		DW	$7eb3,$0000,$3228,$3100	; ( 3 )
;;;;;;;;		DW	$7eb3,$0000,$21bf,$4b1f	; ( 0 )
;;;;;;;;		DW	$7eb3,$0000,$1915,$3228	; ( 1 )
;;;;;;;;		DW	$7eb3,$0000,$3100,$4b1f	; ( 2 )
;;;;;;;;		DW	$7eb3,$0000,$3100,$1915	; ( 3 )
;;;;;;;;
;;;;;;;;LINK_FADE_TBL
;;;;;;;;		DW	LINK_FADE_80
;;;;;;;;		DW	LINK_FADE_80
;;;;;;;;		DW	LINK_FADE_81
;;;;;;;;		DW	LINK_FADE_81
;;;;;;;;		DW	LINK_FADE_82
;;;;;;;;		DW	LINK_FADE_82
;;;;;;;;		DW	LINK_FADE_82
;;;;;;;;		DW	LINK_FADE_82
;------------------------------------------------------------------------
;	スポットライトパターン
;------------------------------------------------------------------------
LINK_FADE8_DAT
; < 0 >
		DW	$7eb3,$0000,$10c3,$190b	; ( 4 )
		DW	$7eb3,$0000,$08cb,$0867	; ( 5 )
		DW	$7eb3,$0000,$0867,$0424	; ( 6 )
		DW	$7eb3,$0000,$10c3,$1060	; ( 7 )
		DW	$7eb3,$0000,$0cab,$190b	; ( 4 )
		DW	$7eb3,$0000,$0867,$10c3	; ( 5 )
		DW	$7eb3,$0000,$1060,$190b	; ( 6 )
		DW	$7eb3,$0000,$1060,$0867	; ( 7 )
; < 1 >
		DW	$7eb3,$0000,$1904,$216e	; ( 0 )
		DW	$7eb3,$0000,$0d0e,$0c89	; ( 1 )
		DW	$7eb3,$0000,$0c89,$0445	; ( 2 )
		DW	$7eb3,$0000,$1904,$1880	; ( 3 )
		DW	$7eb3,$0000,$10ee,$216e	; ( 0 )
		DW	$7eb3,$0000,$0c89,$1904	; ( 1 )
		DW	$7eb3,$0000,$1880,$216e	; ( 2 )
		DW	$7eb3,$0000,$1880,$0c89	; ( 3 )
; < 2 >
		DW	$7eb3,$0000,$1d45,$29b1	; ( 4 )
		DW	$7eb3,$0000,$0d31,$10ab	; ( 5 )
		DW	$7eb3,$0000,$10ab,$0446	; ( 6 )
		DW	$7eb3,$0000,$1d45,$1ca0	; ( 7 )
		DW	$7eb3,$0000,$1511,$29b1	; ( 4 )
		DW	$7eb3,$0000,$10ab,$1d45	; ( 5 )
		DW	$7eb3,$0000,$1ca0,$29b1	; ( 6 )
		DW	$7eb3,$0000,$1ca0,$10ab	; ( 7 )
; < 3 >
		DW	$7eb3,$0000,$2166,$31f4	; ( 0 )
		DW	$7eb3,$0000,$0d74,$10cd	; ( 1 )
		DW	$7eb3,$0000,$10cd,$0447	; ( 2 )
		DW	$7eb3,$0000,$2166,$20c0	; ( 3 )
		DW	$7eb3,$0000,$1934,$31f4	; ( 0 )
		DW	$7eb3,$0000,$10cd,$2166	; ( 1 )
		DW	$7eb3,$0000,$20c0,$31f4	; ( 2 )
		DW	$7eb3,$0000,$20c0,$10cd	; ( 3 )
; < 4 >
		DW	$7eb3,$0000,$25a6,$3657	; ( 4 )
		DW	$7eb3,$0000,$1197,$14cf	; ( 5 )
		DW	$7eb3,$0000,$14cf,$0468	; ( 6 )
		DW	$7eb3,$0000,$25a6,$24c0	; ( 7 )
		DW	$7eb3,$0000,$1957,$3657	; ( 4 )
		DW	$7eb3,$0000,$14cf,$25a6	; ( 5 )
		DW	$7eb3,$0000,$24c0,$3657	; ( 6 )
		DW	$7eb3,$0000,$24c0,$14cf	; ( 7 )
; < 5 >
		DW	$7eb3,$0000,$29c7,$3e9a	; ( 0 )
		DW	$7eb3,$0000,$11da,$14f1	; ( 1 )
		DW	$7eb3,$0000,$14f1,$0469	; ( 2 )
		DW	$7eb3,$0000,$29c7,$28e0	; ( 3 )
		DW	$7eb3,$0000,$1d7a,$3e9a	; ( 0 )
		DW	$7eb3,$0000,$14f1,$29c7	; ( 1 )
		DW	$7eb3,$0000,$28e0,$3e9a	; ( 2 )
		DW	$7eb3,$0000,$28e0,$14f1	; ( 3 )
; < 6 >
		DW	$7eb3,$0000,$2e08,$46dd	; ( 4 )
		DW	$7eb3,$0000,$11fd,$1913	; ( 5 )
		DW	$7eb3,$0000,$1913,$046a	; ( 6 )
		DW	$7eb3,$0000,$2e08,$2d00	; ( 7 )
		DW	$7eb3,$0000,$219d,$46dd	; ( 4 )
		DW	$7eb3,$0000,$1913,$2e08	; ( 5 )
		DW	$7eb3,$0000,$2d00,$46dd	; ( 6 )
		DW	$7eb3,$0000,$2d00,$1913	; ( 7 )
; < 7 >
		DW	$4cc5,$0000,$3228,$4b1f	; ( 0 )
		DW	$7eb3,$0000,$121f,$1915	; ( 1 )
		DW	$7eb3,$0000,$1915,$046b	; ( 2 )
		DW	$7eb3,$0000,$3228,$3100	; ( 3 )
		DW	$7eb3,$0000,$21bf,$4b1f	; ( 0 )
		DW	$7eb3,$0000,$1915,$3228	; ( 1 )
		DW	$7eb3,$0000,$3100,$4b1f	; ( 2 )
		DW	$7eb3,$0000,$3100,$1915	; ( 3 )
;========================================================================

LINK_FADE8_sub
;
;	蛍光燈パターン
;
;;;;;;;;		LD	A,(FRCNT)
;;;;;;;;		AND	$03
;;;;;;;;		LD	E,A
;;;;;;;;		LD	A,(EDCNT0)
;;;;;;;;		ADD	A,E
;;;;;;;;		SLA	A
;;;;;;;;		LD	E,A
;;;;;;;;		LD	D,$00
;;;;;;;;
;;;;;;;;		LD	HL,LINK_FADE_TBL
;;;;;;;;		ADD	HL,DE
;;;;;;;;		LD	A,(HLI)
;;;;;;;;		LD	B,A
;;;;;;;;		LD	H,(HL)
;;;;;;;;		LD	L,B

;
;	スポットライトパターン
;
		LD	A,(FRCNT)
		AND	$07
		RET	NZ
		LD	HL,LINKFADE
		LD	A,(HL)
		CP	7
		RET	Z

		INC	A
		LD	(HL),A

		SWAP	A
		LD	C,A
		LD	B,$0
		SLA	C
		RL	B
		SLA	C
		RL	B
		LD	HL,LINK_FADE8_DAT
		ADD	HL,BC
		LD	BC,$0040	; ３２パレット
		LD	DE,CGWORK+0040H	; ＯＢＪ ０－０から
		CALL	DATA_MOV	; データ転送

		XOR	A
		LD	(COLOFS),A	; 転送オフセット
		LD	A,4*8
		LD	(COLLNG),A	; 転送長さ
		LD	A,OBJCOL_BITFG|$80
		LD	(CGDMAF),A	; 転送フラグ（部分転送）
		RET


;┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
;┃	ze6.s のプログラムをここに移動				       ┃
;┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	必殺！Ｎ山さん＆こあくまんビーム（ＢＧカラーチェンジ）		x
;x----------------------------------------------------------------------x
;x	    ＥＮＴＲＹ							x
;x		Ｄ         ： フラッシュタイマー（ ENTIM0 ）		x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;------------------------------------------------------------------------
;	フラッシュカラー（ ＳＨＯＰ Ｎ山 ）
;------------------------------------------------------------------------
NYAMA_FLASH
; ＜ ＢＧ： kousen_s.col BANK=0 ＞
		DW	$0000,$196b,$32b5,$47ff	; ( 0 )
		DW	$0000,$196b,$32b5,$47ff	; ( 1 )
		DW	$0000,$196b,$32b5,$47ff	; ( 2 )
		DW	$0000,$196b,$32b5,$47ff	; ( 3 )
		DW	$32b5,$0000,$32b5,$47ff	; ( 4 )
		DW	$7fff,$7fff,$7fff,$7fff	; ( 5 )
		DW	$32b5,$196b,$32b5,$47ff	; ( 6 )
		DW	$0000,$196b,$32b5,$47ff	; ( 7 )
;------------------------------------------------------------------------
;	フラッシュカラー（ こあくまん ）
;------------------------------------------------------------------------
AKUMA_FLASH
; ＜ ＢＧ： kousen_k.col BANK=0 ＞
		DW	$196b,$196b,$32b5,$0000	; ( 0 )
		DW	$0000,$196b,$32b5,$47ff	; ( 1 )
		DW	$0000,$196b,$32b5,$47ff	; ( 2 )
		DW	$0000,$196b,$32b5,$47ff	; ( 3 )
		DW	$0000,$196b,$32b5,$47ff	; ( 4 )
		DW	$196b,$32b5,$0000,$47ff	; ( 5 )
		DW	$0000,$196b,$32b5,$47ff	; ( 6 )
		DW	$196b,$196b,$32b5,$47ff	; ( 7 )
;------------------------------------------------------------------------
;	部屋カラー（ ＳＨＯＰ Ｎ山 ）
;------------------------------------------------------------------------
NYAMA_RESET
; ＜ ＢＧ： kousen_s.col BANK=2 ＞
		DW	$47ff,$2efd,$15b5,$0000	; ( 0 )
		DW	$47ff,$5231,$28c5,$0000	; ( 1 )
		DW	$47ff,$2c7f,$140e,$0000	; ( 2 )
		DW	$47ff,$11d9,$10ce,$0000	; ( 3 )
		DW	$09f4,$7fff,$09f4,$0000	; ( 4 )
		DW	$7fff,$7fff,$7fff,$7fff	; ( 5 )
		DW	$2efd,$7f36,$7d45,$0000	; ( 6 )
		DW	$63fe,$26c4,$1521,$0000	; ( 7 )
;------------------------------------------------------------------------
;	部屋カラー（ こあくまん ）
;------------------------------------------------------------------------
AKUMA_RESET
; ＜ ＢＧ： kousen_k.col BANK=2 ＞
		DW	$0e39,$51f3,$2867,$0000	; ( 0 )
		DW	$47ff,$51f3,$2867,$0000	; ( 1 )
		DW	$47ff,$1417,$1008,$0000	; ( 2 )
		DW	$47ff,$11d9,$10ce,$0000	; ( 3 )
		DW	$3b7f,$7cff,$2810,$0000	; ( 4 )
		DW	$0e39,$1911,$63fe,$0000	; ( 5 )
		DW	$760d,$7d45,$3ca4,$0000	; ( 6 )
		DW	$0e39,$26c4,$1521,$0000	; ( 7 )
;========================================================================

NYAMA_BEAM_sub
		PUSH	BC

		LD	HL,NYAMA_FLASH
		LD	B,$0
		LD	C,$80
		LD	A,D		; (A) POP
		BIT	1,A		; フラッシュ？
		JR	NZ,NYAMABM_100	; ＹＥＳ

		ADD	HL,BC
NYAMABM_100
		LD	A,(GRNDPT)
		CP	$A1		; ＳＨＯＰ Ｎ山？
		JR	Z,NYAMABM_200	; ＹＥＳ

		LD	C,$40
		ADD	HL,BC
NYAMABM_200
		LD	BC,$0040	; ７パレット
		LD	DE,CGWORK
		CALL	DATA_MOV	; データ転送

		XOR	A
		LD	(COLOFS),A	; 転送オフセット
		LD	A,4*8
		LD	(COLLNG),A	; 転送長さ
		LD	A,BGCOL_BITFG|$80
		LD	(CGDMAF),A	; 転送フラグ（部分転送）

		POP	BC
		RET


;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
;	バンク２４ ここまで
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━





;□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□
;□	バンク２３						       □
;□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□
BANK23		GROUP	$23
		ORG	$7610

;┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
;┃	zend.s のプログラムをここに移動				       ┃
;┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	エンディング 雲スクロール					x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
ED8DATA
	DB	$9B,$E0,$13
;0    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC

 DB  00;Dammy
	DB	$9B,$C0,$13
;1    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$A0,$13
;2    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$80,$13
;3    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $60,$61,$62,$63,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$60,$13
;4    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $50,$51,$52,$53,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$40,$13
;5    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$20,$13
;6    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$00,$13
;7    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9A,$E0,$13
;8    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$60,$61,$62,$63,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9A,$C0,$13
;9    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$50,$51,$52,$53,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9A,$A0,$13
;A    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9A,$80,$13
;B    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9A,$60,$13
;C    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$60,$61
 DB  00;Dammy
	DB	$9A,$40,$13
;D    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$50,$51
 DB  00;Dammy
	DB	$9A,$20,$13
;E    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9A,$00,$13
;F    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $6B,$6C,$6D,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$99,$E0,$13
;10   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $5B,$5C,$5D,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$68,$69,$6A,$6B,$6C,$6D,$AC,$AC
 DB  00;Dammy
	DB	$99,$C0,$13
;11   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$58,$59,$5A,$5B,$5C,$5D,$AC,$AC
 DB  00;Dammy
	DB	$99,$A0,$13
;12   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$99,$80,$13
;13   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$99,$60,$13
;14   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$68,$69
 DB  00;Dammy
	DB	$99,$40,$13
;15   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$68,$69,$6A,$6B,$6C,$6D,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$58,$59
 DB  00;Dammy
	DB	$99,$20,$13
;16   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$58,$59,$5A,$5B,$5C,$5D,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$99,$00,$13
;17   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$98,$E0,$13
;18   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$98,$C0,$13
;19   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$98,$A0,$13
;1A   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$98,$80,$13
;1B   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$98,$60,$13
;1C   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$98,$40,$13
;1D   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$98,$20,$13
;1E   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$40,$41,$42,$43
 DB  00;Dammy
	DB	$98,$00,$13
;1F   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$1B,$2E,$2E,$2E
 DB  00;Dammy
	DB	$9B,$E0,$13
;20   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $41,$42,$43,$54,$55,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$9C,$9E,$BE,$E9
 DB  00;Dammy
	DB	$9B,$C0,$13
;21   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $2E,$2E,$2E,$2E,$2F,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$A0,$13
;22   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $9E,$BE,$E9,$F9,$FB,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$80,$13
;23   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
;#############################################################
	DB	$9B,$60,$13
;24   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$40,$13
;25   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $43,$54,$55,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$20,$13
;26   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $2E,$2E,$2F,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$00,$13
;27   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $E9,$F9,$FB,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9A,$E0,$13
;28   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9A,$C0,$13
;29   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9A,$A0,$13
;2A   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9A,$80,$13
;2B   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$40,$41,$42,$43,$54,$55,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9A,$60,$13
;2C   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$1B,$2E,$2E,$2E,$2E,$2F,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9A,$40,$13
;2D   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$9C,$9E,$BE,$E9,$F9,$FB,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9A,$20,$13
;2E   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9A,$00,$13
;2F   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$99,$E0,$13
;30   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$99,$C0,$13
;31   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$99,$A0,$13
;32   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$99,$80,$13
;33   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$40,$41,$42,$43
 DB  00;Dammy
	DB	$99,$60,$13
;34   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$1B,$2E,$2E,$2E
 DB  00;Dammy
	DB	$99,$40,$13
;35   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $40,$41,$42,$43,$54,$55,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$9C,$9E,$BE,$E9
 DB  00;Dammy
	DB	$99,$20,$13
;36   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $1B,$2E,$2E,$2E,$2E,$2F,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$99,$00,$13
;37   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $9C,$9E,$BE,$E9,$F9,$FB,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$98,$E0,$13
;38   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$98,$C0,$13
;39   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
;#########################################################
	DB	$98,$A0,$13
;3A   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$98,$80,$13
;3B   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$98,$60,$13
;3C   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$98,$40,$13
;3D   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$98,$20,$13
;3E   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$98,$00,$13
;3F   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$E0,$13
;40   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$C0,$13
;41   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$A0,$13
;42   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$80,$13
;43   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$60,$13
;44   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $3C,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$40,$13
;45   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $2C,$2D,$AC,$AC,$AC,$AC,$AC,$AC,$78,$79,$3C,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$9B,$20,$13
;46   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AE,$AE,$3D,$3F,$AC,$AC,$AC,$AC,$45,$AE,$2C,$2D,$AC,$AC,$AC,$7B,$3D,$3F,$78,$79
 DB  00;Dammy
	DB	$9B,$00,$13
;47   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AE,$AE,$AE,$3E,$AC,$AC,$AC,$AC,$72,$AE,$AE,$75,$AC,$AC,$7A,$4B,$AE,$3E,$45,$AE
 DB  00;Dammy
	DB	$9A,$E0,$13
;48   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AE,$AE,$AE,$AE,$3D,$3F,$AC,$AC,$56,$73,$74,$67,$AC,$AC,$72,$AE,$AE,$AE,$AE,$AE
 DB  00;Dammy
	DB	$9A,$C0,$13
;49   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AE,$AE,$AE,$AE,$AE,$3E,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$56,$73,$AE,$AE,$AE,$AE
 DB  00;Dammy
	DB	$9A,$A0,$13
;4A   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AE,$AE,$AE,$AE,$AE,$75,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$70,$71,$AE,$AE
 DB  00;Dammy
	DB	$9A,$80,$13
;4B   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AE,$AE,$AE,$AE,$74,$67,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$57,$AE,$AE
 DB  00;Dammy
	DB	$9A,$60,$13
;4C   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $72,$AE,$76,$77,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$7B,$AE,$AE
 DB  00;Dammy
	DB	$9A,$40,$13
;4D   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $56,$73,$66,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$7A,$4B,$AE,$AE
 DB  00;Dammy
	DB	$9A,$20,$13
;4E   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$7B,$3D,$3F,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$72,$AE,$AE,$AE
 DB  00;Dammy
	DB	$9A,$00,$13
;4F   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$7A,$4B,$AE,$3E,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$56,$73,$AE,$AE
 DB  00;Dammy
	DB	$99,$E0,$13
;50   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$72,$AE,$AE,$75,$AC,$AC,$FE,$FF,$05,$0B,$AC,$AC,$AC,$AC,$AC,$AC,$70,$71
 DB  00;Dammy
	DB	$99,$C0,$13
;51   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$56,$73,$74,$67,$AC,$AC,$F8,$FA,$FC,$FD,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$57
 DB  00;Dammy
	DB	$99,$A0,$13
;52   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$A2,$A3,$BF,$F0,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$99,$80,$13
;53   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$84,$85,$9D,$9F,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$99,$60,$13
;54   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$99,$40,$13
;55   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC
 DB  00;Dammy
	DB	$99,$20,$13
;56   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $3C,$AC,$78,$79,$3C,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$7B,$3D,$3F,$AC,$AC
 DB  00;Dammy
	DB	$99,$00,$13
;57   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $2C,$2D,$45,$AE,$2C,$2D,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$AC,$7A,$4B,$AE,$3E,$AC,$AC
 DB  00;Dammy
	DB	$98,$E0,$13
;58   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AE,$AE,$AE,$AE,$AE,$75,$AC,$AC,$AC,$AC,$AC,$AC,$78,$79,$AE,$AE,$AE,$AE,$3C,$AC
 DB  00;Dammy
	DB	$98,$C0,$13
;59   0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $AE,$AE,$AE,$AE,$74,$67,$AC,$AC,$AC,$AC,$AC,$AC,$45,$AE,$AE,$AE,$AE,$AE,$2C,$2D
 DB  00;Dammy

;-----------------------------------------------------------
;	雲（太陽のところ）アトリビュートデータ
;-----------------------------------------------------------
ED8DATA_ATR
;;    0	  1   2	  3   4	  5   6	  7   8	  9   A	  B   C	  D   E	  F  10	 11  12	 13
 DB $00,$00,$00,$00,$00,$00,$00,$00,$07,$07,$07,$07,$00,$00,$00,$00,$00,$00,$00,$00
 DB 00 ;DAMMY
ED8DATA_END
ED8DATA_CNT	EQU	(ED8DATA_END-ED8DATA_ATR)
;--------------------------------------------------------------------
ED8000_sub
	LD	A,(EDCNT3)
	LD	E,A
	LD	D,$00
	SLA	E
	RL	D
	SLA	E
	RL	D
	SLA	E
	RL	D
	LD	A,E
	LD	L,D
;
	SLA	E
	RL	D
	ADD	A,E	; x $18
	LD	E,A
;
	LD	A,D
	ADC	A,$00
	ADD	A,L
	LD	D,A
;
	LD	HL,ED8DATA
	ADD	HL,DE

		PUSH	HL	; DE じゃないよ
;
	LD	DE,VRAMD+1
;
	LD	C,$18
ED8070
	LD	A,(HLI)
	LD	(DE),A
	INC	DE
;
	DEC	C
	JR	NZ,ED8070

;-----------------------------------------------------------
;	雲 アトリビュートセット
;-----------------------------------------------------------
		POP	HL

		LD	A,(CGBFLG)
		AND	A
		RET	Z

		LD	DE,VRAMD_AT+1

		LD	A,(EDCNT3)
		CP	$50		; 太陽セット？
		JR	Z,ED8080	;
		CP	$51		;
		JR	Z,ED8080	;
		CP	$52		;
		JR	Z,ED8080	;
		CP	$53		;
		JR	Z,ED8080	;

		LD	A,(HLI)
		LD	(DE),A
		INC	DE
		LD	A,(HLI)
		LD	(DE),A
		INC	DE
		LD	A,%01000000 | $14-1	; 横、共通、０ＥＨ
		LD	(DE),A
		INC	DE
 		XOR	A
		LD	(DE),A		; アトリビュート０
		INC	DE
		LD	(DE),A		; エンドコード

		RET

;-----------------------------------------------------------
;	太陽のところ アトリビュートセット
;-----------------------------------------------------------
ED8080
		LD	A,(HLI)
		LD	(DE),A
		INC	DE
		LD	A,(HLI)
		LD	(DE),A
		INC	DE
		LD	A,$14-1		; 横、１４Ｈ個
		LD	(DE),A
		INC	DE

		LD	HL,ED8DATA_ATR
		LD	C,ED8DATA_CNT
ED8081
		LD	A,(HLI)
		LD	(DE),A
		INC	DE
		DEC	C
		JR	NZ,ED8081
ED8090
	RET

;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
;	バンク２３ ここまで
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━



;------------------------------------------------------------------------
		END
;------------------------------------------------------------------------
