
		onbankgroup

;************************************************************************
;*									*
;*	タイトル    ：	ＣＧＢゼルダ					*
;*	ファイル名  ：	ZMAP.S						*
;*	処理内容    ：	ＣＧＢ専用 地上マップデータセット		*
;*	作成日付    ：  １９９８／０８／１９				*
;*									*
;************************************************************************
;
;==============	バンク０ ================================================
BANK0		GROUP	0
;-------------<	ZMA >----------------------------------------------------
		EXTERN	Map_data_set
;
;========================================================================
		PUBALL
		NLIST
		KANJI
		isdmg
;------------------------------------------------------------------------

		LIB	ZRAM		; RAM ＥＱＵＡＴＥ ファイル
		LIB	ZBN		; BG unit no file !

;------------------------------------------------------------------------

		LIST

;□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□
;□	バンク２０						       □
;□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□
BANK20		GROUP	$20

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	ＭＡＰデータセット						x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;-----<	ＭＡＰデータ バンクチェンジ ポインタ (GRNDPT) >------------------
MAP_BANK_CHG	EQU	$CC

;-----<	入れ替えＭＡＰ データアドレス >----------------------------------
MAP_006_ADRS	EQU	$5040	; たまご
MAP_00E_ADRS	EQU	$5090	; Ｌ７ 大鷲の塔
MAP_01B_ADRS	EQU	$50e0	; Ｌ４ 入り口の上
MAP_02B_ADRS	EQU	$5130	; Ｌ４ 入り口
MAP_079_ADRS	EQU	$5180	; 城門
MAP_08C_ADRS	EQU	$51d0	; Ｌ６ 神殿 入り口
;========================================================================

CGB_MAP_SET
		LD	A,(DJFLAG)
		AND	A		; ダンジョン？
		RET	NZ		; ＹＥＳ

;------------------------------------------------------------------------
;	マップ入れ替え コースチェック
;------------------------------------------------------------------------
MAPSET_000
		LD	A,(GRNDPT)
		CP	$0E
		JR	NZ,MAPSET_010	;城７のエリア？
;					;yes !
		LD	A,(GRRMSV+$0E)
		AND	%00010000
		JR	Z,MAPSET_090
;
		LD	HL,MAP_00E_ADRS
		JR	MAPSET_080
MAPSET_010
		CP	$8C
		JR	NZ,MAPSET_020	;城６のエリア（Ｌ６入口）？
;					;yes !
		LD	A,(GRRMSV+$8C)
		AND	%00010000
		JR	Z,MAPSET_090
;
		LD	HL,MAP_08C_ADRS
		JR	MAPSET_080
MAPSET_020
		CP	$79
		JR	NZ,MAPSET_030	;城門のエリア？
;					;yes !
		LD	A,(GRRMSV+$79)
		AND	%00010000
		JR	Z,MAPSET_090
;
		LD	HL,MAP_079_ADRS
		JR	MAPSET_080
MAPSET_030
		CP	$06
		JR	NZ,MAPSET_040	;たまごのエリア？
;					;yes !
		LD	A,(GRRMSV+$06)
		AND	%00010000
		JR	Z,MAPSET_090
;
		LD	HL,MAP_006_ADRS
		JR	MAPSET_080
MAPSET_040
		CP	$1B
		JR	NZ,MAPSET_050	;滝の鍵のエリアの上？
;					;yes !
		LD	A,(GRRMSV+$2B)
		AND	%00010000
		JR	Z,MAPSET_090
;
		LD	HL,MAP_01B_ADRS
		JR	MAPSET_080
MAPSET_050
		CP	$2B
		JR	NZ,MAPSET_090	;滝の鍵のエリア（Ｌ４入口）？
;					;yes !
		LD	A,(GRRMSV+$2B)
		AND	%00010000
		JR	Z,MAPSET_090
;
		LD	HL,MAP_02B_ADRS
MAPSET_080
		LD	A,$27		; データ２バンク
		LD	(WORK0),A
		JR	MAPSET_200

;------------------------------------------------------------------------
;	イニシャル データアドレスセット
;------------------------------------------------------------------------
MAPSET_090
		LD	A,$26		; データ１バンク
		LD	(WORK0),A

		LD	A,(GRNDPT)
		CP	MAP_BANK_CHG	; バンクチェンジ？
		JR	C,MAPSET_100	; ＮＯ

		LD	HL,WORK0
		INC	(HL)
		SUB	MAP_BANK_CHG
MAPSET_100
		LD	HL,$4000	; ベースデータアドレス
		LD	B,A		; カウンタ
		AND	B
MAPSET_110
		JR	Z,MAPSET_200

		LD	A,L
		ADD	A,$50		; １ＭＡＰデータサイズ
		LD	L,A
		LD	A,H
		ADC	A,$0
		LD	H,A

		DEC	B
		JR	MAPSET_110

;------------------------------------------------------------------------
;	データセット
;------------------------------------------------------------------------
MAPSET_200
		LD	DE,BGUNDT+$11	; ユニットバッファアドレス
MAPSET_210
		LD	BC,$000A	; 転送個数

		PUSH	DE
		CALL	Map_data_set	; ＭＡＰデータセット
		POP	DE

;;;;;		LD	A,L		; データアドレス計算
;;;;;		ADD	A,$0A
;;;;;		LD	L,A
;;;;;		LD	A,H
;;;;;		ADC	A,$0
;;;;;		LD	H,A

		LD	A,E		; データセットＲＡＭアドレス計算
		ADD	A,$10
		LD	E,A
		CP	$91		; セット終了？
		JR	NZ,MAPSET_210	; ＮＯ
;------------------------------------------------------------------------
		RET

;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	ユニットバッファ バンク２書き換え ユニットチェック		x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
Unit_check
		PUSH	HL

		LD	C,(HL)
		LD	B,UNIT_CHK_CNT	; カウンタ
		LD	HL,UNIT_CHK_DATA
Unit_check_100
		LD	A,(HLI)
		CP	C
		JR	NZ,Unit_check_200

		SCF
		CCF			; キャリーＯＦＦ
		JR	Unit_check_900
Unit_check_200
		DEC	B
		JR	NZ,Unit_check_100

		SCF			; キャリーＯＮ
;------------------------------------------------------------------------
Unit_check_900
		POP	HL
		RET

;------------------------------------------------------------------------
;	ユニットチェックデータ
;------------------------------------------------------------------------
UNIT_CHK_DATA
		DB	NUKI0	; (03) 砂地ベタ
		DB	KUSA0	; (04) 草 地面
		DB	STON2	; (09) 石 地面
;;;;;		DB	MIZU0	; (0E) 深い水
		DB	KAZA1	; (5E) 風見鶏（下）
		DB	KAZA0	; (91) 風見鶏（上）
		DB	DTOP0	; (A1) 開いた宝箱
;;;;;		DB	UWOD0	; (B6) 海辺専用やしの木(オバケの木も共用)
;;;;;		DB	UWOD1	; (B7)         ”
;;;;;		DB	UWOD2	; (CD)         ”
;;;;;		DB	UWOD3	; (CE)         ”
		DB	MEGG9	; (AA) たまご（下真ん中：開く前）
;;;;;		DB	MEGGB	; (C1) たまご（上真ん中：入り口）
		DB	OHAKA	; (C4) 墓
		DB	SINDO	; (C6) 階段入り口
;;;;;		DB	MEGGC	; (CB) たまご（下真ん中：入り口）
		DB	HTANA	; (CC) 掘った穴
		DB	SARUH	; (DB) 猿橋
		DB	ANA00	; (E1) 洞窟等の穴(常駐)
		DB	ANA02	; (E3) Ｌ１ 入り口
		DB	ANA03	; (E8) 落とし穴
;;;;;;		DB	TAKI0	; (E9) 滝
UNIT_CHK_END

UNIT_CHK_CNT	EQU	(UNIT_CHK_END-UNIT_CHK_DATA)



;┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
;┃	zbd.s のデータをここに移動					 ┃
;┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
;%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
;%	Ground BG Unit Hit data			       %
;%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
;=============================================
GBBKDT	;　ＢＧ　ｂａｎｋ　Ｎｏ．
XXX 	EQU	$0F
CCC 	EQU	$1A		; カメラ屋転送

;(CGB);- - Ground --  0,1*2,3*4,5*6,7*8,9*A,B*C,D*E,F
;(CGB)	DB	$1C,$1C,$3E,$3C,$3E,$3E,$3E,$30  ;$00,$10
;(CGB)	DB	XXX,$36,$36,XXX,XXX,$34,XXX,$3E  ;$20,$30
;(CGB)	DB	$20,$20,XXX,$38,$28,$28,$32,$32  ;$40,$50
;(CGB)	DB	$20,$20,$38,$38,$28,$28,$32,$32  ;$60,$70
;(CGB)	DB	XXX,$26,XXX,$24,XXX,$1E,$2A,XXX  ;$80,$90
;(CGB)	DB	$26,$26,$2E,$2E,XXX,$2A,$2A,$2A  ;$A0,$B0
;(CGB)	DB	XXX,$24,$2E,$2E,$3A,XXX,$26,$2C  ;$C0,$D0
;(CGB)	DB	$22,$22,$22,XXX,$3A,$3A,XXX,$2C  ;$E0,$F0
;- - Ground --  0,1*2,3*4,5*6,7*8,9*A,B*C,D*E,F
	DB	$1C,$1C,$3E,$3C,$3E,$3E,$3E,$30  ;$00,$10
	DB	XXX,$36,$36,CCC,XXX,$34,XXX,$3E  ;$20,$30 カメラ屋
	DB	$20,$20,XXX,$38,$28,$28,$32,$32  ;$40,$50
	DB	$20,$20,$38,$38,$28,$28,$32,$32  ;$60,$70
	DB	XXX,$26,XXX,$24,XXX,$1E,$2A,XXX  ;$80,$90
	DB	$26,$26,$2E,$2E,XXX,$2A,$2A,$2A  ;$A0,$B0
	DB	XXX,$24,$2E,$2E,$3A,XXX,$26,$2C  ;$C0,$D0
	DB	$22,$22,$22,XXX,$3A,$3A,XXX,$2C  ;$E0,$F0
;- - Danjyon --
DBBKDT
;0	EQU	$50　ボス扉　　，　　　　　，階段Ｕ　 　，ラセンＤ
;1	EQU	$51　ダンジョン入口　　　　　　　　　 　，
;2	EQU	$52　回転扉　　，　　　　　，　　　　 　，鍵岩
;3	EQU	$53　ラセンＵ　，兵隊壁　　，兵隊穴　 　，ラセンＤ
;4	EQU	$54　民家入口　，窓　　　　，値札　　 　，レジ
;5	EQU	$55　洞窟入口　，掘った穴　，階段Ｕ　 　，剣ちらし
;6	EQU	$56　ボス扉　　，壁穴Ｕ　　，壁穴Ｄ　　 ，鍵岩
;7	EQU	$57　ラセンＵ　，フックショット木橋　 　，鍵岩
;8	EQU	$58　民家入口　，机（大）　，ベット　 　，机（小）
;9	EQU	$59　体当たり岩，　　　　　，光る床　 　，鍵岩
;A	EQU	$5A　ボス扉　　，体岩３　　，階段Ｕ　 　，
;B	EQU	$5B　回転扉　　，　　　　　，階段Ｕ　 　，ラセンＤ
;C	EQU	$5C　洞窟入口　，掘った穴  ，階段Ｕ 　  ，体当たり岩２
;D	EQU	$5D　        　，フックショット木橋　 　，体当たり岩２
;E	EQU	$5E　ボス扉　　，　　　　　，	　　  　，ラセンＵ２
;F	EQU	$5F　小悪魔用バンク(＋上階段)
;17	EQU	$67  回転扉　　，	　 ，階段Ｕ     , ラセンＵ２
;18	EQU	$68  マム－部屋用スポット  ，階段Ｕ     ,
;1A	EQU	$6A  ボス用ＢＧ
;その他 	     　　　　　，水晶岩　　　　　　　　 ，ベルトコンベア
;
;
;FF	EQU	$F	;転送ナシ！
;
;;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;Lv.1
 DB $FF,$00,$00,$00,$FF,$01,$00,$05,$00,$09,$00,$00,$05,$05,$05,$FF ;0
 DB $00,$00,$FF,$FF,$02,$01,$01,$01,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF ;1
;Lv.2
 DB $FF,$FF,$FF,$FF,$FF,$00,$FF,$00,$FF,$00,$FF,$FF,$02,$00,$FF,$0E ;2
 DB $FF,$FF,$FF,$FF,$FF,$FF,$01,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF ;3
;Lv.3
;;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
 DB $02,$02,$FF,$02,$02,$09,$09,$FF,$02,$02,$09,$02,$09,$09,$09,$09 ;4
 DB $09,$FF,$01,$01,$05,$00,$00,$00,$00,$0A,$0A,$0A,$0A,$00,$00,$00 ;5
;Lv.4
 DB $09,$00,$00,$09,$09,$00,$00,$09,$09,$09,$09,$00,$00,$FF,$02,$FF ;6
 DB $09,$00,$00,$FF,$00,$00,$00,$FF,$FF,$00,$01,$05,$00,$00,$00,$00 ;7
;Lv.5
;;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
 DB $FF,$05,$FF,$FF,$FF,$06,$07,$07,$07,$FF,$FF,$06,$06,$FF,$FF,$FF ;8
 DB $09,$FF,$FF,$FF,$07,$FF,$FF,$07,$FF,$07,$05,$FF,$FF,$05,$05,$05 ;9
 DB $FF,$01,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$19,$FF,$FF,$FF ;A
;Lv.6
;;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
 DB $03,$0E,$03,$0E,$FF,$0E,$0E,$0E,$0E,$0E,$0E,$FF,$0E,$0E,$FF,$0E ;B
 DB $0E,$0E,$0E,$09,$00,$0E,$09,$FF,$FF,$0E,$09,$00,$0E,$FF,$02,$0E ;C
 DB $0E,$0E,$02,$FF,$01,$01,$01,$09,$00,$00,$00,$00,$00,$00,$00,$00 ;D
;洞窟用部屋
 DB $0F,$0F,$0F,$08,$00,$0C,$0C,$03,$0C,$0C,$0C,$00,$00,$00,$0C,$00 ;E
 DB $03,$03,$00,$19,$00,$08,$0C,$03,$0C,$0C,$08,$19,$0C,$05,$0C,$00 ;F
;;- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
;Lv.7
;;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
 DB $00,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$FF,$01,$FF ;0
 DB $03,$03,$03,$FF,$03,$03,$FF,$0B,$FF,$03,$FF,$FF,$FF,$07,$07,$FF ;1
 DB $FF,$06,$FF,$FF,$00,$FF,$FF,$FF,$FF,$0E,$0E,$FF,$FF,$0E,$0E,$00 ;2
;
;Lv.8
;;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
 DB $FF,$00,$FF,$FF,$FF,$FF,$FF,$00,$FF,$17,$17,$17,$FF,$03,$FF,$FF ;3
 DB $FF,$FF,$0A,$0A,$0A,$FF,$FF,$FF,$0A,$0A,$FF,$0B,$FF,$0D,$FF,$FF ;4
 DB $0A,$0A,$FF,$00,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$09,$01,$00,$00 ;5
 DB $FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$01 ;6
;
 DB $0C,$FF,$FF,$FF,$1A,$FF,$FF,$FF,$FF,$FF,$0C,$0C,$0C,$0C,$0C,$01 ;7
;@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
;;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
 DB $0C,$0C,$0C,$0C,$0C,$0C,$0C,$0C,$0C,$0C,$0C,$0C,$05,$05,$05,$01 ;8
 DB $05,$05,$05,$05,$05,$05,$05,$05,$05,$04,$05,$04,$04,$04,$00,$08 ;9
 DB $04,$04,$08,$08,$00,$08,$08,$08,$08,$08,$08,$05,$05,$08,$0C,$0C ;A
;(CGB) DB $08,$04,$05,$0C,$04,$00,$05,$05,$0C,$0C,$0C,$0C,$0C,$05,$0C,$0C ;B
 DB $08,$04,$05,$0C,$04,$08,$05,$05,$0C,$0C,$0C,$0C,$0C,$05,$0C,$0C ;B 1B5はカメラ屋さん
 DB $0C,$0C,$03,$03,$00,$03,$FF,$08,$00,$0C,$0C,$04,$04,$0C,$0C,$0C ;C
 DB $0C,$0C,$FF,$01,$00,$01,$01,$08,$00,$08,$08,$08,$08,$08,$0C,$0C ;D
 DB $FF,$08,$08,$04,$0C,$0C,$0C,$0C,$00,$08,$0C,$0C,$0C,$0C,$0C,$0C ;E
 DB $0C,$0C,$0C,$0C,$0C,$00,$0C,$0C,$00,$0C,$0C,$18,$05,$00,$08,$00 ;F
;- - New Danjyon --
DBBKDT2
;;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;Lv.1
 DB $00,$00,$0B,$0B,$00,$00,$0B,$0B,$0B,$0B,$0B,$0B,$0B,$0B,$0B,$0E ;0
 DB $0B,$0B,$0B,$18,$0B,$0B,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF ;1
;
;- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
;- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
;- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
;;		0 1 2 3 4 5 6 7 8 9 A B C D E F
;- - Enemy character bank - - -
GREBDT
;     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
 DB $65,$66,$67,$68,$69,$6D,$45,$46,$46,$00,$4E,$4E,$4E,$4E,$44,$50 ;0
 DB $20,$74,$6B,$6C,$6D,$6D,$37,$37,$4F,$1C,$4F,$4E,$4E,$4E,$50,$4E ;1
 DB $02,$7D,$00,$0E,$48,$47,$37,$06,$06,$00,$51,$50,$50,$62,$62,$62 ;2
 DB $02,$7D,$00,$0E,$48,$47,$37,$06,$06,$00,$51,$51,$00,$62,$62,$62 ;3
 DB $00,$41,$7E,$7E,$7A,$06,$28,$28,$11,$11,$64,$63,$2D,$2D,$2D,$2D ;4
 DB $01,$2E,$74,$7F,$38,$28,$28,$29,$11,$11,$11,$64,$2D,$2D,$2D,$2D ;5
 DB $00,$00,$7E,$00,$00,$28,$29,$05,$58,$59,$5A,$00,$2D,$2D,$2D,$2D ;6
 DB $7E,$7E,$7E,$7E,$3A,$3A,$28,$29,$5B,$5C,$00,$12,$2D,$2D,$2D,$2D ;7
 DB $3D,$03,$0A,$0B,$39,$61,$18,$18,$4A,$2C,$72,$00,$2A,$6F,$2D,$2D ;8
 DB $00,$00,$43,$0A,$40,$3E,$00,$00,$75,$5F,$73,$70,$2A,$6F,$2D,$2D ;9
 DB $13,$0C,$0A,$00,$3B,$00,$3B,$3B,$5F,$54,$37,$71,$6E,$6E,$6E,$00 ;A
 DB $0F,$0C,$09,$09,$00,$3B,$3B,$3B,$77,$72,$70,$4B,$6E,$6E,$6E,$6E ;B
 DB $08,$08,$07,$07,$3C,$3C,$3C,$00,$78,$23,$26,$57,$34,$35,$1D,$7B ;C
 DB $07,$07,$07,$07,$3C,$3C,$3C,$7A,$79,$26,$1F,$53,$2F,$34,$00,$4D ;D
 DB $07,$07,$00,$42,$00,$90,$91,$26,$26,$25,$36,$33,$31,$30,$7C,$4D ;E
 DB $07,$07,$07,$00,$90,$90,$91,$00,$1F,$26,$1F,$00,$30,$21,$4C,$7C ;F
;     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;
DJEBDT
;     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;Lv.1
 DB $01,$03,$0E,$07,$07,$00,$05,$01,$00,$03,$1C,$05,$01,$01,$01,$00 ;0
 DB $00,$02,$00,$03,$03,$03,$03,$03,$33,$33,$33,$33,$00,$00,$63,$63 ;1
;Lv.2
 DB $14,$00,$14,$14,$00,$06,$13,$06,$13,$13,$0E,$08,$13,$08,$06,$07 ;2
 DB $06,$06,$00,$00,$1B,$1B,$06,$1B,$06,$00,$33,$33,$33,$33,$33,$33 ;3
;Lv.3
 DB $18,$18,$18,$18,$00,$15,$00,$00,$17,$00,$17,$17,$06,$17,$06,$00 ;4
 DB $18,$3C,$3C,$3C,$17,$17,$17,$17,$17,$0E,$16,$00,$17,$01,$33,$33 ;5
;Lv.4
 DB $00,$00,$0E,$31,$19,$30,$32,$32,$00,$00,$32,$32,$00,$32,$30,$30 ;6
 DB $00,$30,$32,$00,$30,$30,$00,$30,$30,$30,$30,$30,$33,$33,$00,$01 ;7
;Lv.5
;     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
 DB $1E,$1E,$0F,$1E,$1E,$1D,$00,$00,$24,$24,$24,$00,$24,$24,$24,$24 ;8
 DB $24,$00,$1E,$1F,$1F,$1E,$1E,$04,$04,$00,$00,$04,$04,$04,$04,$04 ;9
 DB $04,$04,$33,$33,$33,$33,$33,$33,$33,$33,$64,$64,$80,$00,$00,$00 ;A
;Lv.6
;     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
 DB $28,$28,$28,$28,$61,$0F,$61,$00,$00,$28,$28,$00,$25,$26,$61,$29 ;B
 DB $27,$00,$28,$61,$00,$26,$00,$29,$2A,$00,$00,$62,$00,$61,$00,$27 ;C
 DB $61,$61,$27,$27,$27,$27,$00,$61,$63,$63,$33,$33,$33,$33,$00,$00 ;D
;
 DB $44,$44,$44,$00,$4A,$67,$67,$00,$7F,$00,$00,$33,$33,$00,$6E,$1A ;E
 DB $67,$67,$00,$80,$4A,$7E,$67,$00,$7F,$7F,$3D,$80,$10,$00,$6E,$1A ;F
;Lv.7
;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
 DB $00,$00,$3F,$2C,$2C,$5E,$34,$39,$00,$5F,$60,$3E,$39,$2B,$2B,$00 ;0
 DB $39,$2D,$2D,$2D,$2D,$2D,$2D,$2E,$2D,$2D,$2D,$2E,$00,$2D,$2D,$00 ;1
;(CGB) DB $36,$00,$35,$0F,$37,$35,$35,$00,$37,$00,$38,$35,$0F,$35,$68,$01 ;2
 DB $36,$00,$35,$0F,$37,$35,$35,$00,$37,$00,$38,$35,$0F,$35,$38,$01 ;2
;				     これを直した（ボス手前）↑
;Lv.8
;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
 DB $0F,$5C,$56,$00,$50,$5C,$00,$51,$56,$58,$5B,$5B,$00,$54,$00,$51 ;3
 DB $5A,$00,$59,$59,$00,$57,$5A,$59,$59,$00,$5C,$5C,$52,$00,$55,$00 ;4
 DB $5C,$5C,$00,$53,$52,$52,$00,$5B,$00,$5C,$00,$53,$52,$5B,$5A,$53 ;5
 DB $33,$33,$33,$33,$33,$33,$33,$33,$33,$33,$33,$33,$01,$01,$01,$3D ;6
;
 DB $01,$01,$01,$01,$6F,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$3D ;7
 DB $66,$66,$66,$01,$01,$66,$66,$66,$65,$65,$65,$65,$66,$66,$65,$3D ;8
 DB $65,$65,$65,$65,$66,$66,$66,$0D,$0D,$09,$65,$09,$09,$09,$00,$49 ;9
;- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
 DB $10,$11,$20,$2F,$01,$0A,$0A,$0B,$0C,$09,$4B,$65,$65,$4C,$65,$65 ;A
 DB $10,$12,$0B,$65,$09,$01,$65,$65,$65,$65,$65,$65,$65,$65,$0D,$0D ;B
 DB $00,$00,$21,$21,$21,$21,$21,$22,$66,$65,$65,$09,$09,$66,$0D,$0D ;C
 DB $67,$67,$21,$21,$21,$21,$21,$40,$66,$41,$7D,$4D,$4D,$46,$66,$66 ;D
 DB $3A,$4E,$3A,$09,$66,$66,$65,$65,$3B,$47,$65,$65,$65,$65,$65,$65 ;E
 DB $3A,$67,$67,$67,$66,$7C,$65,$65,$3B,$67,$67,$43,$01,$45,$48,$00 ;F
;
;- - New Danjyon Enemy character bank --
DJEBDT2
;     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
 DB $04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04 ;0
 DB $04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04 ;1
;
GEBANKD
;- - 地上 - -
;
 DB $A4,$FF,$FF,$FF ;0
 DB $A4,$8E,$7C,$C8 ;1   常駐+タリン,茸+モリブリン  +狸
 DB $A4,$4A,$7C,$93 ;2   常駐+花(小)   +モリブリン  +ライクライク
 DB $A4,$E5,$FF,$4E ;3   常駐+鶏,狐,蝶 +未定２      +釣り屋
 DB $A4,$91,$83,$A2 ;4   常駐+スライム +豚ブリン    +梟(ﾌｸﾛｳ)
 DB $A4,$42,$8A,$FF ;5   常駐+鴉お化けS+お化け(大)  +
 DB $A4,$42,$83,$A2 ;6   常駐+鴉お化けS+モリブリン  +ﾌｸﾛｳ,ﾊﾟﾀｸﾘｰ
 DB $A4,$81,$E3,$A2 ;7   常駐+ﾃｸﾀｲﾄﾘｰﾊﾞ+オクタロック+梟(ﾌｸﾛｳ)
 DB $A4,$E5,$E3,$FF ;8   常駐+鶏,狐,蝶 +オクタロック+未定
 DB $A4,$E5,$43,$E7 ;9   常駐+鶏,狐,蝶 +     婆     +男の子
 DB $A4,$E5,$E6,$FF ;A   常駐+鶏,狐,蝶 +ヒロイン    +
 DB $A4,$E5,$E6,$E7 ;B   常駐+鶏,狐,蝶 +ヒロイン    +男の子
 DB $A4,$E5,$43,$A4 ;C   常駐+鶏,狐,蝶 +     婆     +ワンワン
 DB $A4,$8E,$83,$A4 ;D   常駐+タリン,茸+モリブリン  +ワンワン
 DB $A4,$4A,$83,$40 ;E   常駐+花(小)   +モリブリン  +お化け花
 DB $A4,$E5,$4C,$E7 ;F   常駐+鶏,狐,蝶 +鳩          +男の子
 DB $A4,$4D,$83,$FF ;10  常駐+妖精     +モリブリン  +未定
 DB $A4,$42,$92,$5A ;11  常駐+鴉(ｶﾗｽ)  +兵士        +モグラ
 DB $A4,$61,$92,$67 ;12  常駐+ゾーラ　 +兵士        +さる｡
 DB $A4,$E5,$FF,$FF ;13  常駐+鶏,狐,蝶 +            +
 DB $A4,$E3,$8B,$FF ;14  常駐+羽オクタ +穴長虫      +
 DB $A4,$E3,$83,$76 ;15  常駐+羽オクタ +モリブリン  +シゲミン,パタクリ
 DB $A4,$81,$79,$76 ;16  常駐+ﾃｸﾀｲﾄﾘｰﾊﾞ+ニョロニョロ+シゲミン,パタクリ
 DB $A4,$61,$8B,$FF ;17  常駐+ゾーラ   +穴長虫      +
 DB $A4,$6C,$8B,$6B ;18  常駐+タリン　 +穴長虫      +蜂の巣
 DB $A4,$FF,$8B,$FF ;19  常駐+	　     +穴長虫      +
 DB $A4,$E3,$8B,$A2 ;1A  常駐+羽オクタ +穴長虫      +フクロウ
 DB $A4,$E5,$FF,$FF ;1B  常駐+チョウ   +            +
 DB $A4,$4A,$8F,$6D ;1C  常駐+ピラニア +マリン      +パパール
 DB $A4,$81,$6E,$52 ;1D  常駐+リーバ   +トド        +ラネモーラ
 DB $A4,$4D,$43,$A2 ;1E  常駐+妖精     +ヤッホーな婆+フクロウ
 DB $A4,$61,$79,$76 ;1F  常駐+ゾーラ   +ニョロニョロ+シゲミン,パタクリ
 DB $A4,$C6,$7C,$41 ;20  常駐+カラス　 +モリブリン　+亀頭
 DB $A4,$C5,$6E,$6F ;21  常駐+         +トド
 DB $A4,$C5,$FF,$70 ;22  常駐+         +            +トド(イベント後)
 DB $A4,$61,$FF,$71 ;23  常駐+ゾーラ   +	    +人魚
 DB $A4,$61,$FF,$72 ;24  常駐+ゾーラ   +            +人魚(イベント後)
 DB $A4,$61,$79,$73 ;25  常駐+ゾーラ   +ニョロニョロ+人魚像
 DB $A4,$61,$79,$FF ;26  常駐+ゾーラ   +ニョロニョロ
 DB $A4,$E3,$79,$76 ;27  常駐+羽オクタ +ニョロニョロ+シゲミン,パタクリ
 DB $A4,$42,$82,$A2 ;28  常駐+鴉お化けS+墓,ゾンビ   +フクロウ
 DB $A4,$42,$FF,$82 ;29  常駐+鴉お化けS+	    +墓,ゾンビ(CGB)
 DB $A4,$61,$78,$A2 ;2A  常駐+ゾーラ   +アモス　　  +フクロウ
 DB $A4,$81,$8F,$E7 ;2B  常駐+うに蟹   +ヒロイン    +男の子
 DB $A4,$E3,$8B,$8C ;2C  常駐+羽オクタ +穴長虫      +沸き出し虫
 DB $A4,$87,$78,$A2 ;2D  常駐+ﾃｸﾀ,ｲｶﾀﾞ +アモス(小)  +フクロウ
 DB $A4,$6C,$7C,$C8 ;2E  常駐+タリン   +モリブリン  +狸
 DB $A4,$C4,$E6,$CF ;2F  常駐+兎,蝶    +歌うマリン２+南国鳥,プーさん
 DB $A4,$FF,$6E,$6F ;30  マリン＆トドつなぎ
 DB $A4,$FF,$E6,$CF ;31  マリン＆トドつなぎ２
 DB $A4,$FF,$83,$FF ;32  妖精＆タリンつなぎ
 DB $A4,$C4,$79,$76 ;33  常駐+兎,蝶    +にょろ	    +パタクリ
 DB $A4,$C4,$FF,$FF ;34  常駐+兎,蝶    +      　    +
 DB $A4,$C4,$43,$CF ;35  常駐+兎,蝶    +ばばあﾔｯﾎｰ　+南国鳥,プーさん
 DB $A4,$FF,$79,$FF ;36  常駐+         +にょろ　    +
 DB $A4,$FF,$FF,$A2 ;37  常駐+         +      　    +ふくろう
 DB $A4,$61,$79,$A2 ;38  常駐+ゾーラ   +ニョロニョロ+ふくろう
 DB $A4,$E5,$FF,$FF ;39  常駐+ニワトリ +	　  +
 DB $A4,$E5,$82,$A2 ;3A  常駐+ニワトリ +ゾンビー    +ふくろう
 DB $A4,$E3,$83,$A2 ;3B  常駐+羽オクタ +モリブリン  +ふくろう
 DB $A4,$91,$83,$76 ;3C  常駐+スライム +モリブリン  +シゲミン
 DB $A4,$FF,$7C,$A2 ;3D  常駐+         +モリブリン  +ふくろう      　    +
 DB $A4,$E3,$8B,$A2 ;3E  常駐+羽オクタ +穴長虫　    +ふくろう
 DB $A4,$E3,$FF,$76 ;3F  メーベの村(マリン)とその周辺の敵とのつなぎ１
 DB $A4,$FF,$E6,$A2 ;40  メーベの村(マリン)とその周辺の敵とのつなぎ２
 DB $A4,$FF,$7C,$A2 ;41  タヌキタリン(変身後)と地上スライムとのつなぎ
 DB $A4,$81,$E3,$D4 ;42  常駐+カニ　　 +オクタロック+バナナ
 DB $A4,$E5,$E6,$DC ;43  常駐+ニワトリ +歌うマリン  +必殺！回転風見鳥
 DB $A4,$87,$D6,$D7 ;44  　　テクタイト+塔回転用
 DB $A4,$50,$51,$A2 ;45      +楽器Ａ   +楽器Ｂ　    +フクロウ,パタクリ
 DB $A4,$6C,$8F,$A2 ;46      +タリン   +マリン　    +フクロウ,パタクリ
 DB $A4,$4A,$83,$A2 ;47      +花小ﾋﾟﾗﾆｱ+モリブリン  +フクロウ,パタクリ
 DB $A4,$4A,$83,$FF ;48      +花小ﾋﾟﾗﾆｱ+モリブリン  +
 DB $A4,$81,$8F,$76 ;49      +ﾘｰﾊﾞ,ｶﾆ  +マリン　    +フクロウ,パタクリ
 DB $A4,$E3,$8B,$FF ;4A      +羽オクタ +穴長虫
 DB $A4,$FF,$79,$FF ;4B      +         +ニョロニョロ
 DB $A4,$81,$6E,$FF ;4C      +リーバ　 +トド  　    +
 DB $A4,$81,$6E,$8C ;4D      +リーバ   +トド  　    +フクローサンボ
 DB $A4,$87,$8F,$76 ;4E      +ﾃｸﾀｲﾄ    +ﾏﾘﾝ   　    +ﾊﾟﾀｸﾘ,ｼｹﾞﾐﾝ
 DB $A4,$FF,$8F,$FF ;4F      +         +まりん  　　+
 DB $A4,$87,$FF,$FF ;50      +ﾃｸﾀｲﾄ    +      　    +
 DB $A4,$87,$83,$76 ;51      +ﾃｸﾀｲﾄ    +ブタブリン  +ﾊﾟﾀｸﾘ,ｼｹﾞﾐﾝ
 DB $A4,$87,$83,$98 ;52      +ﾃｸﾀｲﾄ    +ブタブリン  +速虫
 DB $A4,$FF,$79,$76 ;53      +         +ニョロニョロ+パタシゲミン
 DB $A4,$E3,$83,$A2 ;54      +羽オクタ +ﾌﾞﾀブリン   +パタフクロー
 DB $A4,$61,$79,$93 ;55      +ゾーラ   +ニョロニョロ+ライクライク
 DB $A4,$FF,$79,$93 ;56      +         +ニョロニョロ+ライクライク
 DB $A4,$C4,$79,$FF ;57      +蝶       +ニョロ　    +
 DB $A4,$FF,$92,$5A ;58      +         +兵士  　    +モグラ
 DB $A4,$61,$92,$8C ;59      +ゾーラ   +兵士  　    +湧き出し
 DB $A4,$42,$92,$FF ;5A      +カラス   +兵士  　    +
 DB $A4,$61,$FF,$FF ;5B      +ゾーラ   +      　    +
 DB $A4,$61,$FF,$8C ;5C      +ゾーラ   +      　    +湧き出し
 DB $A4,$FF,$83,$93 ;5D      +         +モリブリン２+ﾗｲｸﾗｲｸ
 DB $A4,$61,$8B,$FF ;5E      +ゾーラ   +穴長虫	    +
 DB $A4,$E3,$FF,$FF ;5F      +羽オクタ +      　    +
 DB $A4,$61,$FF,$67 ;60      +ゾーラ   +      　    +猿
 DB $A4,$FF,$FF,$A2 ;61      +         +      　    +ふくろう
 DB $A4,$87,$E3,$93 ;62      +ﾃｸﾀ,ｲｶﾀﾞ +オクタロック+ライクライク
 DB $A4,$87,$FF,$FF ;63      +テクタ   +      　    +
 DB $A4,$87,$92,$5A ;64      +テクタ   +兵士  　    +モグラ
 DB $A4,$C6,$9C,$98 ;65      +カラス   +ガイコツ兵  +速虫
 DB $A4,$C6,$9C,$FF ;66      +カラス   +ガイコツ兵  +
 DB $A4,$FF,$9C,$93 ;67      +         +ガイコツ兵  +ライクライク
 DB $A4,$81,$FF,$FF ;68      +リーバ　 +      　    +
 DB $A4,$FF,$9C,$98 ;69      +         +ガイコツ兵  +速虫
 DB $A4,$FF,$83,$FF ;6A      +         +モリブリン  +
 DB $A4,$81,$FF,$93 ;6B      +リーバ   +      　    +ライクライク
 DB $A4,$81,$9C,$93 ;6C      +リーバ 　+ガイコツ兵  +盾喰う虫も好々
 DB $A4,$44,$9C,$98 ;6D      +岩ごろ   +ガイコツ兵  +速虫
 DB $A4,$91,$78,$A2 ;6E      +スライム +あもす   　 +ふくろー＆ﾊﾟﾀｸﾘ
 DB $A4,$FF,$78,$A2 ;6F      +         +あもす 　　 +ふくろー＆ﾊﾟﾀｸﾘ
 DB $A4,$61,$FF,$A2 ;70      +ぞーら   +      　    +ふくろー＆ﾊﾟﾀｸﾘ
 DB $A4,$FF,$79,$A2 ;71      +	       +ニョロにょろ+ふくろー＆ﾊﾟﾀｸﾘ
 DB $A4,$61,$83,$FF ;72      +ゾーラ   +豚ブーブー　+
 DB $A4,$FF,$83,$A2 ;73      +         +ブタブリン　+ﾊﾟﾀｸﾘﾎﾞｰ&ﾌｸﾛｳ
 DB $A4,$FF,$7C,$FF ;74      +	       +モリブリン
 DB $A4,$E3,$8B,$A2 ;75      +羽根オクﾀ+穴	    +ﾊﾟﾀｸﾘﾎﾞｰ&ﾌｸﾛｳ
 DB $A4,$E3,$83,$FF ;76      +羽根オクﾀ+豚ブリン
 DB $A4,$FF,$83,$76 ;77      +         +ブタプリン  +パタクリ,シゲミン
 DB $A4,$61,$83,$FF ;78      +ゾーラ 　+豚ブリン
 DB $A4,$61,$FF,$76 ;79      +ゾーラ   +      　    +パタクリ,シゲミン
 DB $A4,$61,$FF,$A2 ;7A  常駐+ゾーラ   +	    +ふくろう
 DB $A4,$81,$6E,$FF ;7B  ラネモーラつなぎ
 DB $A4,$81,$FF,$8C ;7C      +リーバ   +      　    +サンボ＋梟
 DB $A4,$4A,$7C,$93 ;7D      +花小ﾋﾟﾗﾆｱ+モリブリン  +盾喰う虫も好々
 DB $A4,$91,$7C,$A2 ;7E      +スライム +モリﾌﾞﾘﾝ 　 +梟
 DB $A4,$4D,$7C,$FF ;7F      +妖精     +もりぶりん　+
 DB $A4,$FF,$FF,$FF ;80
 DB $A4,$FF,$FF,$FF ;81
 DB $A4,$FF,$FF,$FF ;82
 DB $A4,$FF,$FF,$FF ;83
 DB $A4,$FF,$FF,$FF ;84
 DB $A4,$FF,$FF,$FF ;85
 DB $A4,$FF,$FF,$FF ;86
 DB $A4,$FF,$FF,$FF ;87
 DB $A4,$FF,$FF,$FF ;88
 DB $A4,$FF,$FF,$FF ;89
 DB $A4,$FF,$FF,$FF ;8A
 DB $A4,$FF,$FF,$FF ;8B
 DB $A4,$FF,$FF,$FF ;8C
 DB $A4,$FF,$FF,$FF ;8D
 DB $A4,$FF,$FF,$FF ;8E
 DB $A4,$FF,$FF,$FF ;8F
 DB $A4,$81,$8F,$D4 ;90      +ﾘｰﾊﾞ,ｶﾆ  +マリン　    +椰子ザル
 DB $A4,$81,$79,$FF ;91  常駐+ﾘｰﾊﾞ,ｶﾆ  +ニョロニョロ
;
;- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
DEBANKD
;- - ダンジョン - -
 DB $FF,$FF,$FF,$FF ;0
 DB $90,$91,$92,$98 ;1  常駐(Ｄ用)+常駐２  +兵士      +速虫
 DB $90,$91,$AB,$FF ;2  常駐(Ｄ用)+常駐２  +兵士      +オバＱ
 DB $90,$91,$92,$93 ;3  常駐(Ｄ用)+常駐２  +兵士      +モトス
 DB $90,$91,$94,$9F ;4  常駐(Ｄ用)+常駐２  +兜 　     +兜(仮面)
 DB $90,$91,$B0,$B1 ;5  速虫(大)
 DB $90,$91,$9C,$93 ;6  常駐(Ｄ用)+常駐２  +ガイコツ兵+ポルスマミー
 DB $90,$91,$97,$9B ;7  常駐(Ｄ用)+常駐２  +テレサ    +猪野獅子
 DB $FF,$FF,$B6,$B7 ;8  壷大魔王
 DB $A4,$4C,$49,$46 ;9  常駐      +電話    +薬局 　　 +うるりら爺
 DB $A4,$FF,$45,$6D ;A  常駐      +        +サザエ　　+パパール
 DB $A4,$FF,$47,$48 ;B  常駐      +        +ワンワン女+お座敷ワンワン
 DB $A4,$FF,$4C,$4B ;C  常駐      +        +伝書鳩    +Ｄｒ．ライト
 DB $90,$91,$96,$FF ;D  常駐      +常駐２  +マネマネ  +
 DB $FF,$FF,$4F,$50 ;E            +        +ピカピカ  +楽器１
 DB $FF,$FF,$4F,$51 ;F            +        +ピカピカ  +楽器２
 DB $A4,$87,$84,$89 ;10 クレーンゲーム
 DB $A4,$FF,$88,$C7 ;11 常駐      +        +商人　　  +
 DB $A0,$A1,$84,$83 ;12 釣り堀
 DB $90,$91,$54,$A6 ;13 常駐(Ｄ用)+常駐２  +ひのっくす+Ｌｖ．３用引力君
 DB $90,$91,$97,$93 ;14 常駐(Ｄ用)+常駐２  +テレサ　　+モトス
 DB $90,$91,$AA,$FF ;15 常駐(Ｄ用)+常駐２  +未定      +ドドンゴ
 DB $90,$91,$B4,$B5 ;16 巨大スライム
 DB $90,$91,$9C,$9E ;17 常駐(Ｄ用)+常駐２  +ガイコツ兵+忍者鳥
 DB $90,$91,$9C,$9D ;18 常駐(Ｄ用)+常駐２  +ガイコツ兵+爆弾兵
 DB $68,$91,$56,$60 ;19 引っ張りＳ+常駐２  +水中ボス  +ｱﾒﾝﾎﾞ,ﾊﾞﾚﾘ-ﾅ
 DB $AC,$AD,$AE,$AF ;1A 巨大魚
 DB $90,$91,$58,$9B ;1B 常駐(Ｄ用)+常駐２  +ヘイホ－　+猪野獅子
 DB $90,$91,$A6,$59 ;1C 常駐(Ｄ用)+常駐２  +引っ張りＳ+トランプ
 DB $FF,$FF,$B8,$B9 ;1D 釣り長虫
 DB $90,$91,$62,$63 ;1E 常駐(Ｄ用)+常駐２  +骸骨大
 DB $90,$91,$A8,$9F ;1F 常駐(Ｄ用)+常駐２  +ゴーマ    +
 DB $A4,$DF,$A3,$FF ;20 常駐      +マウス  +粉ババア  +
 DB $90,$91,$92,$9A ;21 常駐(Ｄ用)+常駐２  +兵士      +鉄球兵
 DB $A4,$5B,$5C,$FF ;22 常駐      +ﾘﾁｬｰﾄﾞ  +かへる君  +
 DB $A6,$91,$97,$9B ;23 引力君    +常駐２  +テレサ    +猪野獅子
 DB $90,$91,$9C,$60 ;24 常駐(Ｄ用)+常駐２  +がいこつ兵+ｱﾒﾝﾎﾞ,ﾊﾞﾚﾘ-ﾅ
 DB $FF,$FF,$B2,$B3 ;25 顔ボス
 DB $A6,$91,$57,$FF ;26 顔長像    +常駐２  +Ｏちゃん  +
 DB $A6,$91,$95,$98 ;27 顔長像    +常駐２  +魔法使い  +速虫
 DB $A6,$91,$5E,$60 ;28 顔長像    +常駐２  +サイコロ  +ｱﾒﾝﾎﾞ,ﾊﾞﾚﾘ-ﾅ
 DB $A6,$91,$AA,$93 ;29 顔長像    +常駐２  +ドドンゴ  +ポルスマミー
 DB $A6,$91,$58,$99 ;2A 顔長像    +常駐２  +ヘイホ－　+回転砲台
 DB $90,$91,$95,$93 ;2B 常駐(Ｄ用)+トラップ+魔法使い  +ミイラ
 DB $5F,$91,$55,$99 ;2C ｸﾘﾎﾞｰ,ﾛｰﾌﾞ,ﾋﾟｰﾊｯﾄ  +トラップ  +ｶｰﾋﾞｰ     +回転砲台
 DB $66,$91,$5E,$59 ;2D 柱,鉄玉   +ﾊﾞﾌﾞﾙ,水晶         +サイコロ  +トランプ
 DB $66,$91,$54,$59 ;2E 柱,鉄玉   +ﾊﾞﾌﾞﾙ,水晶         +ヒノックス+トランプ
 DB $8D,$8E,$8F,$6A ;2F リンク寝る+タリン	      +マリン    +バナナ
 DB $68,$91,$9B,$60 ;30 ｸﾘﾎﾞｰ,ﾛｰﾌﾞ,ﾋﾟｰﾊｯﾄ  +常駐２    +猪野獅子  +ｱﾒﾝﾎﾞ,ﾊﾞﾚﾘ-ﾅ
 DB $68,$91,$94,$9F ;31 引っ張りＳ+常駐２  +兜        +兜(仮面)
 DB $68,$91,$9C,$60 ;32 引っ張りＳ+常駐２  +ガイコツ兵+ｱﾒﾝﾎﾞ,ﾊﾞﾚﾘ-ﾅ
 DB $5F,$65,$5D,$64 ;33 ｸﾘﾎﾞｰ,ﾛｰﾌﾞ,ﾋﾟｰﾊｯﾄ  +リフト    +ゲッソー  +パックン
 DB $FF,$91,$55,$FF ;34 	  +常駐２  +カービー  +
 DB $5F,$91,$95,$99 ;35 ｸﾘﾎﾞｰ,ﾛｰﾌﾞ,ﾋﾟｰﾊｯﾄ  +常駐２    +魔法使い  +回転砲台
 DB $5F,$91,$5E,$99 ;36 ｸﾘﾎﾞｰ,ﾛｰﾌﾞ,ﾋﾟｰﾊｯﾄ  +常駐２    +サイコロ  +回転砲台
 DB $5F,$91,$A9,$FF ;37 ｸﾘﾎﾞｰ,ﾛｰﾌﾞ,ﾋﾟｰﾊｯﾄ  +常駐２    +中ボス
 DB $5F,$91,$94,$9F ;38 ｸﾘﾎﾞｰ,ﾛｰﾌﾞ,ﾋﾟｰﾊｯﾄ  +常駐２    +兜        +兜(仮面)
 DB $90,$91,$55,$93 ;39 常駐(Ｄ用)+常駐２  +カービー  +ライクライク
 DB $A4,$FF,$7C,$FF ;3A ワンワン  +        +モリブリン+
 DB $BC,$BD,$BE,$BF ;3B 鳥ボス１  +   ２   +    ３    +    ４
 DB $A6,$91,$9C,$9D ;3C 反発(引力)+スライム+骸骨剣兵士+ボム兵
 DB $FF,$D5,$78,$53 ;3D           +石板    +アモス    +アモス(大)
 DB $90,$91,$FF,$FF ;3E 常駐(Ｄ用)+スライム+          +
 DB $5F,$91,$55,$98 ;3F ピーハット+スライム+カービー  +早虫
 DB $A4,$FF,$FF,$69 ;40 常駐      +        +          +熊
 DB $A4,$FF,$4C,$74 ;41 常駐      +        +ハト      +ヤギ,ハイビスカス
 DB $A0,$A1,$75,$4E ;42 魚達      +ルアー竿+釣親父下着+釣り屋
 DB $A4,$7D,$7E,$7F ;43 常駐      +合唱団  +マムー
 DB $A4,$FF,$FF,$C7 ;44 常駐      +        +      　  +小悪魔
 DB $C0,$C1,$C2,$C3 ;45 マンボでウッ！
 DB $A4,$CC,$CD,$CE ;46 常駐      +わに絵かき     　  +
 DB $A4,$C9,$CA,$CB ;47 常駐      +剣２もらう部屋
 DB $A4,$D1,$D2,$6A ;48 常駐	  +バナナワニ
 DB $DD,$E5,$D3,$DD ;49 常駐      +ニワトリ+ルイージ  +スーパーニワトリ
 DB $DD,$FF,$DE,$FF ;4A スーパーニワトリ+ニワトリ+とりがら
 DB $A4,$8D,$FF,$FF ;4B 常駐 	  +リンク寝る
 DB $FF,$DF,$49,$FF ;4C 仮Ａ(ﾄﾚｰｼｰ&ﾏｳｽ)
 DB $FF,$C4,$FF,$FF ;4D 仮Ｂ(ｳｻｷﾞ)
 DB $A4,$80,$7C,$A5 ;4E 常駐      +M BOSS1 + M BURIN  +M BOSS1
 DB $FF,$FF,$FF,$FF ;4F           +        +      　  +
;
 DB $FF,$FF,$BA,$BB ;50           +        +火の玉ボス
 DB $77,$91,$A7,$FF ;51 床ﾐｲﾗｶﾞｲｺﾂ+        +僕ボクサー
 DB $7B,$91,$7A,$AB ;52 引力玉,床 +        +赤アリーマ+Ｑちゃん
 DB $7B,$91,$57,$99 ;53 引力玉,床 +        +Ｏちゃん  +回転砲台
 DB $77,$91,$7A,$AA ;54 引力玉,床 +        +赤アリーマ+ドドン号 
 DB $7B,$91,$54,$99 ;55 床ﾐｲﾗｶﾞｲｺﾂ+        +ヒノックス+回転砲台
 DB $7B,$91,$56,$FF ;56 床ﾐｲﾗｶﾞｲｺﾂ+        +水スマシ  +
 DB $77,$91,$54,$99 ;57 床ﾐｲﾗｶﾞｲｺﾂ+        +ヒノックス+回転砲台
 DB $7B,$91,$FF,$FF ;58 ボス用つなぎ(Ｌｖ．８)
 DB $5F,$91,$9D,$99 ;59 ピーハット+        +爆弾兵    +回転砲台
 DB $7B,$91,$96,$99 ;5A 引力玉,床 +        +マネマネ  +回転砲台
 DB $7B,$91,$7A,$99 ;5B 引力玉,床 +        +赤アリーマ+回転砲台
 DB $77,$91,$7A,$99 ;5C 床ﾐｲﾗｶﾞｲｺﾂ+        +赤アリーマ+回転砲台
 DB $77,$91,$96,$99 ;5D 床ﾐｲﾗｶﾞｲｺﾂ+        +マネマネ  +回転砲台
 DB $5F,$91,$55,$93 ;5E くり坊	  +すらいむ+カービー  +ミイラ
 DB $FF,$91,$95,$93 ;5F 	  +すらイム+魔法使い  +ミイラ
 DB $90,$91,$55,$93 ;60 Ｌｖ．７つなぎ
 DB $A6,$91,$95,$60 ;61 常駐１    +常駐２  +魔法使い  +ｱﾒﾝﾎﾞ,ﾊﾞﾚﾘ-ﾅ
 DB $A6,$91,$95,$99 ;62 常駐１    +常駐２  +魔法使い  +回転砲台
 DB $5F,$D9,$DA,$DB ;63 栗ＢＯ　  +じゃま岩+デカバブル+一つ目どすん
 DB $5F,$D9,$DA,$64 ;64 栗ＢＯ 　 +じゃま岩+デカバブル+パックン
 DB $FF,$91,$90,$76 ;65 	  +常駐(Ｄ)+ｺｰﾓﾘ,ﾓﾄｽ他+岩持ち君
 DB $FF,$91,$90,$98 ;66		  +常駐(Ｄ)+ｺｰﾓﾘ,ﾓﾄｽ他+速虫
 DB $FF,$4A,$90,$76 ;67		  +ピラニア+ｺｰﾓﾘ,ﾓﾄｽ他+岩持ち君
 DB $5F,$FF,$FF,$FF ;68 栗ＢＯ  　+
 DB $FF,$FF,$FF,$FF ;69
 DB $FF,$FF,$FF,$FF ;6A
 DB $FF,$FF,$FF,$FF ;6B
 DB $FF,$FF,$FF,$FF ;6C
 DB $FF,$91,$90,$A6 ;6D         +スライム+ｺｰﾓﾘ,ﾓﾄｽ他+床ペラ
 DB $A4,$FF,$FF,$F4 ;6E		火炎放射器(HODAI)
 DB $E8,$E9,$EA,$EB ;6F		ラスト大ボス(顔長い)
 DB $FF,$FF,$FF,$FF ;70
 DB $FF,$FF,$FF,$FF ;71
 DB $FF,$FF,$FF,$FF ;72
 DB $FF,$FF,$FF,$FF ;73
 DB $FF,$FF,$FF,$FF ;74
 DB $FF,$FF,$FF,$FF ;75
 DB $FF,$FF,$FF,$FF ;76
 DB $FF,$FF,$FF,$FF ;77
 DB $FF,$FF,$FF,$FF ;78
 DB $FF,$FF,$FF,$FF ;79
 DB $FF,$FF,$FF,$FF ;7A
 DB $FF,$FF,$FF,$FF ;7B
 DB $44,$A1,$75,$4E ;7C カメラ小僧 + ルアー竿 + 釣親父下着 + 釣り屋
 DB $FF,$61,$FF,$FF ;7D 動物村右上の家の中のゾーラ
 DB $A4,$FF,$86,$FF ;7E	ブーメランおっさん
 DB $A4,$FF,$8B,$FF ;7F      +	  +穴長虫
 DB $A4,$4D,$FF,$FF ;80  常駐+妖精




;□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□
;□	バンク１Ａ						       □
;□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□
BANK1A	GROUP	$1A

;┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
;┃	zbd.s のプログラムをここに移動					 ┃
;┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
;=========================================================
;=	地上用ユニット（ゲームボーイ用）		 =
;=========================================================
BGUNCH
;- - Thru BG - -
	DB	$7C,$7C,$7C,$7C	;(00) BETA0
	DB	$7D,$7D,$7D,$7D	;(01) BETA1
	DB	$7E,$7E,$7E,$7E	;(02) BETA2
	DB	$76,$76,$76,$76	;(03) NUKI0
	DB	$5A,$7F,$7F,$5A	;(04) KUSA0
	DB	$7C,$7C,$7C,$00	;(05) MEGG0
	DB	$7C,$7C,$01,$02 ;(06) MEGG1
	DB	$7C,$7C,$03,$7C ;(07) MEGG2
	DB	$0C,$0D,$1C,$1D ;(08) SUNA0
	DB	$72,$73,$73,$72 ;(09) STON2
	DB	$75,$75,$75,$75 ;(0A) KUSA2
	DB	$74,$74,$74,$74 ;(0B) HANA0
	DB	$0F,$0F,$0F,$0F ;(0C) TURO0
	DB	$0E,$0E,$0E,$0E ;(0D) TURO1
	DB	$6D,$6D,$6D,$6D ;(0E) MIZU0 Deep
	DB	$5A,$7F,$04,$04 ;(0F) MGW00
	DB	$14,$14,$7F,$5A ;(10) MGW01
	DB	$5A,$15,$7F,$15 ;(11) MGW02
	DB	$05,$7F,$05,$5A ;(12) MGW03
	DB	$5A,$7F,$7F,$17 ;(13) MGW04
	DB	$5A,$7F,$06,$5A ;(14) MGW05
	DB	$5A,$07,$7F,$5A ;(15) MGW06
	DB	$16,$7F,$7F,$5A ;(16) MGW07
	DB	$5A,$15,$04,$18 ;(17) MGW08
	DB	$05,$7F,$19,$04 ;(18) MGW09
	DB	$14,$08,$7F,$15 ;(19) MGW0A
	DB	$09,$14,$05,$5A ;(1A) MGW0B
;
	DB	$6C,$6C,$6C,$6C ;(1B) AMIZU shalow
	DB	$7F,$7F,$7F,$7F ;(1C) NUKI1
	DB	$7D,$7D,$16,$5C ;(1D) YGAK2
	DB	$6C,$6D,$6E,$6F ;(1E) SEA00
	DB	$6E,$6F,$6E,$6F ;(1F) SEA01
	DB	$F0,$F2,$F1,$F3 ;(20) IWA00
;- - Hit BG - -
	DB	$0E,$01,$10,$11 ;(21) JWOD0
	DB	$4A,$4B,$5A,$5B ;(22) SBTN0
	DB	$0E,$0F,$1E,$1F ;(23) GOMI0
	DB	$0A,$0B,$1A,$1B ;(24) KAIG0
;
	DB	$20,$21,$30,$31 ;(25) Big wood uper
	DB	$22,$23,$32,$33 ;(26)
	DB	$24,$25,$34,$35 ;(27) Big wood lower
	DB	$26,$27,$36,$37 ;(28)
	DB	$28,$21,$30,$31 ;(29) Big wood uper2
	DB	$22,$29,$32,$33 ;(2A)
;
	DB	$4C,$4A,$48,$5C ;(2B) GAK00
	DB	$4A,$4A,$45,$45 ;(2C) GAK01
	DB	$4A,$4D,$5D,$59 ;(2D) GAK02
	DB	$48,$51,$44,$56 ;(2E) GAK03
	DB	$45,$45,$55,$56 ;(2F) GAK04
	DB	$0C,$0D,$1C,$1D ;(30) HASU0
	DB	$4E,$49,$45,$52 ;(31) GAK06
	DB	$49,$4F,$51,$45 ;(32) GAK07
	DB	$48,$51,$54,$56 ;(33) GAK08
	DB	$52,$59,$55,$57 ;(34) GAK09
	DB	$45,$2A,$55,$3A ;(35) GAK0A
	DB	$2B,$45,$3B,$56 ;(36) GAK0B
	DB	$48,$49,$48,$49 ;(37) GAK10
	DB	$49,$59,$49,$59 ;(38) GAK12
	DB	$44,$56,$54,$56 ;(39) GAK13
	DB	$55,$56,$55,$56 ;(3A) GAK14
	DB	$55,$47,$55,$57 ;(3B) GAK15
	DB	$45,$41,$43,$49 ;(3C) GAK16
	DB	$42,$45,$49,$40 ;(3D) GAK17
	DB	$44,$56,$44,$56 ;(3E) GAK18
	DB	$55,$47,$55,$47 ;(3F) GAK19
	DB	$09,$7C,$16,$0D ;(40) YKN00
	DB	$7C,$7C,$1D,$1E ;(41) YKN01
	DB	$7C,$19,$1F,$18 ;(42) YKN02
	DB	$74,$74,$56,$56 ;(43) GAKHD
	DB	$6E,$5A,$5A,$6F ;(44) HKUSA
	DB	$50,$53,$46,$58 ;(45) TELKN
	DB	$43,$49,$48,$49 ;(46) GAK29
	DB	$49,$40,$49,$59 ;(47) GAK2A
	DB	$45,$2A,$55,$56 ;(48) GAK2B
	DB	$2B,$45,$55,$56 ;(49) GAK2C
	DB	$7F,$7F,$56,$56 ;(4A) GAK2D
	DB	$48,$49,$45,$52 ;(4B) GAK2E
	DB	$49,$59,$51,$45 ;(4C) GAK2F
	DB	$7C,$7C,$45,$45 ;(4D) GAK30
	DB	$52,$59,$55,$47 ;(4E) GAK31
	DB	$02,$1E,$12,$13 ;(4F) JWOD1
	DB	$7D,$7D,$45,$45 ;(50) YGAK3
	DB	$0A,$0B,$1A,$1B ;(51) IWA01
	DB	$5E,$5E,$5F,$5F ;(52) YANEZ
	DB	$5B,$5B,$5B,$5B ;(53) HASG1
	DB	$08,$09,$18,$19 ;(54) TAKEY
	DB	$06,$07,$09,$7C ;(55) YANE2
	DB	$07,$08,$7C,$19 ;(56) YANE3
	DB	$09,$7C,$16,$17 ;(57) YANE4
	DB	$7C,$19,$17,$18 ;(58) YANE5
	DB	$7C,$7C,$17,$17 ;(59) YANE6
	DB	$07,$07,$7C,$7C ;(5A) YANE7
	DB	$2C,$2D,$3C,$3D ;(5B) WIND0
	DB	$F4,$F6,$F5,$F7 ;(5C) FLW00
	DB	$7D,$7D,$5D,$17 ;(5D) YGAK4
	DB	$02,$03,$12,$13 ;(5E) KAZA1
	DB	$04,$05,$04,$05 ;(5F) ISID0
	DB	$04,$05,$14,$15 ;(60) ISID1
	DB	$0A,$0B,$1A,$1B ;(61) IDO00
	DB	$0C,$0C,$1C,$1C ;(62) POLE0
	DB	$10,$7F,$12,$7F ;(63) MEGG3
	DB	$7F,$7F,$0E,$7F ;(64) MEGG4
	DB	$0E,$11,$7F,$13 ;(65) MEGG5
	DB	$04,$05,$14,$15 ;(66) SEKZ2
	DB	$06,$07,$16,$17 ;(67) SEKZ3
	DB	$08,$09,$18,$19 ;(68) SEKZ4
	DB	$0A,$0B,$1A,$1B ;(69) SABO0
	DB	$0A,$0A,$0A,$0A ;(6A) HKR00
	DB	$0A,$0A,$1A,$1A ;(6B) HKR01
	DB	$0B,$0B,$1B,$1B ;(6C) HKR02
	DB	$00,$01,$0E,$1E ;(6D) RION3
	DB	$42,$41,$51,$52 ;(6E) DONAT
	DB	$38,$39,$54,$57 ;(6F) FUKRO
	DB	$0A,$0B,$1A,$1B ;(70) SNKEY
	DB	$04,$7F,$04,$0E ;(71) MEGG6
	DB	$00,$01,$04,$11 ;(72) BAR01
	DB	$02,$03,$12,$05 ;(73) BAR03
	DB	$07,$06,$06,$07 ;(74) BAR04
	DB	$07,$0B,$06,$1B ;(75) IGL00
	DB	$0E,$06,$1E,$07 ;(76) IGL02
	DB	$0F,$1F,$0F,$1F ;(77) YHASG
	DB	$0D,$0D,$1C,$1C ;(78) BRD00
	DB	$1C,$1C,$1D,$1D ;(79) BRD01
	DB	$0D,$0D,$1D,$1D ;(7A) BRD02
	DB	$0C,$0C,$0C,$0C ;(7B) MOU00
	DB	$7C,$0A,$0A,$7F ;(7C) MOU01
	DB	$1A,$7C,$7F,$1A ;(7D) MOU02
	DB	$1A,$0A,$7F,$7F ;(7E) MOU03
	DB	$0E,$05,$7F,$05 ;(7F) MEGG7
	DB	$7C,$7C,$06,$5C ;(80) YGAK0
	DB	$7C,$7C,$5D,$07 ;(81) YGAK1
	DB	$24,$25,$0E,$0F ;(82) BIG WOOD LOW L(mayoi no mori)
	DB	$26,$27,$10,$11 ;(83) BIG WOOD LOW R(mayoi no mori)
	DB	$12,$7C,$00,$00 ;(84) STB00
	DB	$01,$01,$7C,$12 ;(85) STB01
	DB	$02,$7C,$02,$12 ;(86) STB02
	DB	$12,$03,$7C,$03 ;(87) STB03
	DB	$12,$7C,$7C,$04 ;(88) STB04
	DB	$12,$7C,$05,$12 ;(89) STB05
	DB	$12,$06,$7C,$12 ;(8A) STB06
	DB	$07,$7C,$7C,$12 ;(8B) STB07
	DB	$12,$03,$00,$09 ;(8C) STB08
	DB	$02,$7C,$08,$00 ;(8D) STB09
	DB	$01,$0B,$7C,$03 ;(8E) STB0A
	DB	$0A,$01,$02,$12 ;(8F) STB0B
	DB	$12,$7C,$7C,$12 ;(90) STB0C
	DB	$00,$6C,$10,$6D ;(91) KAZA0
	DB	$12,$7C,$13,$14 ;(92) MANA1
	DB	$0B,$0B,$1B,$1B ;(93) CAS00
	DB	$00,$0B,$10,$1B ;(94) CAS01
	DB	$0B,$01,$1B,$11 ;(95) CAS02
	DB	$0B,$0B,$0B,$0B ;(96) CAS03
	DB	$00,$0B,$00,$0B ;(97) CAS04
	DB	$0B,$01,$0B,$01 ;(98) CAS05
	DB	$09,$09,$19,$19 ;(99) CASU0
	DB	$08,$18,$08,$18 ;(9A) CASU1
	DB	$02,$09,$08,$04 ;(9B) CASU2
	DB	$09,$03,$05,$18 ;(9C) CASU3
	DB	$08,$14,$12,$19 ;(9D) CASU4
	DB	$15,$18,$19,$13 ;(9E) CASU5
	DB	$02,$03,$08,$18 ;(9F) BRD03
	DB	$60,$61,$70,$71 ;(A0) DTRE0
	DB	$62,$63,$70,$71 ;(A1) DTOP0
	DB	$00,$01,$00,$01 ;(A2) CAS06
	DB	$08,$18,$12,$13 ;(A3) BRD04
	DB	$0B,$0B,$0B,$1E ;(A4) CAIN0
	DB	$0B,$0B,$1E,$1E ;(A5) CAIN1
	DB	$0B,$0B,$1E,$0B ;(A6) CAIN2
	DB	$0B,$1E,$1B,$1E ;(A7) CAIN3
	DB	$1E,$0B,$1E,$1B ;(A8) CAIN4
	DB	$14,$7F,$0B,$1B ;(A9) MEGG8
	DB	$7F,$0E,$1E,$1E ;(AA) MEGG9
	DB	$0A,$0A,$1A,$1A ;(AB) MOM00
	DB	$1A,$1A,$1A,$1A ;(AC) MOM01
	DB	$1E,$1E,$09,$08 ;(AD) SIN00
	DB	$09,$04,$19,$14 ;(AE) SIN01
	DB	$1E,$1E,$18,$08 ;(AF) SIN02
	DB	$05,$04,$15,$14 ;(B0) SIN03
	DB	$1E,$1E,$18,$09 ;(B1) SIN04
	DB	$05,$09,$15,$19 ;(B2) SIN05
	DB	$0E,$0F,$0F,$0E ;(B3) SYANE
	DB	$1E,$1E,$09,$09 ;(B4) TATE0
	DB	$09,$09,$19,$19 ;(B5) TATE1
	DB	$00,$01,$10,$11 ;(B6) POLE1
	DB	$02,$03,$12,$13 ;(B7) POLE2
	DB	$06,$07,$16,$17 ;(B8) SBHRS
	DB	$0C,$0D,$1C,$1D ;(B9) STAMI
	DB	$FC,$FD,$FE,$FF ;(BA) BK000
	DB	$04,$05,$14,$15 ;(BB) BOMG0
	DB	$06,$07,$16,$17 ;(BC) BOMG1
	DB	$08,$09,$18,$19 ;(BD) BOMG2
	DB	$0A,$0B,$1A,$1B ;(BE) BOMG3
	DB	$7F,$15,$1C,$0C ;(BF) MEGGA
	DB	$02,$03,$0D,$1D ;(C0) RION1
	DB	$7F,$7F,$0F,$0F ;(C1) MEGGB
	DB	$0C,$0C,$1C,$1C ;(C2) DIN00
	DB	$02,$01,$12,$11 ;(C3) WOODY
	DB	$0E,$0F,$1E,$1F ;(C4) OHAKA
	DB	$0E,$0F,$1E,$1F ;(C5) OHAMV
	DB	$68,$69,$77,$4B ;(C6) SINDO
	DB	$0F,$01,$10,$11 ;(C7) JWOD4
	DB	$08,$09,$18,$19 ;(C8) KYOK1
	DB	$02,$1F,$12,$13 ;(C9) JWOD5
	DB	$0E,$1E,$1E,$0E ;(CA) IWA02
	DB	$7E,$7E,$1F,$1F ;(CB) MEGGC
	DB	$6A,$6B,$7A,$7B ;(CC) HTANA
	DB	$04,$05,$14,$15 ;(CD) UWOD2
	DB	$06,$07,$16,$17 ;(CE) UWOD3
	DB	$6C,$6C,$6C,$6C ;(CF) SBEL0
	DB	$6D,$6D,$6D,$6D ;(D0) SBEL1
	DB	$6E,$6E,$6E,$6E ;(D1) SBEL2
	DB	$6F,$6F,$6F,$6F ;(D2) SBEL3
	DB	$F4,$F6,$F5,$F7 ;(D3) ANFLW
	DB	$F8,$FA,$F9,$FB ;(D4) KNBAN
	DB	$0A,$0B,$1A,$1B ;(D5) BASU0
	DB	$0C,$0D,$1C,$1D ;(D6) BASU1
	DB	$0E,$0F,$1E,$1F ;(D7) BASU2
	DB	$45,$45,$55,$56 ;(D8) GSAV0
	DB	$6D,$6D,$6D,$6D ;(D9) GSAV1
	DB	$4A,$4A,$45,$45 ;(DA) GSAV2
	DB	$0C,$0D,$1C,$1D ;(DB) SARUH
	DB	$6E,$5A,$5A,$6F ;(DC) HKAZA
	DB	$49,$40,$49,$59 ;(DD) GAK50
	DB	$43,$49,$48,$49 ;(DE) GAK51
	DB	$00,$00,$00,$00 ;(DF)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
	DB	$5B,$5B,$5B,$5B ;(E0) HASG0
	DB	$64,$65,$66,$67 ;(E1) ANA00
	DB	$2E,$2F,$3E,$3F ;(E2) ANA01
	DB	$7E,$7E,$1F,$1F ;(E3) ANA02
	DB	$15,$16,$17,$18 ;(E4) MANA2
	DB	$7D,$7D,$7D,$7D	;(E5) YBETA
	DB	$74,$0C,$74,$1C ;(E6) POLE3
	DB	$1E,$1E,$7E,$7E ;(E7) SANA0
	DB	$68,$69,$78,$79 ;(E8) ANA03
	DB	$6E,$6E,$6E,$6E ;(E9) TAKI0
	DB	$48,$49,$48,$5F ;(EA) GAK40
	DB	$6C,$6C,$6C,$6C ;(EB) JWAT0
	DB	$6D,$6D,$6D,$6D ;(EC) JWAT1
	DB	$6F,$6F,$6F,$6F ;(ED) JWAT2
	DB	$6E,$6E,$6E,$6E ;(EE) JWAT3
	DB	$6F,$6F,$7D,$7D ;(EF) UMI00
	DB	$48,$7F,$48,$7F ;(F0) GAK41
	DB	$48,$5E,$48,$49 ;(F1) GAK42
	DB	$49,$59,$5F,$59 ;(F2) GAK43
	DB	$7F,$59,$7F,$59 ;(F3) GAK44
	DB	$5E,$59,$49,$59 ;(F4) GAK45

;=========================================================
;=	地上用ユニット（カラーゲームボーイ用）		 =
;=========================================================
BGUNCH_CGB
;- - Thru BG - -
	DB	$7C,$7C,$7C,$7C	;(00) BETA0
	DB	$7D,$7D,$7D,$7D	;(01) BETA1
	DB	$7E,$7E,$7E,$7E	;(02) BETA2
	DB	$76,$76,$76,$76	;(03) NUKI0
	DB	$5A,$7F,$7F,$5A	;(04) KUSA0
	DB	$7C,$7C,$7C,$00	;(05) MEGG0
	DB	$7C,$7C,$01,$02 ;(06) MEGG1
	DB	$7C,$7C,$03,$7C ;(07) MEGG2
	DB	$0C,$0D,$1C,$1D ;(08) SUNA0
	DB	$72,$73,$73,$72 ;(09) STON2
	DB	$53,$65,$67,$75 ;(0A) KUSA2 草
	DB	$74,$74,$74,$74 ;(0B) HANA0
	DB	$0F,$0F,$0F,$0F ;(0C) TURO0
	DB	$0E,$0E,$0E,$0E ;(0D) TURO1
	DB	$6D,$6D,$6D,$6D ;(0E) MIZU0 Deep
	DB	$5A,$7F,$04,$04 ;(0F) MGW00
	DB	$14,$14,$7F,$5A ;(10) MGW01
	DB	$5A,$15,$7F,$15 ;(11) MGW02
	DB	$05,$7F,$05,$5A ;(12) MGW03
	DB	$5A,$7F,$7F,$17 ;(13) MGW04
	DB	$5A,$7F,$06,$5A ;(14) MGW05
	DB	$5A,$07,$7F,$5A ;(15) MGW06
	DB	$16,$7F,$7F,$5A ;(16) MGW07
	DB	$5A,$15,$04,$18 ;(17) MGW08
	DB	$05,$7F,$19,$04 ;(18) MGW09
	DB	$14,$08,$7F,$15 ;(19) MGW0A
	DB	$09,$14,$05,$5A ;(1A) MGW0B
;
	DB	$6C,$6C,$6C,$6C ;(1B) AMIZU shalow
	DB	$7F,$7F,$7F,$7F ;(1C) NUKI1
	DB	$7D,$7D,$16,$5C ;(1D) YGAK2
	DB	$6C,$6D,$6E,$6F ;(1E) SEA00
	DB	$6E,$6F,$6E,$6F ;(1F) SEA01
	DB	$F0,$F2,$F1,$F3 ;(20) IWA00
;- - Hit BG - -
	DB	$0E,$01,$10,$11 ;(21) JWOD0
	DB	$4A,$4B,$5A,$5B ;(22) SBTN0
	DB	$0E,$0F,$1E,$1F ;(23) GOMI0
	DB	$0A,$0B,$1A,$1B ;(24) KAIG0
;
	DB	$20,$21,$30,$31 ;(25) Big wood uper
	DB	$22,$23,$32,$33 ;(26) 
	DB	$24,$25,$34,$35 ;(27) Big wood lower
	DB	$26,$27,$36,$37 ;(28) 
	DB	$28,$21,$30,$31 ;(29) Big wood uper2
	DB	$22,$29,$32,$33 ;(2A) 
;
	DB	$4C,$4A,$48,$5C ;(2B) GAK00
	DB	$4A,$4A,$45,$45 ;(2C) GAK01
	DB	$4A,$4D,$5D,$59 ;(2D) GAK02
	DB	$48,$51,$44,$56 ;(2E) GAK03
	DB	$45,$45,$55,$56 ;(2F) GAK04
	DB	$0C,$0D,$1C,$1D ;(30) HASU0
	DB	$4E,$49,$45,$52 ;(31) GAK06
	DB	$49,$4F,$51,$45 ;(32) GAK07
	DB	$48,$51,$54,$56 ;(33) GAK08
	DB	$52,$59,$55,$57 ;(34) GAK09
	DB	$45,$2A,$55,$3A ;(35) GAK0A
	DB	$2B,$45,$3B,$56 ;(36) GAK0B
	DB	$48,$49,$48,$49 ;(37) GAK10
	DB	$49,$59,$49,$59 ;(38) GAK12
	DB	$44,$56,$54,$56 ;(39) GAK13
	DB	$55,$56,$55,$56 ;(3A) GAK14
	DB	$55,$47,$55,$57 ;(3B) GAK15
	DB	$45,$41,$43,$49 ;(3C) GAK16
	DB	$42,$45,$49,$40 ;(3D) GAK17
	DB	$44,$56,$44,$56 ;(3E) GAK18
	DB	$55,$47,$55,$47 ;(3F) GAK19
	DB	$09,$7C,$16,$0D ;(40) YKN00
	DB	$7C,$7C,$1D,$1E ;(41) YKN01
	DB	$7C,$19,$1F,$18 ;(42) YKN02
	DB	$74,$74,$56,$56 ;(43) GAKHD
	DB	$6E,$58,$58,$6F ;(44) HKUSA  お花
	DB	$50,$50,$46,$46 ;(45) TELKN
	DB	$43,$49,$48,$49 ;(46) GAK29
	DB	$49,$40,$49,$59 ;(47) GAK2A
	DB	$45,$2A,$55,$56 ;(48) GAK2B
	DB	$2B,$45,$55,$56 ;(49) GAK2C
	DB	$7F,$7F,$56,$56 ;(4A) GAK2D
	DB	$48,$49,$45,$52 ;(4B) GAK2E
	DB	$49,$59,$51,$45 ;(4C) GAK2F
	DB	$7C,$7C,$45,$45 ;(4D) GAK30
	DB	$52,$59,$55,$47 ;(4E) GAK31
	DB	$02,$1E,$12,$13 ;(4F) JWOD1
	DB	$7D,$7D,$45,$45 ;(50) YGAK3
	DB	$0A,$0B,$1A,$1B ;(51) IWA01
	DB	$5E,$5E,$5F,$5F ;(52) YANEZ
	DB	$64,$64,$0b,$0b ;(53) HASG1 （新規）水付き洞窟入り口
	DB	$08,$09,$18,$19 ;(54) TAKEY
	DB	$06,$07,$09,$7C ;(55) YANE2
	DB	$07,$08,$7C,$19 ;(56) YANE3
	DB	$09,$7C,$16,$17 ;(57) YANE4
	DB	$7C,$19,$17,$18 ;(58) YANE5
	DB	$7C,$7C,$17,$17 ;(59) YANE6
	DB	$07,$07,$7C,$7C ;(5A) YANE7
	DB	$2C,$2D,$3C,$3D ;(5B) WIND0
	DB	$F4,$F6,$F5,$F7 ;(5C) FLW00
	DB	$7D,$7D,$5D,$17 ;(5D) YGAK4
	DB	$02,$03,$12,$13 ;(5E) KAZA1
	DB	$04,$05,$04,$05 ;(5F) ISID0
	DB	$04,$05,$14,$15 ;(60) ISID1
	DB	$0A,$0B,$1A,$1B ;(61) IDO00
	DB	$0C,$0C,$1C,$1C ;(62) POLE0
	DB	$10,$7F,$12,$7F ;(63) MEGG3
	DB	$7F,$7F,$0E,$7F ;(64) MEGG4
	DB	$0E,$11,$7F,$13 ;(65) MEGG5
	DB	$04,$05,$14,$15 ;(66) SEKZ2
	DB	$06,$07,$16,$17 ;(67) SEKZ3
	DB	$08,$09,$18,$19 ;(68) SEKZ4
	DB	$0A,$0B,$1A,$1B ;(69) SABO0
	DB	$0A,$0A,$0A,$0A ;(6A) HKR00
	DB	$0A,$0A,$1A,$1A ;(6B) HKR01
	DB	$0B,$0B,$1B,$1B ;(6C) HKR02
	DB	$00,$01,$0E,$1E ;(6D) RION3
	DB	$42,$41,$51,$52 ;(6E) DONAT
	DB	$38,$39,$54,$57 ;(6F) FUKRO
	DB	$0A,$0B,$1A,$1B ;(70) SNKEY
	DB	$04,$7F,$05,$0E ;(71) MEGG6 タマゴ左横
	DB	$00,$01,$04,$11 ;(72) BAR01
	DB	$02,$03,$12,$05 ;(73) BAR03
	DB	$07,$06,$06,$07 ;(74) BAR04
	DB	$07,$0B,$06,$1B ;(75) IGL00
	DB	$0E,$06,$1E,$07 ;(76) IGL02
	DB	$0F,$1F,$0F,$1F ;(77) YHASG
	DB	$0D,$0D,$1C,$1C ;(78) BRD00
	DB	$1C,$1C,$1D,$1D ;(79) BRD01
	DB	$0D,$0D,$1D,$1D ;(7A) BRD02
	DB	$0C,$0C,$0C,$0C ;(7B) MOU00
	DB	$7C,$0A,$0A,$7F ;(7C) MOU01
	DB	$1A,$7C,$7F,$1A ;(7D) MOU02
	DB	$1A,$0A,$7F,$7F ;(7E) MOU03
	DB	$0E,$04,$7F,$05 ;(7F) MEGG7 タマゴ右横
	DB	$7C,$7C,$06,$5C ;(80) YGAK0
	DB	$7C,$7C,$5D,$07 ;(81) YGAK1
	DB	$24,$25,$0E,$0F ;(82) BIG WOOD LOW L(mayoi no mori)
	DB	$26,$27,$10,$11 ;(83) BIG WOOD LOW R(mayoi no mori)
	DB	$12,$7C,$00,$00 ;(84) STB00
	DB	$01,$01,$7C,$12 ;(85) STB01
	DB	$02,$7C,$02,$12 ;(86) STB02
	DB	$12,$03,$7C,$03 ;(87) STB03
	DB	$12,$7C,$7C,$04 ;(88) STB04
	DB	$12,$7C,$05,$12 ;(89) STB05
	DB	$12,$06,$7C,$12 ;(8A) STB06
	DB	$07,$7C,$7C,$12 ;(8B) STB07
	DB	$12,$03,$00,$09 ;(8C) STB08
	DB	$02,$7C,$08,$00 ;(8D) STB09
	DB	$01,$0B,$7C,$03 ;(8E) STB0A
	DB	$0A,$01,$02,$12 ;(8F) STB0B
	DB	$12,$7C,$7C,$12 ;(90) STB0C
	DB	$00,$6C,$10,$6D ;(91) KAZA0
	DB	$12,$7C,$13,$14 ;(92) MANA1
	DB	$0B,$0B,$1B,$1B ;(93) CAS00
	DB	$00,$0B,$10,$1B ;(94) CAS01
	DB	$0B,$01,$1B,$11 ;(95) CAS02
	DB	$0B,$0B,$0B,$0B ;(96) CAS03
	DB	$00,$0B,$00,$0B ;(97) CAS04
	DB	$0B,$01,$0B,$01 ;(98) CAS05
	DB	$09,$09,$19,$19 ;(99) CASU0
	DB	$08,$18,$08,$18 ;(9A) CASU1
	DB	$02,$09,$08,$04 ;(9B) CASU2
	DB	$09,$03,$05,$18 ;(9C) CASU3
	DB	$08,$14,$12,$19 ;(9D) CASU4
	DB	$15,$18,$19,$13 ;(9E) CASU5
	DB	$02,$03,$08,$18 ;(9F) BRD03
	DB	$60,$60,$70,$70 ;(A0) DTRE0  宝箱（閉じたやつ）
	DB	$62,$62,$70,$70 ;(A1) DTOP0  宝箱（開いたやつ）
	DB	$00,$01,$00,$01 ;(A2) CAS06
	DB	$08,$18,$12,$13 ;(A3) BRD04
	DB	$0B,$0B,$0B,$1E ;(A4) CAIN0
	DB	$0B,$0B,$1E,$1E ;(A5) CAIN1
	DB	$0B,$0B,$1E,$0B ;(A6) CAIN2
	DB	$0B,$1E,$1B,$1E ;(A7) CAIN3
	DB	$1E,$0B,$1E,$1B ;(A8) CAIN4
	DB	$14,$7F,$0B,$1B ;(A9) MEGG8
	DB	$7F,$0E,$1E,$1E ;(AA) MEGG9
	DB	$0A,$0A,$1A,$1A ;(AB) MOM00
	DB	$1A,$1A,$1A,$1A ;(AC) MOM01
	DB	$1E,$1E,$09,$08 ;(AD) SIN00
	DB	$09,$04,$19,$14 ;(AE) SIN01
	DB	$1E,$1E,$18,$08 ;(AF) SIN02
	DB	$05,$04,$15,$14 ;(B0) SIN03
	DB	$1E,$1E,$18,$09 ;(B1) SIN04
	DB	$05,$09,$15,$19 ;(B2) SIN05
	DB	$0E,$0F,$0F,$0E ;(B3) SYANE
	DB	$1E,$1E,$09,$09 ;(B4) TATE0
	DB	$09,$09,$19,$19 ;(B5) TATE1
	DB	$00,$01,$10,$11 ;(B6) POLE1
	DB	$02,$03,$12,$13 ;(B7) POLE2
	DB	$06,$07,$16,$17 ;(B8) SBHRS
	DB	$0C,$0D,$1C,$1D ;(B9) STAMI
	DB	$FC,$FD,$FE,$FF ;(BA) BK000
	DB	$04,$05,$14,$15 ;(BB) BOMG0
	DB	$06,$07,$16,$17 ;(BC) BOMG1
	DB	$08,$09,$18,$19 ;(BD) BOMG2
	DB	$0A,$0B,$1A,$1B ;(BE) BOMG3
	DB	$7F,$15,$1C,$0C ;(BF) MEGGA
	DB	$02,$03,$0D,$1D ;(C0) RION1
	DB	$7F,$7F,$0F,$0F ;(C1) MEGGB
	DB	$0C,$0C,$1C,$1C ;(C2) DIN00
	DB	$02,$01,$12,$11 ;(C3) WOODY
	DB	$0E,$0F,$1E,$1F ;(C4) OHAKA
	DB	$0E,$0F,$1E,$1F ;(C5) OHAMV
	DB	$68,$69,$77,$4B ;(C6) SINDO
	DB	$0F,$01,$10,$11 ;(C7) JWOD4
	DB	$08,$09,$18,$19 ;(C8) KYOK1
	DB	$02,$1F,$12,$13 ;(C9) JWOD5
	DB	$0E,$1E,$1E,$0E ;(CA) IWA02
	DB	$7E,$7E,$1F,$1F ;(CB) MEGGC
	DB	$6A,$6B,$7A,$7B ;(CC) HTANA
	DB	$04,$05,$14,$15 ;(CD) UWOD2
	DB	$06,$07,$16,$17 ;(CE) UWOD3
	DB	$6C,$6C,$6C,$6C ;(CF) SBEL0
	DB	$6D,$6D,$6D,$6D ;(D0) SBEL1
	DB	$6E,$6E,$6E,$6E ;(D1) SBEL2
	DB	$6F,$6F,$6F,$6F ;(D2) SBEL3
	DB	$F4,$F6,$F5,$F7 ;(D3) ANFLW
	DB	$F8,$FA,$F9,$FB ;(D4) KNBAN
	DB	$0A,$0B,$1A,$1B ;(D5) BASU0
	DB	$0C,$0D,$1C,$1D ;(D6) BASU1
	DB	$0E,$0F,$1E,$1F ;(D7) BASU2
	DB	$45,$45,$55,$56 ;(D8) GSAV0
	DB	$6D,$6D,$6D,$6D ;(D9) GSAV1
	DB	$4A,$4A,$45,$45 ;(DA) GSAV2
	DB	$0C,$0D,$1C,$1D ;(DB) SARUH
	DB	$6E,$5A,$5A,$6F ;(DC) HKAZA
	DB	$49,$40,$49,$59 ;(DD) GAK50
	DB	$43,$49,$48,$49 ;(DE) GAK51
	DB	$00,$00,$00,$00 ;(DF) 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
	DB	$5B,$5B,$5B,$5B ;(E0) HASG0
	DB	$64,$64,$66,$66 ;(E1) ANA00  入り口
	DB	$2E,$2F,$3E,$3F ;(E2) ANA01
	DB	$7E,$7E,$1F,$1F ;(E3) ANA02
	DB	$15,$16,$17,$18 ;(E4) MANA2
	DB	$7D,$7D,$7D,$7D	;(E5) YBETA
	DB	$74,$0C,$74,$1C ;(E6) POLE3
	DB	$1E,$1E,$7E,$7E ;(E7) SANA0
	DB	$68,$69,$78,$79 ;(E8) ANA03
	DB	$6E,$6E,$6E,$6E ;(E9) TAKI0
	DB	$48,$49,$48,$5F ;(EA) GAK40
	DB	$6C,$6C,$6C,$6C ;(EB) JWAT0
	DB	$6D,$6D,$6D,$6D ;(EC) JWAT1
	DB	$6F,$6F,$6F,$6F ;(ED) JWAT2
	DB	$6E,$6E,$6E,$6E ;(EE) JWAT3
	DB	$6F,$6F,$7D,$7D ;(EF) UMI00
	DB	$48,$7F,$48,$7F ;(F0) GAK41
	DB	$48,$5E,$48,$49 ;(F1) GAK42
	DB	$49,$59,$5F,$59 ;(F2) GAK43
	DB	$7F,$59,$7F,$59 ;(F3) GAK44
	DB	$5E,$59,$49,$59 ;(F4) GAK45

;-----<	新ＭＡＰ用ユニット >-----------------------------
	DB	$61,$63,$71,$58	;(F5)
	DB	$63,$61,$58,$71	;(F6)
	DB	$71,$58,$61,$63	;(F7)
	DB	$58,$71,$63,$61	;(F8)
	DB	$63,$63,$7c,$7c	;(F9)
	DB	$7c,$7c,$63,$63	;(FA)
	DB	$71,$7c,$71,$7c	;(FB)
	DB	$7c,$71,$7c,$71	;(FC)
	DB	$63,$63,$63,$63	;(FD)
	DB	$71,$71,$71,$71	;(FE)
	DB	$7c,$7c,$7c,$7c	;(FF)



;┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
;┃	ze5.s のプログラムをここに移動					 ┃
;┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;x	Ｌ４ 入り口出現 キャラ＆アトリビュートセット			x
;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
;------------------------------------------------------------------------
;	キャラクターデータ
;------------------------------------------------------------------------
;-----<	入り口出現 >-----------------------------------------------------
TKBGDT
  DB	$55,$56,$0A,$0B,$0C,$0D,$0E,$0F,$55,$56
  DB	$55,$56,$1A,$1B,$1C,$1D,$1E,$1F,$55,$56
;
  DB	$55,$56,$04,$05,$64,$65,$06,$07,$55,$56
  DB	$55,$56,$14,$15,$66,$67,$16,$17,$55,$56
;
  DB	$76,$76,$72,$73,$76,$76,$72,$73,$68,$69
  DB	$76,$76,$73,$72,$76,$76,$73,$72,$77,$4B
;
  DB	$6C,$6C,$6C,$6C,$76,$76,$76,$76,$72,$73
  DB	$6C,$6C,$6C,$6C,$76,$76,$76,$76,$73,$72
;
  DB	$6D,$6D,$6C,$6C,$6C,$6C,$6C,$6C,$6C,$6C
  DB	$6D,$6D,$6C,$6C,$6C,$6C,$6C,$6C,$6C,$6C

TKBGDT_CGB		; (CGB) 入り口のキャラにフリップ使用
  DB	$55,$56,$0A,$0B,$0C,$0D,$0E,$0F,$55,$56
  DB	$55,$56,$1A,$1B,$1C,$1D,$1E,$1F,$55,$56
;
  DB	$55,$56,$04,$05,$64,$64,$06,$07,$55,$56
  DB	$55,$56,$14,$15,$66,$66,$16,$17,$55,$56
;
  DB	$76,$76,$72,$73,$76,$76,$72,$73,$68,$69
  DB	$76,$76,$73,$72,$76,$76,$73,$72,$77,$4B
;
  DB	$6C,$6C,$6C,$6C,$76,$76,$76,$76,$72,$73
  DB	$6C,$6C,$6C,$6C,$76,$76,$76,$76,$73,$72
;
  DB	$6D,$6D,$6C,$6C,$6C,$6C,$6C,$6C,$6C,$6C
  DB	$6D,$6D,$6C,$6C,$6C,$6C,$6C,$6C,$6C,$6C

;-----<	滝 >-------------------------------------------------------------
TKBGDT2
  DB	$55,$56,$6E,$6E,$6E,$6E,$6E,$6E,$55,$56
  DB	$55,$56,$6E,$6E,$6E,$6E,$6E,$6E,$55,$56
;
  DB	$55,$56,$6E,$6E,$6E,$6E,$6E,$6E,$55,$56
  DB	$55,$56,$6E,$6E,$6E,$6E,$6E,$6E,$55,$56
;
  DB	$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D
  DB	$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D
;
  DB	$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D
  DB	$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D
;
  DB	$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D
  DB	$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D,$6D

;------------------------------------------------------------------------
;	アトリビュートデータ
;------------------------------------------------------------------------
;-----<	入り口出現 >-----------------------------------------------------
TKBGDT_atr
	DB	$03,$03,$03,$03,$03,$03,$03,$03,$03,$03
	DB	$03,$03,$03,$03,$03,$03,$03,$03,$03,$03
;
	DB	$03,$03,$03,$03,$03,$23,$03,$03,$03,$03
	DB	$03,$03,$03,$03,$03,$23,$03,$03,$03,$03
;
	DB	$03,$03,$07,$07,$03,$03,$07,$07,$03,$03
	DB	$03,$03,$07,$07,$03,$03,$07,$07,$03,$03
;
	DB	$04,$04,$04,$04,$03,$03,$03,$03,$07,$07
	DB	$04,$04,$04,$04,$03,$03,$03,$03,$07,$07
;
	DB	$04,$04,$04,$04,$04,$04,$04,$04,$04,$04
	DB	$04,$04,$04,$04,$04,$04,$04,$04,$04,$04
;
;-----<	滝 >-------------------------------------------------------------
TKBGDT2_atr
	DB	$03,$03,$04,$04,$04,$04,$04,$04,$03,$03
	DB	$03,$03,$04,$04,$04,$04,$04,$04,$03,$03
;
	DB	$03,$03,$04,$04,$04,$04,$04,$04,$03,$03
	DB	$03,$03,$04,$04,$04,$04,$04,$04,$03,$03
;
	DB	$04,$04,$04,$04,$04,$04,$04,$04,$04,$04
	DB	$04,$04,$04,$04,$04,$04,$04,$04,$04,$04
;
	DB	$04,$04,$04,$04,$04,$04,$04,$04,$04,$04
	DB	$04,$04,$04,$04,$04,$04,$04,$04,$04,$04
;
	DB	$04,$04,$04,$04,$04,$04,$04,$04,$04,$04
	DB	$04,$04,$04,$04,$04,$04,$04,$04,$04,$04
;========================================================================

Taki_atr_set_sub
		LD	H,D		; HL <--- DE
		LD	L,E

		LD	A,(CGBFLG)
		AND	A
		JR	Z,TKB033_PASS

		PUSH	BC
		PUSH	HL

		LD	A,(HL)		; 何列目？
		DEC	A
		LD	E,A
		SLA	A
		SLA	A
		SLA	A
		ADD	A,E
		ADD	A,E		; Ｘ１０
		LD	E,A
		LD	D,$0
		LD	HL,TKBGDT_atr	; 入り口用
		LD	A,(ENHELP)
		AND	$01
		JR	Z,Taki_atr_100
		LD	HL,TKBGDT2_atr	; 滝用
Taki_atr_100
		ADD	HL,DE
		LD	D,H		; DE <--- HL
		LD	E,L
		LD	C,10		; カウンタ

		LD	HL,VRAMD_AT+1
		LD	A,(VRAMD_AT)

		LD	A,(VRAMH)
		LD	(HLI),A
		LD	A,(VRAML)
		LD	(HLI),A
		LD	A,10-1
		LD	(HLI),A
Taki_atr_200
		LD	A,(DE)
		LD	(HLI),A
		INC	DE
		DEC	C		; １０キャラセット？
		JR	NZ,Taki_atr_200	; ＮＯ

		XOR	A
		LD	(HL),A

		POP	HL
		POP	BC

TKB033_PASS
	LD	A,(HL)
	DEC	A
	LD	E,A
	SLA	A
	SLA	A
	SLA	A
	ADD	A,E
	ADD	A,E	;x10
	LD	E,A
	LD	D,B
;(CGB)	LD	HL,TKBGDT
;(CGB)	LD	A,(ENHELP)
;(CGB)	AND	$01
;(CGB)	JR	Z,TKB055
;(CGB)	LD	HL,TKBGDT2

		LD	HL,TKBGDT2
		LD	A,(ENHELP)
		AND	$01
		JR	NZ,TKB055
		LD	HL,TKBGDT
		LD	A,(CGBFLG)
		AND	A
		JR	Z,TKB055
		LD	HL,TKBGDT_CGB	; ＣＧＢ用キャラクタ
TKB055
	ADD	HL,DE
	PUSH	HL
;
	LD	A,(VRAMD)
	LD	E,A
	LD	D,B
	ADD	A,13
	LD	(VRAMD),A
;
	LD	HL,VRAMD+1
	ADD	HL,DE
	LD	A,(VRAMH)
	LD	(HLI),A
	LD	A,(VRAML)
	LD	(HLI),A
	LD	A,$09
	LD	(HLI),A
;
	POP	DE
;
	PUSH	BC
;
	LD	C,10
TKB080
	LD	A,(DE)
	INC	DE
	LD	(HLI),A
	DEC	C
	JR	NZ,TKB080
;
	LD	(HL),B
	POP	BC
;
	RET



;------------------------------------------------------------------------
		END
;------------------------------------------------------------------------
