;
		onbankgroup
;
	PUBALL
;
	KANJI
	PAGE
BANK8	GROUP	8
	LIST
	ORG	$4000


;(CGB);┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
;(CGB);┃	以下のデータは、zmap.s に移動した				 ┃
;(CGB);┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
;(CGB);
;(CGB);%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
;(CGB);%	Ground BG Unit Hit data			       %
;(CGB);%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
;(CGB);=============================================
;(CGB)GBBKDT	;　ＢＧ　ｂａｎｋ　Ｎｏ．
;(CGB)XXX 	EQU	$0F
;(CGB);- - Ground --  0,1*2,3*4,5*6,7*8,9*A,B*C,D*E,F
;(CGB)	DB	$1C,$1C,$3E,$3C,$3E,$3E,$3E,$30  ;$00,$10
;(CGB)	DB	XXX,$36,$36,XXX,XXX,$34,XXX,$3E  ;$20,$30
;(CGB)	DB	$20,$20,XXX,$38,$28,$28,$32,$32  ;$40,$50
;(CGB)	DB	$20,$20,$38,$38,$28,$28,$32,$32  ;$60,$70
;(CGB)	DB	XXX,$26,XXX,$24,XXX,$1E,$2A,XXX  ;$80,$90
;(CGB)	DB	$26,$26,$2E,$2E,XXX,$2A,$2A,$2A  ;$A0,$B0
;(CGB)	DB	XXX,$24,$2E,$2E,$3A,XXX,$26,$2C  ;$C0,$D0
;(CGB)	DB	$22,$22,$22,XXX,$3A,$3A,XXX,$2C  ;$E0,$F0
;(CGB);- - Danjyon --
;(CGB)DBBKDT
;(CGB);0	EQU	$50　ボス扉　　，　　　　　，階段Ｕ　 　，ラセンＤ
;(CGB);1	EQU	$51　ダンジョン入口　　　　　　　　　 　，
;(CGB);2	EQU	$52　回転扉　　，　　　　　，　　　　 　，鍵岩
;(CGB);3	EQU	$53　ラセンＵ　，兵隊壁　　，兵隊穴　 　，ラセンＤ
;(CGB);4	EQU	$54　民家入口　，窓　　　　，値札　　 　，レジ
;(CGB);5	EQU	$55　洞窟入口　，掘った穴　，階段Ｕ　 　，剣ちらし
;(CGB);6	EQU	$56　ボス扉　　，壁穴Ｕ　　，壁穴Ｄ　　 ，鍵岩
;(CGB);7	EQU	$57　ラセンＵ　，フックショット木橋　 　，鍵岩
;(CGB);8	EQU	$58　民家入口　，机（大）　，ベット　 　，机（小）
;(CGB);9	EQU	$59　体当たり岩，　　　　　，光る床　 　，鍵岩
;(CGB);A	EQU	$5A　ボス扉　　，体岩３　　，階段Ｕ　 　，
;(CGB);B	EQU	$5B　回転扉　　，　　　　　，階段Ｕ　 　，ラセンＤ
;(CGB);C	EQU	$5C　洞窟入口　，掘った穴  ，階段Ｕ 　  ，体当たり岩２
;(CGB);D	EQU	$5D　        　，フックショット木橋　 　，体当たり岩２
;(CGB);E	EQU	$5E　ボス扉　　，　　　　　，	　　  　，ラセンＵ２
;(CGB);F	EQU	$5F　小悪魔用バンク(＋上階段)
;(CGB);17	EQU	$67  回転扉　　，	　 ，階段Ｕ     , ラセンＵ２
;(CGB);18	EQU	$68  マム－部屋用スポット  ，階段Ｕ     ,
;(CGB);1A	EQU	$6A  ボス用ＢＧ
;(CGB);その他 	     　　　　　，水晶岩　　　　　　　　 ，ベルトコンベア
;(CGB);
;(CGB);
;(CGB);FF	EQU	$F	;転送ナシ！
;(CGB);
;(CGB);;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB);Lv.1
;(CGB) DB $FF,$00,$00,$00,$FF,$01,$00,$05,$00,$09,$00,$00,$05,$05,$05,$FF ;0
;(CGB) DB $00,$00,$FF,$FF,$02,$01,$01,$01,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF ;1
;(CGB);Lv.2
;(CGB) DB $FF,$FF,$FF,$FF,$FF,$00,$FF,$00,$FF,$00,$FF,$FF,$02,$00,$FF,$0E ;2
;(CGB) DB $FF,$FF,$FF,$FF,$FF,$FF,$01,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF ;3
;(CGB);Lv.3
;(CGB);;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB) DB $02,$02,$FF,$02,$02,$09,$09,$FF,$02,$02,$09,$02,$09,$09,$09,$09 ;4
;(CGB) DB $09,$FF,$01,$01,$05,$00,$00,$00,$00,$0A,$0A,$0A,$0A,$00,$00,$00 ;5
;(CGB);Lv.4
;(CGB) DB $09,$00,$00,$09,$09,$00,$00,$09,$09,$09,$09,$00,$00,$FF,$02,$FF ;6
;(CGB) DB $09,$00,$00,$FF,$00,$00,$00,$FF,$FF,$00,$01,$05,$00,$00,$00,$00 ;7
;(CGB);Lv.5
;(CGB);;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB) DB $FF,$05,$FF,$FF,$FF,$06,$07,$07,$07,$FF,$FF,$06,$06,$FF,$FF,$FF ;8
;(CGB) DB $09,$FF,$FF,$FF,$07,$FF,$FF,$07,$FF,$07,$05,$FF,$FF,$05,$05,$05 ;9
;(CGB) DB $FF,$01,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$19,$FF,$FF,$FF ;A
;(CGB);Lv.6
;(CGB);;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB) DB $03,$0E,$03,$0E,$FF,$0E,$0E,$0E,$0E,$0E,$0E,$FF,$0E,$0E,$FF,$0E ;B
;(CGB) DB $0E,$0E,$0E,$09,$00,$0E,$09,$FF,$FF,$0E,$09,$00,$0E,$FF,$02,$0E ;C
;(CGB) DB $0E,$0E,$02,$FF,$01,$01,$01,$09,$00,$00,$00,$00,$00,$00,$00,$00 ;D
;(CGB);洞窟用部屋
;(CGB) DB $0F,$0F,$0F,$08,$00,$0C,$0C,$03,$0C,$0C,$0C,$00,$00,$00,$0C,$00 ;E
;(CGB) DB $03,$03,$00,$19,$00,$08,$0C,$03,$0C,$0C,$08,$19,$0C,$05,$0C,$00 ;F
;(CGB);;- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
;(CGB);Lv.7
;(CGB);;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB) DB $00,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$FF,$01,$FF ;0
;(CGB) DB $03,$03,$03,$FF,$03,$03,$FF,$0B,$FF,$03,$FF,$FF,$FF,$07,$07,$FF ;1
;(CGB) DB $FF,$06,$FF,$FF,$00,$FF,$FF,$FF,$FF,$0E,$0E,$FF,$FF,$0E,$0E,$00 ;2
;(CGB);
;(CGB);Lv.8
;(CGB);;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB) DB $FF,$00,$FF,$FF,$FF,$FF,$FF,$00,$FF,$17,$17,$17,$FF,$03,$FF,$FF ;3
;(CGB) DB $FF,$FF,$0A,$0A,$0A,$FF,$FF,$FF,$0A,$0A,$FF,$0B,$FF,$0D,$FF,$FF ;4
;(CGB) DB $0A,$0A,$FF,$00,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$09,$01,$00,$00 ;5
;(CGB) DB $FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$01 ;6
;(CGB);
;(CGB) DB $0C,$FF,$FF,$FF,$1A,$FF,$FF,$FF,$FF,$FF,$0C,$0C,$0C,$0C,$0C,$01 ;7
;(CGB);@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
;(CGB);;    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB) DB $0C,$0C,$0C,$0C,$0C,$0C,$0C,$0C,$0C,$0C,$0C,$0C,$05,$05,$05,$01 ;8
;(CGB) DB $05,$05,$05,$05,$05,$05,$05,$05,$05,$04,$05,$04,$04,$04,$00,$08 ;9
;(CGB) DB $04,$04,$08,$08,$00,$08,$08,$08,$08,$08,$08,$05,$05,$08,$0C,$0C ;A
;(CGB) DB $08,$04,$05,$0C,$04,$00,$05,$05,$0C,$0C,$0C,$0C,$0C,$05,$0C,$0C ;B
;(CGB) DB $0C,$0C,$03,$03,$00,$03,$FF,$08,$00,$0C,$0C,$04,$04,$0C,$0C,$0C ;C
;(CGB) DB $0C,$0C,$FF,$01,$00,$01,$01,$08,$00,$08,$08,$08,$08,$08,$0C,$0C ;D
;(CGB) DB $FF,$08,$08,$04,$0C,$0C,$0C,$0C,$00,$08,$0C,$0C,$0C,$0C,$0C,$0C ;E
;(CGB) DB $0C,$0C,$0C,$0C,$0C,$00,$0C,$0C,$00,$0C,$0C,$18,$05,$00,$08,$00 ;F
;(CGB);;		0 1 2 3 4 5 6 7 8 9 A B C D E F
;(CGB);- - Enemy character bank - - -
;(CGB)GREBDT
;(CGB);     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB) DB $65,$66,$67,$68,$69,$6D,$45,$46,$46,$00,$4E,$4E,$4E,$4E,$44,$50 ;0
;(CGB) DB $20,$74,$6B,$6C,$6D,$6D,$37,$37,$4F,$1C,$4F,$4E,$4E,$4E,$50,$4E ;1
;(CGB) DB $02,$7D,$00,$0E,$48,$47,$37,$06,$06,$00,$51,$50,$50,$62,$62,$62 ;2
;(CGB) DB $02,$7D,$00,$0E,$48,$47,$37,$06,$06,$00,$51,$51,$00,$62,$62,$62 ;3
;(CGB) DB $00,$41,$7E,$7E,$7A,$06,$28,$28,$11,$11,$64,$63,$2D,$2D,$2D,$2D ;4
;(CGB) DB $01,$2E,$74,$7F,$38,$28,$28,$29,$11,$11,$11,$64,$2D,$2D,$2D,$2D ;5
;(CGB) DB $00,$00,$7E,$00,$00,$28,$29,$05,$58,$59,$5A,$00,$2D,$2D,$2D,$2D ;6
;(CGB) DB $7E,$7E,$7E,$7E,$3A,$3A,$28,$29,$5B,$5C,$00,$12,$2D,$2D,$2D,$2D ;7
;(CGB) DB $3D,$03,$0A,$0B,$39,$61,$18,$18,$4A,$2C,$72,$00,$2A,$6F,$2D,$2D ;8
;(CGB) DB $00,$00,$43,$0A,$40,$3E,$00,$00,$75,$5F,$73,$70,$2A,$6F,$2D,$2D ;9
;(CGB) DB $13,$0C,$0A,$00,$3B,$00,$3B,$3B,$5F,$54,$37,$71,$6E,$6E,$6E,$00 ;A
;(CGB) DB $0F,$0C,$09,$09,$00,$3B,$3B,$3B,$77,$72,$70,$4B,$6E,$6E,$6E,$6E ;B
;(CGB) DB $08,$08,$07,$07,$3C,$3C,$3C,$00,$78,$23,$26,$57,$34,$35,$1D,$7B ;C
;(CGB) DB $07,$07,$07,$07,$3C,$3C,$3C,$7A,$79,$26,$1F,$53,$2F,$34,$00,$4D ;D
;(CGB) DB $07,$07,$00,$42,$00,$90,$91,$26,$26,$25,$36,$33,$31,$30,$7C,$4D ;E
;(CGB) DB $07,$07,$07,$00,$90,$90,$91,$00,$1F,$26,$1F,$00,$30,$21,$4C,$7C ;F
;(CGB);     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB);
;(CGB)DJEBDT
;(CGB);     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB);Lv.1
;(CGB) DB $01,$03,$0E,$07,$07,$00,$05,$01,$00,$03,$1C,$05,$01,$01,$01,$00 ;0
;(CGB) DB $00,$02,$00,$03,$03,$03,$03,$03,$33,$33,$33,$33,$00,$00,$63,$63 ;1
;(CGB);Lv.2
;(CGB) DB $14,$00,$14,$14,$00,$06,$13,$06,$13,$13,$0E,$08,$13,$08,$06,$07 ;2
;(CGB) DB $06,$06,$00,$00,$1B,$1B,$06,$1B,$06,$00,$33,$33,$33,$33,$33,$33 ;3
;(CGB);Lv.3
;(CGB) DB $18,$18,$18,$18,$00,$15,$00,$00,$17,$00,$17,$17,$06,$17,$06,$00 ;4
;(CGB) DB $18,$3C,$3C,$3C,$17,$17,$17,$17,$17,$0E,$16,$00,$17,$01,$33,$33 ;5
;(CGB);Lv.4
;(CGB) DB $00,$00,$0E,$31,$19,$30,$32,$32,$00,$00,$32,$32,$00,$32,$30,$30 ;6
;(CGB) DB $00,$30,$32,$00,$30,$30,$00,$30,$30,$30,$30,$30,$33,$33,$00,$01 ;7
;(CGB);Lv.5
;(CGB);     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB) DB $1E,$1E,$0F,$1E,$1E,$1D,$00,$00,$24,$24,$24,$00,$24,$24,$24,$24 ;8
;(CGB) DB $24,$00,$1E,$1F,$1F,$1E,$1E,$04,$04,$00,$00,$04,$04,$04,$04,$04 ;9
;(CGB) DB $04,$04,$33,$33,$33,$33,$33,$33,$33,$33,$64,$64,$80,$00,$00,$00 ;A
;(CGB);Lv.6
;(CGB);     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB) DB $28,$28,$28,$28,$61,$0F,$61,$00,$00,$28,$28,$00,$25,$26,$61,$29 ;B
;(CGB) DB $27,$00,$28,$61,$00,$26,$00,$29,$2A,$00,$00,$62,$00,$61,$00,$27 ;C
;(CGB) DB $61,$61,$27,$27,$27,$27,$00,$61,$63,$63,$33,$33,$33,$33,$00,$00 ;D
;(CGB);
;(CGB) DB $44,$44,$44,$00,$4A,$67,$67,$00,$7F,$00,$00,$33,$33,$00,$6E,$1A ;E
;(CGB) DB $67,$67,$00,$80,$4A,$7E,$67,$00,$7F,$7F,$3D,$80,$10,$00,$6E,$1A ;F
;(CGB);Lv.7
;(CGB);    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB) DB $00,$00,$3F,$2C,$2C,$5E,$34,$39,$00,$5F,$60,$3E,$39,$2B,$2B,$00 ;0
;(CGB) DB $39,$2D,$2D,$2D,$2D,$2D,$2D,$2E,$2D,$2D,$2D,$2E,$00,$2D,$2D,$00 ;1
;(CGB) DB $36,$00,$35,$0F,$37,$35,$35,$00,$37,$00,$38,$35,$0F,$35,$68,$01 ;2
;(CGB);Lv.8
;(CGB);    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB) DB $0F,$5C,$56,$00,$50,$5C,$00,$51,$56,$58,$5B,$5B,$00,$54,$00,$51 ;3
;(CGB) DB $5A,$00,$59,$59,$00,$57,$5A,$59,$59,$00,$5C,$5C,$52,$00,$55,$00 ;4
;(CGB) DB $5C,$5C,$00,$53,$52,$52,$00,$5B,$00,$5C,$00,$53,$52,$5B,$5A,$53 ;5
;(CGB) DB $33,$33,$33,$33,$33,$33,$33,$33,$33,$33,$33,$33,$01,$01,$01,$3D ;6
;(CGB);
;(CGB) DB $01,$01,$01,$01,$6F,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$3D ;7
;(CGB) DB $66,$66,$66,$01,$01,$66,$66,$66,$65,$65,$65,$65,$66,$66,$65,$3D ;8
;(CGB) DB $65,$65,$65,$65,$66,$66,$66,$0D,$0D,$09,$65,$09,$09,$09,$00,$49 ;9
;(CGB);- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
;(CGB);    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F
;(CGB);- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
;(CGB) DB $10,$11,$20,$2F,$01,$0A,$0A,$0B,$0C,$09,$4B,$65,$65,$4C,$65,$65 ;A
;(CGB) DB $10,$12,$0B,$65,$09,$01,$65,$65,$65,$65,$65,$65,$65,$65,$0D,$0D ;B
;(CGB) DB $00,$00,$21,$21,$21,$21,$21,$22,$66,$65,$65,$09,$09,$66,$0D,$0D ;C
;(CGB) DB $67,$67,$21,$21,$21,$21,$21,$40,$66,$41,$10,$4D,$4D,$46,$66,$66 ;D
;(CGB) DB $3A,$4E,$3A,$09,$66,$66,$65,$65,$3B,$47,$65,$65,$65,$65,$65,$65 ;E
;(CGB) DB $3A,$67,$67,$67,$66,$42,$65,$65,$3B,$67,$67,$43,$01,$45,$48,$00 ;F
;(CGB);
;(CGB)GEBANKD
;(CGB);- - 地上 - -
;(CGB);
;(CGB) DB $A4,$FF,$FF,$FF ;0
;(CGB) DB $A4,$8E,$7C,$C8 ;1   常駐+タリン,茸+モリブリン  +狸
;(CGB) DB $A4,$4A,$7C,$93 ;2   常駐+花(小)   +モリブリン  +ライクライク
;(CGB) DB $A4,$E5,$FF,$4E ;3   常駐+鶏,狐,蝶 +未定２      +釣り屋
;(CGB) DB $A4,$91,$83,$A2 ;4   常駐+スライム +豚ブリン    +梟(ﾌｸﾛｳ)
;(CGB) DB $A4,$42,$8A,$FF ;5   常駐+鴉お化けS+お化け(大)  +
;(CGB) DB $A4,$42,$83,$A2 ;6   常駐+鴉お化けS+モリブリン  +ﾌｸﾛｳ,ﾊﾟﾀｸﾘｰ
;(CGB) DB $A4,$81,$E3,$A2 ;7   常駐+ﾃｸﾀｲﾄﾘｰﾊﾞ+オクタロック+梟(ﾌｸﾛｳ)
;(CGB) DB $A4,$E5,$E3,$FF ;8   常駐+鶏,狐,蝶 +オクタロック+未定
;(CGB) DB $A4,$E5,$43,$E7 ;9   常駐+鶏,狐,蝶 +     婆     +男の子
;(CGB) DB $A4,$E5,$E6,$FF ;A   常駐+鶏,狐,蝶 +ヒロイン    +
;(CGB) DB $A4,$E5,$E6,$E7 ;B   常駐+鶏,狐,蝶 +ヒロイン    +男の子
;(CGB) DB $A4,$E5,$43,$A4 ;C   常駐+鶏,狐,蝶 +     婆     +ワンワン
;(CGB) DB $A4,$8E,$83,$A4 ;D   常駐+タリン,茸+モリブリン  +ワンワン
;(CGB) DB $A4,$4A,$83,$40 ;E   常駐+花(小)   +モリブリン  +お化け花
;(CGB) DB $A4,$E5,$4C,$E7 ;F   常駐+鶏,狐,蝶 +鳩          +男の子
;(CGB) DB $A4,$4D,$83,$FF ;10  常駐+妖精     +モリブリン  +未定
;(CGB) DB $A4,$42,$92,$5A ;11  常駐+鴉(ｶﾗｽ)  +兵士        +モグラ
;(CGB) DB $A4,$61,$92,$67 ;12  常駐+ゾーラ　 +兵士        +さる｡
;(CGB) DB $A4,$E5,$FF,$FF ;13  常駐+鶏,狐,蝶 +            +
;(CGB) DB $A4,$E3,$8B,$FF ;14  常駐+羽オクタ +穴長虫      +
;(CGB) DB $A4,$E3,$83,$76 ;15  常駐+羽オクタ +モリブリン  +シゲミン,パタクリ
;(CGB) DB $A4,$81,$79,$76 ;16  常駐+ﾃｸﾀｲﾄﾘｰﾊﾞ+ニョロニョロ+シゲミン,パタクリ
;(CGB) DB $A4,$61,$8B,$FF ;17  常駐+ゾーラ   +穴長虫      +
;(CGB) DB $A4,$6C,$8B,$6B ;18  常駐+タリン　 +穴長虫      +蜂の巣
;(CGB) DB $A4,$FF,$8B,$FF ;19  常駐+	　     +穴長虫      +
;(CGB) DB $A4,$E3,$8B,$A2 ;1A  常駐+羽オクタ +穴長虫      +フクロウ
;(CGB) DB $A4,$E5,$FF,$FF ;1B  常駐+チョウ   +            +
;(CGB) DB $A4,$4A,$8F,$6D ;1C  常駐+ピラニア +マリン      +パパール
;(CGB) DB $A4,$81,$6E,$52 ;1D  常駐+リーバ   +トド        +ラネモーラ
;(CGB) DB $A4,$4D,$43,$A2 ;1E  常駐+妖精     +ヤッホーな婆+フクロウ
;(CGB) DB $A4,$61,$79,$76 ;1F  常駐+ゾーラ   +ニョロニョロ+シゲミン,パタクリ
;(CGB) DB $A4,$C6,$7C,$41 ;20  常駐+カラス　 +モリブリン　+亀頭
;(CGB) DB $A4,$C5,$6E,$6F ;21  常駐+         +トド
;(CGB) DB $A4,$C5,$FF,$70 ;22  常駐+         +            +トド(イベント後)
;(CGB) DB $A4,$61,$FF,$71 ;23  常駐+ゾーラ   +	    +人魚
;(CGB) DB $A4,$61,$FF,$72 ;24  常駐+ゾーラ   +            +人魚(イベント後)
;(CGB) DB $A4,$61,$79,$73 ;25  常駐+ゾーラ   +ニョロニョロ+人魚像
;(CGB) DB $A4,$61,$79,$FF ;26  常駐+ゾーラ   +ニョロニョロ
;(CGB) DB $A4,$E3,$79,$76 ;27  常駐+羽オクタ +ニョロニョロ+シゲミン,パタクリ
;(CGB) DB $A4,$42,$82,$A2 ;28  常駐+鴉お化けS+墓,ゾンビ   +フクロウ
;(CGB) DB $A4,$42,$FF,$FF ;29  常駐+鴉お化けS+	    +
;(CGB) DB $A4,$61,$78,$A2 ;2A  常駐+ゾーラ   +アモス　　  +フクロウ
;(CGB) DB $A4,$81,$8F,$E7 ;2B  常駐+うに蟹   +ヒロイン    +男の子
;(CGB) DB $A4,$E3,$8B,$8C ;2C  常駐+羽オクタ +穴長虫      +沸き出し虫
;(CGB) DB $A4,$87,$78,$A2 ;2D  常駐+ﾃｸﾀ,ｲｶﾀﾞ +アモス(小)  +フクロウ
;(CGB) DB $A4,$6C,$7C,$C8 ;2E  常駐+タリン   +モリブリン  +狸
;(CGB) DB $A4,$C4,$E6,$CF ;2F  常駐+兎,蝶    +歌うマリン２+南国鳥,プーさん
;(CGB) DB $A4,$FF,$6E,$6F ;30  マリン＆トドつなぎ
;(CGB) DB $A4,$FF,$E6,$CF ;31  マリン＆トドつなぎ２
;(CGB) DB $A4,$FF,$83,$FF ;32  妖精＆タリンつなぎ
;(CGB) DB $A4,$C4,$79,$76 ;33  常駐+兎,蝶    +にょろ	    +パタクリ
;(CGB) DB $A4,$C4,$FF,$FF ;34  常駐+兎,蝶    +      　    +
;(CGB) DB $A4,$C4,$43,$CF ;35  常駐+兎,蝶    +ばばあﾔｯﾎｰ　+南国鳥,プーさん
;(CGB) DB $A4,$FF,$79,$FF ;36  常駐+         +にょろ　    +
;(CGB) DB $A4,$FF,$FF,$A2 ;37  常駐+         +      　    +ふくろう
;(CGB) DB $A4,$61,$79,$A2 ;38  常駐+ゾーラ   +ニョロニョロ+ふくろう
;(CGB) DB $A4,$E5,$FF,$FF ;39  常駐+ニワトリ +	　  +
;(CGB) DB $A4,$E5,$82,$A2 ;3A  常駐+ニワトリ +ゾンビー    +ふくろう
;(CGB) DB $A4,$E3,$83,$A2 ;3B  常駐+羽オクタ +モリブリン  +ふくろう
;(CGB) DB $A4,$91,$83,$76 ;3C  常駐+スライム +モリブリン  +シゲミン
;(CGB) DB $A4,$FF,$7C,$A2 ;3D  常駐+         +モリブリン  +ふくろう      　    +
;(CGB) DB $A4,$E3,$8B,$A2 ;3E  常駐+羽オクタ +穴長虫　    +ふくろう
;(CGB) DB $A4,$E3,$FF,$76 ;3F  メーベの村(マリン)とその周辺の敵とのつなぎ１
;(CGB) DB $A4,$FF,$E6,$A2 ;40  メーベの村(マリン)とその周辺の敵とのつなぎ２
;(CGB) DB $A4,$FF,$7C,$A2 ;41  タヌキタリン(変身後)と地上スライムとのつなぎ
;(CGB) DB $A4,$81,$E3,$D4 ;42  常駐+カニ　　 +オクタロック+バナナ
;(CGB) DB $A4,$E5,$E6,$DC ;43  常駐+ニワトリ +歌うマリン  +必殺！回転風見鳥
;(CGB) DB $A4,$87,$D6,$D7 ;44  　　テクタイト+塔回転用
;(CGB) DB $A4,$50,$51,$A2 ;45      +楽器Ａ   +楽器Ｂ　    +フクロウ,パタクリ
;(CGB) DB $A4,$6C,$8F,$A2 ;46      +タリン   +マリン　    +フクロウ,パタクリ
;(CGB) DB $A4,$4A,$83,$A2 ;47      +花小ﾋﾟﾗﾆｱ+モリブリン  +フクロウ,パタクリ
;(CGB) DB $A4,$4A,$83,$FF ;48      +花小ﾋﾟﾗﾆｱ+モリブリン  +
;(CGB) DB $A4,$81,$8F,$76 ;49      +ﾘｰﾊﾞ,ｶﾆ  +マリン　    +フクロウ,パタクリ
;(CGB) DB $A4,$E3,$8B,$FF ;4A      +羽オクタ +穴長虫
;(CGB) DB $A4,$FF,$79,$FF ;4B      +         +ニョロニョロ
;(CGB) DB $A4,$81,$6E,$FF ;4C      +リーバ　 +トド  　    +
;(CGB) DB $A4,$81,$6E,$8C ;4D      +リーバ   +トド  　    +フクローサンボ
;(CGB) DB $A4,$87,$8F,$76 ;4E      +ﾃｸﾀｲﾄ    +ﾏﾘﾝ   　    +ﾊﾟﾀｸﾘ,ｼｹﾞﾐﾝ
;(CGB) DB $A4,$FF,$8F,$FF ;4F      +         +まりん  　　+
;(CGB) DB $A4,$87,$FF,$FF ;50      +ﾃｸﾀｲﾄ    +      　    +
;(CGB) DB $A4,$87,$83,$76 ;51      +ﾃｸﾀｲﾄ    +ブタブリン  +ﾊﾟﾀｸﾘ,ｼｹﾞﾐﾝ
;(CGB) DB $A4,$87,$83,$98 ;52      +ﾃｸﾀｲﾄ    +ブタブリン  +速虫
;(CGB) DB $A4,$FF,$79,$76 ;53      +         +ニョロニョロ+パタシゲミン
;(CGB) DB $A4,$E3,$83,$A2 ;54      +羽オクタ +ﾌﾞﾀブリン   +パタフクロー
;(CGB) DB $A4,$61,$79,$93 ;55      +ゾーラ   +ニョロニョロ+ライクライク
;(CGB) DB $A4,$FF,$79,$93 ;56      +         +ニョロニョロ+ライクライク
;(CGB) DB $A4,$C4,$79,$FF ;57      +蝶       +ニョロ　    +
;(CGB) DB $A4,$FF,$92,$5A ;58      +         +兵士  　    +モグラ
;(CGB) DB $A4,$61,$92,$8C ;59      +ゾーラ   +兵士  　    +湧き出し
;(CGB) DB $A4,$42,$92,$FF ;5A      +カラス   +兵士  　    +
;(CGB) DB $A4,$61,$FF,$FF ;5B      +ゾーラ   +      　    +
;(CGB) DB $A4,$61,$FF,$8C ;5C      +ゾーラ   +      　    +湧き出し
;(CGB) DB $A4,$FF,$83,$93 ;5D      +         +モリブリン２+ﾗｲｸﾗｲｸ
;(CGB) DB $A4,$61,$8B,$FF ;5E      +ゾーラ   +穴長虫	    +
;(CGB) DB $A4,$E3,$FF,$FF ;5F      +羽オクタ +      　    +
;(CGB) DB $A4,$61,$FF,$67 ;60      +ゾーラ   +      　    +猿
;(CGB) DB $A4,$FF,$FF,$A2 ;61      +         +      　    +ふくろう
;(CGB) DB $A4,$87,$E3,$93 ;62      +ﾃｸﾀ,ｲｶﾀﾞ +オクタロック+ライクライク
;(CGB) DB $A4,$87,$FF,$FF ;63      +テクタ   +      　    +
;(CGB) DB $A4,$87,$92,$5A ;64      +テクタ   +兵士  　    +モグラ
;(CGB) DB $A4,$C6,$9C,$98 ;65      +カラス   +ガイコツ兵  +速虫
;(CGB) DB $A4,$C6,$9C,$FF ;66      +カラス   +ガイコツ兵  +
;(CGB) DB $A4,$FF,$9C,$93 ;67      +         +ガイコツ兵  +ライクライク
;(CGB) DB $A4,$81,$FF,$FF ;68      +リーバ　 +      　    +
;(CGB) DB $A4,$FF,$9C,$98 ;69      +         +ガイコツ兵  +速虫
;(CGB) DB $A4,$FF,$83,$FF ;6A      +         +モリブリン  +
;(CGB) DB $A4,$81,$FF,$93 ;6B      +リーバ   +      　    +ライクライク
;(CGB) DB $A4,$81,$9C,$93 ;6C      +リーバ 　+ガイコツ兵  +盾喰う虫も好々
;(CGB) DB $A4,$44,$9C,$98 ;6D      +岩ごろ   +ガイコツ兵  +速虫
;(CGB) DB $A4,$91,$78,$A2 ;6E      +スライム +あもす   　 +ふくろー＆ﾊﾟﾀｸﾘ
;(CGB) DB $A4,$FF,$78,$A2 ;6F      +         +あもす 　　 +ふくろー＆ﾊﾟﾀｸﾘ
;(CGB) DB $A4,$61,$FF,$A2 ;70      +ぞーら   +      　    +ふくろー＆ﾊﾟﾀｸﾘ
;(CGB) DB $A4,$FF,$79,$A2 ;71      +	       +ニョロにょろ+ふくろー＆ﾊﾟﾀｸﾘ
;(CGB) DB $A4,$61,$83,$FF ;72      +ゾーラ   +豚ブーブー　+
;(CGB) DB $A4,$FF,$83,$A2 ;73      +         +ブタブリン　+ﾊﾟﾀｸﾘﾎﾞｰ&ﾌｸﾛｳ
;(CGB) DB $A4,$FF,$7C,$FF ;74      +	       +モリブリン
;(CGB) DB $A4,$E3,$8B,$A2 ;75      +羽根オクﾀ+穴	    +ﾊﾟﾀｸﾘﾎﾞｰ&ﾌｸﾛｳ
;(CGB) DB $A4,$E3,$83,$FF ;76      +羽根オクﾀ+豚ブリン
;(CGB) DB $A4,$FF,$83,$76 ;77      +         +ブタプリン  +パタクリ,シゲミン
;(CGB) DB $A4,$61,$83,$FF ;78      +ゾーラ 　+豚ブリン
;(CGB) DB $A4,$61,$FF,$76 ;79      +ゾーラ   +      　    +パタクリ,シゲミン
;(CGB) DB $A4,$61,$FF,$A2 ;7A  常駐+ゾーラ   +	    +ふくろう
;(CGB) DB $A4,$81,$6E,$FF ;7B  ラネモーラつなぎ
;(CGB) DB $A4,$81,$FF,$8C ;7C      +リーバ   +      　    +サンボ＋梟
;(CGB) DB $A4,$4A,$7C,$93 ;7D      +花小ﾋﾟﾗﾆｱ+モリブリン  +盾喰う虫も好々
;(CGB) DB $A4,$91,$7C,$A2 ;7E      +スライム +モリﾌﾞﾘﾝ 　 +梟
;(CGB) DB $A4,$4D,$7C,$FF ;7F      +妖精     +もりぶりん　+
;(CGB) DB $A4,$FF,$FF,$FF ;80
;(CGB) DB $A4,$FF,$FF,$FF ;81
;(CGB) DB $A4,$FF,$FF,$FF ;82
;(CGB) DB $A4,$FF,$FF,$FF ;83
;(CGB) DB $A4,$FF,$FF,$FF ;84
;(CGB) DB $A4,$FF,$FF,$FF ;85
;(CGB) DB $A4,$FF,$FF,$FF ;86
;(CGB) DB $A4,$FF,$FF,$FF ;87
;(CGB) DB $A4,$FF,$FF,$FF ;88
;(CGB) DB $A4,$FF,$FF,$FF ;89
;(CGB) DB $A4,$FF,$FF,$FF ;8A
;(CGB) DB $A4,$FF,$FF,$FF ;8B
;(CGB) DB $A4,$FF,$FF,$FF ;8C
;(CGB) DB $A4,$FF,$FF,$FF ;8D
;(CGB) DB $A4,$FF,$FF,$FF ;8E
;(CGB) DB $A4,$FF,$FF,$FF ;8F
;(CGB) DB $A4,$81,$8F,$D4 ;90      +ﾘｰﾊﾞ,ｶﾆ  +マリン　    +椰子ザル
;(CGB) DB $A4,$81,$79,$FF ;91  常駐+ﾘｰﾊﾞ,ｶﾆ  +ニョロニョロ
;(CGB);
;(CGB);- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
;(CGB)DEBANKD
;(CGB);- - ダンジョン - -
;(CGB) DB $FF,$FF,$FF,$FF ;0
;(CGB) DB $90,$91,$92,$98 ;1  常駐(Ｄ用)+常駐２  +兵士      +速虫
;(CGB) DB $90,$91,$AB,$FF ;2  常駐(Ｄ用)+常駐２  +兵士      +オバＱ
;(CGB) DB $90,$91,$92,$93 ;3  常駐(Ｄ用)+常駐２  +兵士      +モトス
;(CGB) DB $90,$91,$94,$9F ;4  常駐(Ｄ用)+常駐２  +兜 　     +兜(仮面)
;(CGB) DB $90,$91,$B0,$B1 ;5  速虫(大)
;(CGB) DB $90,$91,$9C,$93 ;6  常駐(Ｄ用)+常駐２  +ガイコツ兵+ポルスマミー
;(CGB) DB $90,$91,$97,$9B ;7  常駐(Ｄ用)+常駐２  +テレサ    +猪野獅子
;(CGB) DB $FF,$FF,$B6,$B7 ;8  壷大魔王
;(CGB) DB $A4,$4C,$49,$46 ;9  常駐      +電話    +薬局 　　 +うるりら爺
;(CGB) DB $A4,$FF,$45,$6D ;A  常駐      +        +サザエ　　+パパール
;(CGB) DB $A4,$FF,$47,$48 ;B  常駐      +        +ワンワン女+お座敷ワンワン
;(CGB) DB $A4,$FF,$4C,$4B ;C  常駐      +        +伝書鳩    +Ｄｒ．ライト
;(CGB) DB $90,$91,$96,$FF ;D  常駐      +常駐２  +マネマネ  +
;(CGB) DB $FF,$FF,$4F,$50 ;E            +        +ピカピカ  +楽器１
;(CGB) DB $FF,$FF,$4F,$51 ;F            +        +ピカピカ  +楽器２
;(CGB) DB $A4,$87,$84,$89 ;10 クレーンゲーム
;(CGB) DB $A4,$FF,$88,$C7 ;11 常駐      +        +商人　　  +
;(CGB) DB $A0,$A1,$84,$83 ;12 釣り堀
;(CGB) DB $90,$91,$54,$A6 ;13 常駐(Ｄ用)+常駐２  +ひのっくす+Ｌｖ．３用引力君
;(CGB) DB $90,$91,$97,$93 ;14 常駐(Ｄ用)+常駐２  +テレサ　　+モトス
;(CGB) DB $90,$91,$AA,$FF ;15 常駐(Ｄ用)+常駐２  +未定      +ドドンゴ
;(CGB) DB $90,$91,$B4,$B5 ;16 巨大スライム
;(CGB) DB $90,$91,$9C,$9E ;17 常駐(Ｄ用)+常駐２  +ガイコツ兵+忍者鳥
;(CGB) DB $90,$91,$9C,$9D ;18 常駐(Ｄ用)+常駐２  +ガイコツ兵+爆弾兵
;(CGB) DB $68,$91,$56,$60 ;19 引っ張りＳ+常駐２  +水中ボス  +ｱﾒﾝﾎﾞ,ﾊﾞﾚﾘ-ﾅ
;(CGB) DB $AC,$AD,$AE,$AF ;1A 巨大魚
;(CGB) DB $90,$91,$58,$9B ;1B 常駐(Ｄ用)+常駐２  +ヘイホ－　+猪野獅子
;(CGB) DB $90,$91,$A6,$59 ;1C 常駐(Ｄ用)+常駐２  +引っ張りＳ+トランプ
;(CGB) DB $FF,$FF,$B8,$B9 ;1D 釣り長虫
;(CGB) DB $90,$91,$62,$63 ;1E 常駐(Ｄ用)+常駐２  +骸骨大
;(CGB) DB $90,$91,$A8,$9F ;1F 常駐(Ｄ用)+常駐２  +ゴーマ    +
;(CGB) DB $A4,$DF,$A3,$FF ;20 常駐      +マウス  +粉ババア  +
;(CGB) DB $90,$91,$92,$9A ;21 常駐(Ｄ用)+常駐２  +兵士      +鉄球兵
;(CGB) DB $A4,$5B,$5C,$FF ;22 常駐      +ﾘﾁｬｰﾄﾞ  +かへる君  +
;(CGB) DB $A6,$91,$97,$9B ;23 引力君    +常駐２  +テレサ    +猪野獅子
;(CGB) DB $90,$91,$9C,$60 ;24 常駐(Ｄ用)+常駐２  +がいこつ兵+ｱﾒﾝﾎﾞ,ﾊﾞﾚﾘ-ﾅ
;(CGB) DB $FF,$FF,$B2,$B3 ;25 顔ボス
;(CGB) DB $A6,$91,$57,$FF ;26 顔長像    +常駐２  +Ｏちゃん  +
;(CGB) DB $A6,$91,$95,$98 ;27 顔長像    +常駐２  +魔法使い  +速虫
;(CGB) DB $A6,$91,$5E,$60 ;28 顔長像    +常駐２  +サイコロ  +ｱﾒﾝﾎﾞ,ﾊﾞﾚﾘ-ﾅ
;(CGB) DB $A6,$91,$AA,$93 ;29 顔長像    +常駐２  +ドドンゴ  +ポルスマミー
;(CGB) DB $A6,$91,$58,$99 ;2A 顔長像    +常駐２  +ヘイホ－　+回転砲台
;(CGB) DB $90,$91,$95,$93 ;2B 常駐(Ｄ用)+トラップ+魔法使い  +ミイラ
;(CGB) DB $5F,$91,$55,$99 ;2C ｸﾘﾎﾞｰ,ﾛｰﾌﾞ,ﾋﾟｰﾊｯﾄ  +トラップ  +ｶｰﾋﾞｰ     +回転砲台
;(CGB) DB $66,$91,$5E,$59 ;2D 柱,鉄玉   +ﾊﾞﾌﾞﾙ,水晶         +サイコロ  +トランプ
;(CGB) DB $66,$91,$54,$59 ;2E 柱,鉄玉   +ﾊﾞﾌﾞﾙ,水晶         +ヒノックス+トランプ
;(CGB) DB $8D,$8E,$8F,$6A ;2F リンク寝る+タリン	      +マリン    +バナナ
;(CGB) DB $68,$91,$9B,$60 ;30 ｸﾘﾎﾞｰ,ﾛｰﾌﾞ,ﾋﾟｰﾊｯﾄ  +常駐２    +猪野獅子  +ｱﾒﾝﾎﾞ,ﾊﾞﾚﾘ-ﾅ
;(CGB) DB $68,$91,$94,$9F ;31 引っ張りＳ+常駐２  +兜        +兜(仮面)
;(CGB) DB $68,$91,$9C,$60 ;32 引っ張りＳ+常駐２  +ガイコツ兵+ｱﾒﾝﾎﾞ,ﾊﾞﾚﾘ-ﾅ
;(CGB) DB $5F,$65,$5D,$64 ;33 ｸﾘﾎﾞｰ,ﾛｰﾌﾞ,ﾋﾟｰﾊｯﾄ  +リフト    +ゲッソー  +パックン
;(CGB) DB $FF,$91,$55,$FF ;34 	  +常駐２  +カービー  +
;(CGB) DB $5F,$91,$95,$99 ;35 ｸﾘﾎﾞｰ,ﾛｰﾌﾞ,ﾋﾟｰﾊｯﾄ  +常駐２    +魔法使い  +回転砲台
;(CGB) DB $5F,$91,$5E,$99 ;36 ｸﾘﾎﾞｰ,ﾛｰﾌﾞ,ﾋﾟｰﾊｯﾄ  +常駐２    +サイコロ  +回転砲台
;(CGB) DB $5F,$91,$A9,$FF ;37 ｸﾘﾎﾞｰ,ﾛｰﾌﾞ,ﾋﾟｰﾊｯﾄ  +常駐２    +中ボス
;(CGB) DB $5F,$91,$94,$9F ;38 ｸﾘﾎﾞｰ,ﾛｰﾌﾞ,ﾋﾟｰﾊｯﾄ  +常駐２    +兜        +兜(仮面)
;(CGB) DB $90,$91,$55,$93 ;39 常駐(Ｄ用)+常駐２  +カービー  +ライクライク
;(CGB) DB $A4,$FF,$7C,$FF ;3A ワンワン  +        +モリブリン+
;(CGB) DB $BC,$BD,$BE,$BF ;3B 鳥ボス１  +   ２   +    ３    +    ４
;(CGB) DB $A6,$91,$9C,$9D ;3C 反発(引力)+スライム+骸骨剣兵士+ボム兵
;(CGB) DB $FF,$D5,$78,$53 ;3D           +石板    +アモス    +アモス(大)
;(CGB) DB $90,$91,$FF,$FF ;3E 常駐(Ｄ用)+スライム+          +
;(CGB) DB $5F,$91,$55,$98 ;3F ピーハット+スライム+カービー  +早虫
;(CGB) DB $A4,$FF,$FF,$69 ;40 常駐      +        +          +熊
;(CGB) DB $A4,$FF,$4C,$74 ;41 常駐      +        +ハト      +ヤギ,ハイビスカス
;(CGB) DB $A0,$A1,$75,$4E ;42 魚達      +ルアー竿+釣親父下着+釣り屋
;(CGB) DB $A4,$7D,$7E,$7F ;43 常駐      +合唱団  +マムー
;(CGB) DB $A4,$FF,$FF,$C7 ;44 常駐      +        +      　  +小悪魔
;(CGB) DB $C0,$C1,$C2,$C3 ;45 マンボでウッ！
;(CGB) DB $A4,$CC,$CD,$CE ;46 常駐      +わに絵かき     　  +
;(CGB) DB $A4,$C9,$CA,$CB ;47 常駐      +剣２もらう部屋
;(CGB) DB $A4,$D1,$D2,$6A ;48 常駐	  +バナナワニ
;(CGB) DB $DD,$E5,$D3,$DD ;49 常駐      +ニワトリ+ルイージ  +スーパーニワトリ
;(CGB) DB $DD,$FF,$DE,$FF ;4A スーパーニワトリ+ニワトリ+とりがら
;(CGB) DB $A4,$8D,$FF,$FF ;4B 常駐 	  +リンク寝る
;(CGB) DB $FF,$DF,$49,$FF ;4C 仮Ａ(ﾄﾚｰｼｰ&ﾏｳｽ)
;(CGB) DB $FF,$C4,$FF,$FF ;4D 仮Ｂ(ｳｻｷﾞ)
;(CGB) DB $A4,$80,$7C,$A5 ;4E 常駐      +M BOSS1 + M BURIN  +M BOSS1
;(CGB) DB $FF,$FF,$FF,$FF ;4F           +        +      　  +
;(CGB);
;(CGB) DB $FF,$FF,$BA,$BB ;50           +        +火の玉ボス
;(CGB) DB $77,$91,$A7,$FF ;51 床ﾐｲﾗｶﾞｲｺﾂ+        +僕ボクサー
;(CGB) DB $7B,$91,$7A,$AB ;52 引力玉,床 +        +赤アリーマ+Ｑちゃん
;(CGB) DB $7B,$91,$57,$99 ;53 引力玉,床 +        +Ｏちゃん  +回転砲台
;(CGB) DB $77,$91,$7A,$AA ;54 引力玉,床 +        +赤アリーマ+ドドン号 
;(CGB) DB $7B,$91,$54,$99 ;55 床ﾐｲﾗｶﾞｲｺﾂ+        +ヒノックス+回転砲台
;(CGB) DB $7B,$91,$56,$FF ;56 床ﾐｲﾗｶﾞｲｺﾂ+        +水スマシ  +
;(CGB) DB $77,$91,$54,$99 ;57 床ﾐｲﾗｶﾞｲｺﾂ+        +ヒノックス+回転砲台
;(CGB) DB $7B,$91,$FF,$FF ;58 ボス用つなぎ(Ｌｖ．８)
;(CGB) DB $5F,$91,$9D,$99 ;59 ピーハット+        +爆弾兵    +回転砲台
;(CGB) DB $7B,$91,$96,$99 ;5A 引力玉,床 +        +マネマネ  +回転砲台
;(CGB) DB $7B,$91,$7A,$99 ;5B 引力玉,床 +        +赤アリーマ+回転砲台
;(CGB) DB $77,$91,$7A,$99 ;5C 床ﾐｲﾗｶﾞｲｺﾂ+        +赤アリーマ+回転砲台
;(CGB) DB $77,$91,$96,$99 ;5D 床ﾐｲﾗｶﾞｲｺﾂ+        +マネマネ  +回転砲台
;(CGB) DB $5F,$91,$55,$93 ;5E くり坊	  +すらいむ+カービー  +ミイラ
;(CGB) DB $FF,$91,$95,$93 ;5F 	  +すらイム+魔法使い  +ミイラ
;(CGB) DB $90,$91,$55,$93 ;60 Ｌｖ．７つなぎ
;(CGB) DB $A6,$91,$95,$60 ;61 常駐１    +常駐２  +魔法使い  +ｱﾒﾝﾎﾞ,ﾊﾞﾚﾘ-ﾅ
;(CGB) DB $A6,$91,$95,$99 ;62 常駐１    +常駐２  +魔法使い  +回転砲台
;(CGB) DB $5F,$D9,$DA,$DB ;63 栗ＢＯ　  +じゃま岩+デカバブル+一つ目どすん
;(CGB) DB $5F,$D9,$DA,$64 ;64 栗ＢＯ 　 +じゃま岩+デカバブル+パックン
;(CGB) DB $FF,$91,$90,$76 ;65 	  +常駐(Ｄ)+ｺｰﾓﾘ,ﾓﾄｽ他+岩持ち君
;(CGB) DB $FF,$91,$90,$98 ;66		  +常駐(Ｄ)+ｺｰﾓﾘ,ﾓﾄｽ他+速虫
;(CGB) DB $FF,$4A,$90,$76 ;67		  +ピラニア+ｺｰﾓﾘ,ﾓﾄｽ他+岩持ち君
;(CGB) DB $5F,$FF,$FF,$FF ;68 栗ＢＯ  　+
;(CGB) DB $FF,$FF,$FF,$FF ;69
;(CGB) DB $FF,$FF,$FF,$FF ;6A
;(CGB) DB $FF,$FF,$FF,$FF ;6B
;(CGB) DB $FF,$FF,$FF,$FF ;6C
;(CGB) DB $FF,$91,$90,$A6 ;6D         +スライム+ｺｰﾓﾘ,ﾓﾄｽ他+床ペラ
;(CGB) DB $A4,$FF,$FF,$F4 ;6E		火炎放射器(HODAI)
;(CGB) DB $E8,$E9,$EA,$EB ;6F		ラスト大ボス(顔長い)
;(CGB) DB $FF,$FF,$FF,$FF ;70
;(CGB) DB $FF,$FF,$FF,$FF ;71
;(CGB) DB $FF,$FF,$FF,$FF ;72
;(CGB) DB $FF,$FF,$FF,$FF ;73
;(CGB) DB $FF,$FF,$FF,$FF ;74
;(CGB) DB $FF,$FF,$FF,$FF ;75
;(CGB) DB $FF,$FF,$FF,$FF ;76
;(CGB) DB $FF,$FF,$FF,$FF ;77
;(CGB) DB $FF,$FF,$FF,$FF ;78
;(CGB) DB $FF,$FF,$FF,$FF ;79
;(CGB) DB $FF,$FF,$FF,$FF ;7A
;(CGB) DB $FF,$FF,$FF,$FF ;7B
;(CGB) DB $FF,$FF,$FF,$FF ;7C
;(CGB) DB $FF,$FF,$FF,$FF ;7D
;(CGB) DB $A4,$FF,$86,$FF ;7E	ブーメランおっさん
;(CGB) DB $A4,$FF,$8B,$FF ;7F      +	  +穴長虫
;(CGB) DB $A4,$4D,$FF,$FF ;80  常駐+妖精
;(CGB);
;(CGB)BGUNCH
;(CGB);- - Thru BG - -
;(CGB)	DB	$7C,$7C,$7C,$7C	;BETA0
;(CGB)	DB	$7D,$7D,$7D,$7D	;BETA1
;(CGB)	DB	$7E,$7E,$7E,$7E	;BETA2
;(CGB)	DB	$76,$76,$76,$76	;NUKI0
;(CGB)	DB	$5A,$7F,$7F,$5A	;KUSA0
;(CGB)	DB	$7C,$7C,$7C,$00	;MEGG0
;(CGB)	DB	$7C,$7C,$01,$02 ;MEGG1
;(CGB)	DB	$7C,$7C,$03,$7C ;MEGG2
;(CGB)	DB	$0C,$0D,$1C,$1D ;SUNA0
;(CGB)	DB	$72,$73,$73,$72 ;STON2
;(CGB)	DB	$75,$75,$75,$75 ;KUSA2
;(CGB)	DB	$74,$74,$74,$74 ;HANA0
;(CGB)	DB	$0F,$0F,$0F,$0F ;TURO0
;(CGB)	DB	$0E,$0E,$0E,$0E ;TURO1
;(CGB)	DB	$6D,$6D,$6D,$6D ;MIZU0 Deep
;(CGB)	DB	$5A,$7F,$04,$04 ;MGW00
;(CGB)	DB	$14,$14,$7F,$5A ;MGW01
;(CGB)	DB	$5A,$15,$7F,$15 ;MGW02
;(CGB)	DB	$05,$7F,$05,$5A ;MGW03
;(CGB)	DB	$5A,$7F,$7F,$17 ;MGW04
;(CGB)	DB	$5A,$7F,$06,$5A ;MGW05
;(CGB)	DB	$5A,$07,$7F,$5A ;MGW06
;(CGB)	DB	$16,$7F,$7F,$5A ;MGW07
;(CGB)	DB	$5A,$15,$04,$18 ;MGW08
;(CGB)	DB	$05,$7F,$19,$04 ;MGW09
;(CGB)	DB	$14,$08,$7F,$15 ;MGW0A
;(CGB)	DB	$09,$14,$05,$5A ;MGW0B
;(CGB);
;(CGB)	DB	$6C,$6C,$6C,$6C ;AMIZU shalow
;(CGB)	DB	$7F,$7F,$7F,$7F ;NUKI1
;(CGB)	DB	$7D,$7D,$16,$5C ;YGAK2
;(CGB)	DB	$6C,$6D,$6E,$6F ;SEA00
;(CGB)	DB	$6E,$6F,$6E,$6F ;SEA01
;(CGB)	DB	$F0,$F2,$F1,$F3 ;IWA00
;(CGB);- - Hit BG - -
;(CGB)	DB	$0E,$01,$10,$11 ;JWOD0
;(CGB)	DB	$4A,$4B,$5A,$5B ;SBTN0
;(CGB)	DB	$0E,$0F,$1E,$1F ;GOMI0
;(CGB)	DB	$0A,$0B,$1A,$1B ;KAIG0
;(CGB);
;(CGB)	DB	$20,$21,$30,$31 ;Big wood uper
;(CGB)	DB	$22,$23,$32,$33 ;
;(CGB)	DB	$24,$25,$34,$35 ;Big wood lower
;(CGB)	DB	$26,$27,$36,$37 ;
;(CGB)	DB	$28,$21,$30,$31 ;Big wood uper2
;(CGB)	DB	$22,$29,$32,$33 ;
;(CGB);
;(CGB)	DB	$4C,$4A,$48,$5C ;GAK00
;(CGB)	DB	$4A,$4A,$45,$45 ;GAK01
;(CGB)	DB	$4A,$4D,$5D,$59 ;GAK02
;(CGB)	DB	$48,$51,$44,$56 ;GAK03
;(CGB)	DB	$45,$45,$55,$56 ;GAK04
;(CGB)	DB	$0C,$0D,$1C,$1D ;HASU0
;(CGB)	DB	$4E,$49,$45,$52 ;GAK06
;(CGB)	DB	$49,$4F,$51,$45 ;GAK07
;(CGB)	DB	$48,$51,$54,$56 ;GAK08
;(CGB)	DB	$52,$59,$55,$57 ;GAK09
;(CGB)	DB	$45,$2A,$55,$3A ;GAK0A
;(CGB)	DB	$2B,$45,$3B,$56 ;GAK0B
;(CGB)	DB	$48,$49,$48,$49 ;GAK10
;(CGB)	DB	$49,$59,$49,$59 ;GAK12
;(CGB)	DB	$44,$56,$54,$56 ;GAK13
;(CGB)	DB	$55,$56,$55,$56 ;GAK14
;(CGB)	DB	$55,$47,$55,$57 ;GAK15
;(CGB)	DB	$45,$41,$43,$49 ;GAK16
;(CGB)	DB	$42,$45,$49,$40 ;GAK17
;(CGB)	DB	$44,$56,$44,$56 ;GAK18
;(CGB)	DB	$55,$47,$55,$47 ;GAK19
;(CGB)	DB	$09,$7C,$16,$0D ;YKN00
;(CGB)	DB	$7C,$7C,$1D,$1E ;YKN01
;(CGB)	DB	$7C,$19,$1F,$18 ;YKN02
;(CGB)	DB	$74,$74,$56,$56 ;GAKHD
;(CGB)	DB	$6E,$5A,$5A,$6F ;HKUSA
;(CGB)	DB	$50,$53,$46,$58 ;TELKN
;(CGB)	DB	$43,$49,$48,$49 ;GAK29
;(CGB)	DB	$49,$40,$49,$59 ;GAK2A
;(CGB)	DB	$45,$2A,$55,$56 ;GAK2B
;(CGB)	DB	$2B,$45,$55,$56 ;GAK2C
;(CGB)	DB	$7F,$7F,$56,$56 ;GAK2D
;(CGB)	DB	$48,$49,$45,$52 ;GAK2E
;(CGB)	DB	$49,$59,$51,$45 ;GAK2F
;(CGB)	DB	$7C,$7C,$45,$45 ;GAK30
;(CGB)	DB	$52,$59,$55,$47 ;GAK31
;(CGB)	DB	$02,$1E,$12,$13 ;JWOD1
;(CGB)	DB	$7D,$7D,$45,$45 ;YGAK3
;(CGB)	DB	$0A,$0B,$1A,$1B ;IWA01
;(CGB)	DB	$5E,$5E,$5F,$5F ;YANEZ
;(CGB)	DB	$5B,$5B,$5B,$5B ;HASG1
;(CGB)	DB	$08,$09,$18,$19 ;TAKEY
;(CGB)	DB	$06,$07,$09,$7C ;YANE2
;(CGB)	DB	$07,$08,$7C,$19 ;YANE3
;(CGB)	DB	$09,$7C,$16,$17 ;YANE4
;(CGB)	DB	$7C,$19,$17,$18 ;YANE5
;(CGB)	DB	$7C,$7C,$17,$17 ;YANE6
;(CGB)	DB	$07,$07,$7C,$7C ;YANE7
;(CGB)	DB	$2C,$2D,$3C,$3D ;WIND0
;(CGB)	DB	$F4,$F6,$F5,$F7 ;FLW00
;(CGB)	DB	$7D,$7D,$5D,$17 ;YGAK4
;(CGB)	DB	$02,$03,$12,$13 ;KAZA1
;(CGB)	DB	$04,$05,$04,$05 ;ISID0
;(CGB)	DB	$04,$05,$14,$15 ;ISID1
;(CGB)	DB	$0A,$0B,$1A,$1B ;IDO00
;(CGB)	DB	$0C,$0C,$1C,$1C ;POLE0
;(CGB)	DB	$10,$7F,$12,$7F ;MEGG3
;(CGB)	DB	$7F,$7F,$0E,$7F ;MEGG4
;(CGB)	DB	$0E,$11,$7F,$13 ;MEGG5
;(CGB)	DB	$04,$05,$14,$15 ;SEKZ2
;(CGB)	DB	$06,$07,$16,$17 ;SEKZ3
;(CGB)	DB	$08,$09,$18,$19 ;SEKZ4
;(CGB)	DB	$0A,$0B,$1A,$1B ;SABO0
;(CGB)	DB	$0A,$0A,$0A,$0A ;HKR00
;(CGB)	DB	$0A,$0A,$1A,$1A ;HKR01
;(CGB)	DB	$0B,$0B,$1B,$1B ;HKR02
;(CGB)	DB	$00,$01,$0E,$1E ;RION3
;(CGB)	DB	$42,$41,$51,$52 ;DONAT
;(CGB)	DB	$38,$39,$54,$57 ;FUKRO
;(CGB)	DB	$0A,$0B,$1A,$1B ;SNKEY
;(CGB)	DB	$04,$7F,$04,$0E ;MEGG6
;(CGB)	DB	$00,$01,$04,$11 ;BAR01
;(CGB)	DB	$02,$03,$12,$05 ;BAR03
;(CGB)	DB	$07,$06,$06,$07 ;BAR04
;(CGB)	DB	$07,$0B,$06,$1B ;IGL00
;(CGB)	DB	$0E,$06,$1E,$07 ;IGL02
;(CGB)	DB	$0F,$1F,$0F,$1F ;YHASG
;(CGB)	DB	$0D,$0D,$1C,$1C ;BRD00
;(CGB)	DB	$1C,$1C,$1D,$1D ;BRD01
;(CGB)	DB	$0D,$0D,$1D,$1D ;BRD02
;(CGB)	DB	$0C,$0C,$0C,$0C ;MOU00
;(CGB)	DB	$7C,$0A,$0A,$7F ;MOU01
;(CGB)	DB	$1A,$7C,$7F,$1A ;MOU02
;(CGB)	DB	$1A,$0A,$7F,$7F ;MOU03
;(CGB)	DB	$0E,$05,$7F,$05 ;MEGG7
;(CGB)	DB	$7C,$7C,$06,$5C ;YGAK0
;(CGB)	DB	$7C,$7C,$5D,$07 ;YGAK1
;(CGB)	DB	$24,$25,$0E,$0F ;BIG WOOD LOW L(mayoi no mori)
;(CGB)	DB	$26,$27,$10,$11 ;BIG WOOD LOW R(mayoi no mori)
;(CGB)	DB	$12,$7C,$00,$00 ;STB00
;(CGB)	DB	$01,$01,$7C,$12 ;STB01
;(CGB)	DB	$02,$7C,$02,$12 ;STB02
;(CGB)	DB	$12,$03,$7C,$03 ;STB03
;(CGB)	DB	$12,$7C,$7C,$04 ;STB04
;(CGB)	DB	$12,$7C,$05,$12 ;STB05
;(CGB)	DB	$12,$06,$7C,$12 ;STB06
;(CGB)	DB	$07,$7C,$7C,$12 ;STB07
;(CGB)	DB	$12,$03,$00,$09 ;STB08
;(CGB)	DB	$02,$7C,$08,$00 ;STB09
;(CGB)	DB	$01,$0B,$7C,$03 ;STB0A
;(CGB)	DB	$0A,$01,$02,$12 ;STB0B
;(CGB)	DB	$12,$7C,$7C,$12 ;STB0C
;(CGB)	DB	$00,$6C,$10,$6D ;KAZA0
;(CGB)	DB	$12,$7C,$13,$14 ;MANA1
;(CGB)	DB	$0B,$0B,$1B,$1B ;CAS00
;(CGB)	DB	$00,$0B,$10,$1B ;CAS01
;(CGB)	DB	$0B,$01,$1B,$11 ;CAS02
;(CGB)	DB	$0B,$0B,$0B,$0B ;CAS03
;(CGB)	DB	$00,$0B,$00,$0B ;CAS04
;(CGB)	DB	$0B,$01,$0B,$01 ;CAS05
;(CGB)	DB	$09,$09,$19,$19 ;CASU0
;(CGB)	DB	$08,$18,$08,$18 ;CASU1
;(CGB)	DB	$02,$09,$08,$04 ;CASU2
;(CGB)	DB	$09,$03,$05,$18 ;CASU3
;(CGB)	DB	$08,$14,$12,$19 ;CASU4
;(CGB)	DB	$15,$18,$19,$13 ;CASU5
;(CGB)	DB	$02,$03,$08,$18 ;BRD03
;(CGB)	DB	$60,$61,$70,$71 ;DTRE0
;(CGB)	DB	$62,$63,$70,$71 ;DTOP0
;(CGB)	DB	$00,$01,$00,$01 ;CAS06
;(CGB)	DB	$08,$18,$12,$13 ;BRD04
;(CGB)	DB	$0B,$0B,$0B,$1E ;CAIN0
;(CGB)	DB	$0B,$0B,$1E,$1E ;CAIN1
;(CGB)	DB	$0B,$0B,$1E,$0B ;CAIN2
;(CGB)	DB	$0B,$1E,$1B,$1E ;CAIN3
;(CGB)	DB	$1E,$0B,$1E,$1B ;CAIN4
;(CGB)	DB	$14,$7F,$0B,$1B ;MEGG8
;(CGB)	DB	$7F,$0E,$1E,$1E ;MEGG9
;(CGB)	DB	$0A,$0A,$1A,$1A ;MOM00
;(CGB)	DB	$1A,$1A,$1A,$1A ;MOM01
;(CGB)	DB	$1E,$1E,$09,$08 ;SIN00
;(CGB)	DB	$09,$04,$19,$14 ;SIN01
;(CGB)	DB	$1E,$1E,$18,$08 ;SIN02
;(CGB)	DB	$05,$04,$15,$14 ;SIN03
;(CGB)	DB	$1E,$1E,$18,$09 ;SIN04
;(CGB)	DB	$05,$09,$15,$19 ;SIN05
;(CGB)	DB	$0E,$0F,$0F,$0E ;SYANE
;(CGB)	DB	$1E,$1E,$09,$09 ;TATE0
;(CGB)	DB	$09,$09,$19,$19 ;TATE1
;(CGB)	DB	$00,$01,$10,$11 ;POLE1
;(CGB)	DB	$02,$03,$12,$13 ;POLE2
;(CGB)	DB	$06,$07,$16,$17 ;SBHRS
;(CGB)	DB	$0C,$0D,$1C,$1D ;STAMI
;(CGB)	DB	$FC,$FD,$FE,$FF ;BK000
;(CGB)	DB	$04,$05,$14,$15 ;BOMG0
;(CGB)	DB	$06,$07,$16,$17 ;BOMG1
;(CGB)	DB	$08,$09,$18,$19 ;BOMG2
;(CGB)	DB	$0A,$0B,$1A,$1B ;BOMG3
;(CGB)	DB	$7F,$15,$1C,$0C ;MEGGA
;(CGB)	DB	$02,$03,$0D,$1D ;RION1
;(CGB)	DB	$7F,$7F,$0F,$0F ;MEGGB
;(CGB)	DB	$0C,$0C,$1C,$1C ;DIN00
;(CGB)	DB	$02,$01,$12,$11 ;WOODY
;(CGB)	DB	$0E,$0F,$1E,$1F ;OHAKA
;(CGB)	DB	$0E,$0F,$1E,$1F ;OHAMV
;(CGB)	DB	$68,$69,$77,$4B ;SINDO
;(CGB)	DB	$0F,$01,$10,$11 ;JWOD4
;(CGB)	DB	$08,$09,$18,$19 ;KYOK1
;(CGB)	DB	$02,$1F,$12,$13 ;JWOD5
;(CGB)	DB	$0E,$1E,$1E,$0E ;IWA02
;(CGB)	DB	$7E,$7E,$1F,$1F ;MEGGC
;(CGB)	DB	$6A,$6B,$7A,$7B ;HTANA
;(CGB)	DB	$04,$05,$14,$15 ;UWOD2
;(CGB)	DB	$06,$07,$16,$17 ;UWOD3
;(CGB)	DB	$6C,$6C,$6C,$6C ;SBEL0
;(CGB)	DB	$6D,$6D,$6D,$6D ;SBEL1
;(CGB)	DB	$6E,$6E,$6E,$6E ;SBEL2
;(CGB)	DB	$6F,$6F,$6F,$6F ;SBEL3
;(CGB)	DB	$F4,$F6,$F5,$F7 ;ANFLW
;(CGB)	DB	$F8,$FA,$F9,$FB ;KNBAN
;(CGB)	DB	$0A,$0B,$1A,$1B ;BASU0
;(CGB)	DB	$0C,$0D,$1C,$1D ;BASU1
;(CGB)	DB	$0E,$0F,$1E,$1F ;BASU2
;(CGB)	DB	$45,$45,$55,$56 ;GSAV0
;(CGB)	DB	$6D,$6D,$6D,$6D ;GSAV1
;(CGB)	DB	$4A,$4A,$45,$45 ;GSAV2
;(CGB)	DB	$0C,$0D,$1C,$1D ;SARUH
;(CGB)	DB	$6E,$5A,$5A,$6F ;HKAZA
;(CGB)	DB	$49,$40,$49,$59 ;GAK50
;(CGB)	DB	$43,$49,$48,$49 ;GAK51
;(CGB)	DB	$00,$00,$00,$00 ;
;(CGB);;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;(CGB)	DB	$5B,$5B,$5B,$5B ;HASG0
;(CGB)	DB	$64,$65,$66,$67 ;ANA00
;(CGB)	DB	$2E,$2F,$3E,$3F ;ANA01
;(CGB)	DB	$7E,$7E,$1F,$1F ;ANA02
;(CGB)	DB	$15,$16,$17,$18 ;MANA2
;(CGB)	DB	$7D,$7D,$7D,$7D	;YBETA
;(CGB)	DB	$74,$0C,$74,$1C ;POLE3
;(CGB)	DB	$1E,$1E,$7E,$7E ;SANA0
;(CGB)	DB	$68,$69,$78,$79 ;ANA03
;(CGB)	DB	$6E,$6E,$6E,$6E ;TAKI0
;(CGB)	DB	$48,$49,$48,$5F ;GAK40
;(CGB)	DB	$6C,$6C,$6C,$6C ;JWAT0
;(CGB)	DB	$6D,$6D,$6D,$6D ;JWAT1
;(CGB)	DB	$6F,$6F,$6F,$6F ;JWAT2
;(CGB)	DB	$6E,$6E,$6E,$6E ;JWAT3
;(CGB)	DB	$6F,$6F,$7D,$7D ;UMI00
;(CGB)	DB	$48,$7F,$48,$7F ;GAK41
;(CGB)	DB	$48,$5E,$48,$49 ;GAK42
;(CGB)	DB	$49,$59,$5F,$59 ;GAK43
;(CGB)	DB	$7F,$59,$7F,$59 ;GAK44
;(CGB)	DB	$5E,$59,$49,$59 ;GAK45
;=========================================================
;=	ダンジョン用ユニット（ゲームボーイ用）		 =
;=========================================================
DJUNCH
	DB	$7F,$7F,$7F,$7F ;DBET0
	DB	$7E,$7E,$7E,$7E ;DBET1
	DB	$7D,$7D,$7D,$7D ;DBET2
	DB	$7C,$7C,$7C,$7C ;DBET3
	DB	$7E,$7E,$7E,$7E ;DBET4
	DB	$5A,$5A,$5A,$5A	;DSUNA
	DB	$6E,$6F,$6F,$6E	;DFIR1
	DB	$7C,$7D,$7D,$7C ;DTCHK
	DB	$10,$29,$12,$39 ;DTU03
	DB	$2A,$2B,$12,$13 ;DTU04
	DB	$10,$11,$2A,$2B ;DTU05
	DB	$3A,$3B,$12,$13 ;DTU06
	DB	$10,$11,$3A,$3B ;DTU07
	DB	$10,$11,$12,$13 ;DTU08
	DB	$6D,$6D,$6D,$6D ;MIZU0 Deep
	DB	$18,$19,$1A,$1B ;DTU09
	DB	$10,$68,$12,$68 ;DEN00
	DB	$68,$11,$68,$13 ;DEN01
	DB	$68,$68,$12,$13 ;DEN02
	DB	$10,$11,$68,$68 ;DEN03
	DB	$10,$68,$68,$68 ;DEN04
	DB	$68,$11,$68,$68 ;DEN05
	DB	$68,$68,$12,$68 ;DEN06
	DB	$68,$68,$68,$13 ;DEN07
	DB	$1C,$1D,$1E,$1F ;DTUB0
	DB	$10,$68,$68,$13 ;DEN08
	DB	$68,$11,$12,$68 ;DEN09
	DB	$6C,$6C,$6C,$6C ;AMIZU shalow
	DB	$48,$48,$48,$48 ;DBETD
	DB	$76,$76,$49,$49 ;DAND0
	DB	$76,$76,$48,$48 ;DAND1
	DB	$48,$48,$49,$49 ;DAND2
	DB	$F0,$F2,$F1,$F3 ;20 IWA00
;
;- - Hit BG unit - 
;
	DB	$28,$28,$38,$38 ;DNC00
	DB	$29,$29,$39,$39 ;DNC01
	DB	$2A,$2B,$2A,$2B ;DNC02
	DB	$3A,$3B,$3A,$3B ;DNC03
	DB	$20,$28,$2A,$30 ;DNC04
	DB	$28,$21,$31,$3B ;DNC05
	DB	$2A,$32,$22,$39 ;DNC06
	DB	$33,$3B,$39,$23 ;DNC07
	DB	$24,$2B,$38,$34 ;DNC08
	DB	$3A,$25,$35,$38 ;DNC09
	DB	$29,$36,$26,$2B ;DNC0A
	DB	$37,$29,$3A,$27 ;DNC0B
	DB	$28,$40,$38,$50 ;DKEY0
	DB	$41,$28,$51,$38 ;DKEY1
	DB	$29,$42,$39,$52 ;DKEY2
	DB	$43,$29,$53,$39 ;DKEY3
	DB	$2A,$2B,$44,$45 ;DKEY4
	DB	$54,$55,$2A,$2B ;DKEY5
	DB	$3A,$3B,$46,$47 ;DKEY6
	DB	$56,$57,$3A,$3B ;DKEY7
	DB	$28,$40,$38,$58 ;DSHI0
	DB	$41,$28,$59,$38 ;DSHI1
	DB	$29,$4A,$39,$52 ;DSHI2
	DB	$4B,$29,$53,$39 ;DSHI3
	DB	$2A,$2B,$44,$4D ;DSHI4
	DB	$54,$5D,$2A,$2B ;DSHI5
	DB	$3A,$3B,$4E,$47 ;DSHI6
	DB	$5E,$57,$3A,$3B ;DSHI7
	DB	$72,$73,$72,$73 ;DBMUD
	DB	$69,$69,$79,$79 ;DBMLR
	DB	$2C,$2C,$3C,$3C ;DBOMU
	DB	$2D,$2D,$3D,$3D ;DBOMD
	DB	$2E,$2F,$2E,$2F ;DBOML
	DB	$3E,$3F,$3E,$3F ;DBOMR
	DB	$28,$11,$38,$13 ;DTU00
	DB	$10,$28,$12,$38 ;DTU01
	DB	$29,$66,$39,$52 ;DKUU0
	DB	$67,$29,$53,$39 ;DKUU1
	DB	$28,$28,$38,$38 ;DTUBU
	DB	$29,$29,$39,$39 ;DTUBD
	DB	$2A,$2B,$2A,$2B ;DTUBL
	DB	$3A,$3B,$3A,$3B ;DTUBR
	DB	$08,$09,$18,$19 ;DYWA4
	DB	$7E,$7E,$72,$73 ;DYTOG
	DB	$44,$45,$54,$55 ;DYCHN
	DB	$0C,$0D,$0E,$0F ;DDBL2
	DB	$00,$01,$02,$03 ;DDBLK
;- - - - - - - - - - - - - - - - - - - - - - - - - - - -
	DB	$04,$05,$12,$11 ;DYGR0
	DB	$02,$01,$12,$11 ;DYGR1
	DB	$02,$01,$14,$15 ;DYGR2
	DB	$04,$05,$10,$11 ;DYGR3
	DB	$00,$01,$10,$11 ;DYGR4
	DB	$00,$01,$14,$15 ;DYGR5
	DB	$04,$05,$10,$13 ;DYGR6
	DB	$00,$03,$10,$13 ;DYGR7
	DB	$00,$03,$14,$15 ;DYGR8
	DB	$06,$07,$12,$11 ;DYGR9
	DB	$02,$01,$16,$17 ;DYGRA
	DB	$06,$07,$10,$11 ;DYGRB
	DB	$00,$01,$16,$17 ;DYGRC
	DB	$06,$07,$10,$13 ;DYGRD
	DB	$00,$03,$16,$17 ;DYGRE
	DB	$64,$65,$74,$75 ;DYGK0
	DB	$66,$67,$76,$77 ;DYGK1
	DB	$68,$69,$78,$79 ;DYGK2
	DB	$0A,$0B,$0A,$0B ;DYTH0
	DB	$0A,$0B,$0A,$0B ;DYKH0
	DB	$1A,$1B,$1A,$1B ;DYTH1
	DB	$1A,$1B,$1A,$1B ;DYKH1
	DB	$1C,$1D,$1C,$1D ;DYTH2
	DB	$1C,$1D,$1C,$1D ;DYKH2
	DB	$0E,$0F,$1E,$1F ;DYK00
	DB	$08,$09,$18,$19 ;DYK01
	DB	$7E,$7E,$1E,$1F ;DYK02
	DB	$7E,$7E,$18,$19 ;DYK03
	DB	$20,$21,$30,$31 ;DYK04
	DB	$22,$23,$32,$33 ;DYK05
	DB	$7E,$7E,$30,$31 ;DYK06
	DB	$7E,$7E,$32,$33 ;DYK07
	DB	$24,$25,$34,$35 ;DYK08
	DB	$26,$27,$36,$37 ;DYK09
	DB	$28,$29,$38,$39 ;DYBL0
	DB	$7E,$7E,$38,$7E ;DYBL1
	DB	$7E,$7E,$7E,$39 ;DYBL2
	DB	$2A,$2B,$3A,$3B ;DYBL3
	DB	$2C,$2D,$3C,$3D ;DYBL4
	DB	$2E,$2F,$3E,$3F ;DYBL5
	DB	$40,$41,$50,$51 ;DYBL6
	DB	$42,$43,$52,$53 ;DYBL7
	DB	$00,$00,$00,$00 ;
	DB	$46,$47,$56,$57 ;DYBL9
	DB	$48,$49,$58,$59 ;DYBLA
	DB	$4A,$4B,$5A,$5B ;DYBLB
	DB	$4E,$4F,$5E,$5F ;DYBLC
	DB	$60,$61,$70,$71 ;DYBLD
	DB	$6C,$6C,$7D,$7D ;DYWA0
	DB	$7D,$7D,$7D,$7D ;DYWA1
	DB	$6D,$6E,$0C,$0D ;DYFR0
	DB	$6F,$6F,$7E,$7E ;DYWA2
	DB	$7E,$7E,$7E,$7E ;DYWA3
;- - - - - - - - - - - - - - - - - - - - - - - - - - - -
	DB	$6C,$6D,$6E,$6F ;YYGAN
	DB	$00,$01,$02,$03 ;SATAN0
	DB	$04,$05,$06,$07 ;SATAN1
	DB	$04,$05,$06,$07 ;DDBL3
	DB	$6C,$6D,$6E,$6F ;DGEJI
	DB	$6C,$6D,$6E,$6F ;DHIMI
	DB	$18,$19,$1A,$1B ;DTUZZ
	DB	$29,$11,$39,$13 ;DTU02
	DB	$08,$09,$0A,$0B ;DTURZ
;---------------------------------------
	DB	$F0,$F2,$F1,$F3 ;STUBO
	DB	$4C,$4D,$5C,$5D ;FUKBL
	DB	$04,$05,$06,$07 ;DHEK0
	DB	$08,$09,$0A,$0B ;DHEK1
	DB	$68,$68,$68,$68 ;DENSS
	DB	$68,$11,$12,$13 ;DENS1
	DB	$10,$68,$12,$13 ;DENS2
	DB	$10,$11,$68,$13 ;DENS3
	DB	$10,$11,$12,$68 ;DENS4
	DB	$78,$78,$78,$78	;DLHAG
	DB	$78,$78,$78,$78	;DDHAG
	DB	$FC,$FD,$FE,$FF ;DHTN0
	DB	$FE,$FF,$12,$13 ;DHTN1
	DB	$0C,$04,$0E,$05 ;DLGDK
	DB	$04,$0D,$05,$0F ;DRGDK
	DB	$04,$05,$04,$05 ;DFKB0
	DB	$06,$07,$08,$09 ;DFKB1
	DB	$0A,$0B,$06,$07 ;DFKB2
	DB	$60,$61,$70,$71 ;DTRE0
	DB	$62,$63,$70,$71 ;DTOP0
	DB	$0C,$0D,$0E,$0F ;DKAD0
	DB	$00,$01,$02,$03 ;DKAU0
	DB	$28,$00,$38,$02 ;DBO00
	DB	$01,$28,$03,$38 ;DBO01
	DB	$F8,$FA,$F9,$FB ;DBL00
	DB	$F8,$FA,$F9,$FB ;DBLMV
	DB	$0C,$0D,$0E,$0F ;DKAU1
	DB	$FC,$FE,$FD,$FF ;DBOMB
	DB	$14,$15,$16,$17 ;DSWCH
	DB	$64,$65,$74,$75 ;DSOK0
	DB	$6C,$6D,$74,$75 ;DSOK1
	DB	$7C,$7C,$7C,$7C ;YYGA2
	DB	$76,$76,$77,$77 ;DANA0
	DB	$76,$76,$7E,$7E ;DANA1
	DB	$7E,$7E,$77,$77 ;DANA2
	DB	$28,$00,$38,$02 ;DKUR0
	DB	$01,$28,$03,$38 ;DKUR1
	DB	$10,$0B,$12,$0B ;DEXT0
	DB	$0B,$0B,$06,$06 ;DEXT1
	DB	$0B,$11,$0B,$13 ;DEXT2
	DB	$10,$0B,$12,$00 ;DEXT3
	DB	$06,$07,$01,$09 ;DEXT4
	DB	$08,$06,$09,$00 ;DEXT5
	DB	$0B,$11,$01,$13 ;DEXT6
	DB	$29,$02,$39,$04 ;DEXT7
	DB	$03,$0A,$05,$7F ;DEXT8
	DB	$0A,$02,$7F,$04 ;DEXT9
	DB	$03,$29,$05,$39 ;DEXTA
	DB	$6A,$6B,$7A,$7B ;DTKD0
	DB	$6A,$6B,$7A,$7B ;DNTK0
	DB	$F4,$F6,$F5,$F7 ;DKNHT
	DB	$00,$7F,$01,$7F ;DHINL
	DB	$7F,$02,$7F,$03 ;DHINR
	DB	$00,$00,$01,$01 ;DHWD0
	DB	$02,$02,$03,$03 ;DHWU0
	DB	$08,$09,$0A,$0B ;DHBTU
	DB	$0A,$0B,$06,$07 ;DHBTD
	DB	$6E,$6E,$4C,$4C	;DKLU0
	DB	$4F,$4F,$6E,$6E	;DKLD0
	DB	$6E,$5C,$6E,$5C	;DKLL0
	DB	$5F,$6E,$5F,$6E	;DKLR0
	DB	$08,$09,$0A,$0B	;DTKU0
	DB	$04,$05,$06,$07 ;HTANA
	DB	$0B,$0B,$12,$13 ;DHSTG
	DB	$0C,$0D,$0E,$0F ;DHREG
	DB	$0C,$0C,$0C,$0C ;BELTD
	DB	$0D,$0D,$0D,$0D ;BELTU
	DB	$0E,$0E,$0E,$0E ;BELTL
	DB	$0F,$0F,$0F,$0F ;BELTR
	DB	$7F,$7F,$0B,$0B ;DHST2
	DB	$6F,$6F,$6F,$6F ;DTOGE
	DB	$08,$08,$09,$0B	;DKAN0
	DB	$08,$08,$0B,$0A	;DKAN1
	DB	$05,$07,$04,$04	;DKAN2
	DB	$07,$06,$04,$04	;DKAN3
	DB	$6A,$6B,$7A,$7B ;FUKB2
	DB	$5B,$5B,$5B,$5B ;DTYUK
	DB	$04,$05,$06,$07	;DBL01
	DB	$08,$09,$0A,$0B	;DBL02
	DB	$0C,$0D,$0E,$0F	;DSKEB
	DB	$0C,$0D,$0E,$0F	;DKEYB
	DB	$1C,$1D,$1E,$1F	;DTUB1
	DB	$0E,$0F,$1E,$1F ;DYKS0
	DB	$20,$21,$30,$31 ;DYKS1
	DB	$22,$23,$32,$33 ;DYKS2
	DB	$6A,$7A,$50,$61 ;YWOD0
	DB	$7A,$7A,$44,$45 ;YWOD1
	DB	$7A,$6B,$4C,$53 ;YWOD2
	DB	$4C,$4D,$5C,$5D ;YWOD5
	DB	$00,$01,$02,$03 ;ARMO0
	DB	$04,$05,$06,$07 ;ARMO1
	DB	$08,$09,$0A,$0B ;ARMO2
	DB	$0C,$0D,$0E,$0F ;ARMO3
	DB	$00,$00,$00,$00 ;$EB
;=========================================================
;=	ダンジョン用ユニット（カラーゲームボーイ用）	 =
;=========================================================
DJUNCH_CGB
	DB	$7F,$7F,$7F,$7F ;(00) DBET0
	DB	$7E,$7E,$7E,$7E ;(01) DBET1
	DB	$7D,$7D,$7D,$7D ;(02) DBET2
	DB	$7C,$7C,$7C,$7C ;(03) DBET3
	DB	$7E,$7E,$7E,$7E ;(04) DBET4
	DB	$5A,$5A,$5A,$5A	;(05) DSUNA
	DB	$6E,$6F,$6F,$6E	;(06) DFIR1
	DB	$7C,$7D,$7D,$7C ;(07) DTCHK
	DB	$10,$29,$12,$39 ;(08) DTU03
	DB	$2A,$2B,$12,$13 ;(09) DTU04
	DB	$10,$11,$2A,$2B ;(0A) DTU05
	DB	$3A,$3B,$12,$13 ;(0B) DTU06
	DB	$10,$11,$3A,$3B ;(0C) DTU07
	DB	$10,$11,$12,$13 ;(0D) DTU08
	DB	$6D,$6D,$6D,$6D ;(0E) MIZU0 Deep
	DB	$18,$19,$1A,$1B ;(0F) DTU09
	DB	$10,$68,$12,$68 ;(10) DEN00
	DB	$68,$11,$68,$13 ;(11) DEN01
	DB	$68,$68,$12,$13 ;(12) DEN02
	DB	$10,$11,$68,$68 ;(13) DEN03
	DB	$10,$68,$68,$68 ;(14) DEN04
	DB	$68,$11,$68,$68 ;(15) DEN05
	DB	$68,$68,$12,$68 ;(16) DEN06
	DB	$68,$68,$68,$13 ;(17) DEN07
	DB	$1C,$1D,$1E,$1F ;(18) DTUB0
	DB	$10,$68,$68,$13 ;(19) DEN08
	DB	$68,$11,$12,$68 ;(1A) DEN09
	DB	$6C,$6C,$6C,$6C ;(1B) AMIZU shalow
	DB	$48,$48,$48,$48 ;(1C) DBETD
	DB	$76,$76,$49,$49 ;(1D) DAND0
	DB	$76,$76,$48,$48 ;(1E) DAND1
	DB	$48,$48,$49,$49 ;(1F) DAND2
	DB	$F0,$F2,$F1,$F3 ;(20) IWA00
;
;- - Hit BG unit - 
;
	DB	$28,$28,$38,$38 ;(21) DNC00
	DB	$29,$29,$39,$39 ;(22) DNC01
	DB	$2A,$2B,$2A,$2B ;(23) DNC02
	DB	$3A,$3B,$3A,$3B ;(24) DNC03
	DB	$20,$28,$2A,$30 ;(25) DNC04
	DB	$28,$21,$31,$3B ;(26) DNC05
	DB	$2A,$32,$22,$39 ;(27) DNC06
	DB	$33,$3B,$39,$23 ;(28) DNC07
	DB	$24,$2B,$38,$34 ;(29) DNC08
	DB	$3A,$25,$35,$38 ;(2A) DNC09
	DB	$29,$36,$26,$2B ;(2B) DNC0A
	DB	$37,$29,$3A,$27 ;(2C) DNC0B
	DB	$28,$40,$38,$50 ;(2D) DKEY0
	DB	$41,$28,$51,$38 ;(2E) DKEY1
	DB	$29,$42,$39,$52 ;(2F) DKEY2
	DB	$43,$29,$53,$39 ;(30) DKEY3
	DB	$2A,$2B,$44,$45 ;(31) DKEY4
	DB	$54,$55,$2A,$2B ;(32) DKEY5
	DB	$3A,$3B,$46,$47 ;(33) DKEY6
	DB	$56,$57,$3A,$3B ;(34) DKEY7
	DB	$28,$40,$38,$58 ;(35) DSHI0
	DB	$41,$28,$59,$38 ;(36) DSHI1
	DB	$29,$4A,$39,$52 ;(37) DSHI2
	DB	$4B,$29,$53,$39 ;(38) DSHI3
	DB	$2A,$2B,$44,$4D ;(39) DSHI4
	DB	$54,$5D,$2A,$2B ;(3A) DSHI5
	DB	$3A,$3B,$4E,$47 ;(3B) DSHI6
	DB	$5E,$57,$3A,$3B ;(3C) DSHI7
	DB	$72,$73,$72,$73 ;(3D) DBMUD
	DB	$69,$69,$79,$79 ;(3E) DBMLR
	DB	$2C,$2C,$3C,$3C ;(3F) DBOMU
	DB	$2D,$2D,$3D,$3D ;(40) DBOMD
	DB	$2E,$2F,$2E,$2F ;(41) DBOML
	DB	$3E,$3F,$3E,$3F ;(42) DBOMR
	DB	$28,$11,$38,$13 ;(43) DTU00
	DB	$10,$28,$12,$38 ;(44) DTU01
	DB	$29,$66,$39,$52 ;(45) DKUU0
	DB	$67,$29,$53,$39 ;(46) DKUU1
	DB	$28,$28,$38,$38 ;(47) DTUBU
	DB	$29,$29,$39,$39 ;(48) DTUBD
	DB	$2A,$2B,$2A,$2B ;(49) DTUBL
	DB	$3A,$3B,$3A,$3B ;(4A) DTUBR
	DB	$08,$09,$18,$19 ;(4B) DYWA4
	DB	$7E,$7E,$72,$73 ;(4C) DYTOG
	DB	$44,$45,$54,$55 ;(4D) DYCHN
	DB	$0C,$0D,$0E,$0F ;(4E) DDBL2
	DB	$00,$01,$02,$03 ;(4F) DDBLK
;- - - - - - - - - - - - - - - - - - - - - - - - - - - -
	DB	$04,$05,$12,$11 ;(50) DYGR0
	DB	$02,$01,$12,$11 ;(51) DYGR1
	DB	$02,$01,$14,$15 ;(52) DYGR2
	DB	$04,$05,$10,$11 ;(53) DYGR3
	DB	$00,$01,$10,$11 ;(54) DYGR4
	DB	$00,$01,$14,$15 ;(55) DYGR5
	DB	$04,$05,$10,$13 ;(56) DYGR6
	DB	$00,$03,$10,$13 ;(57) DYGR7
	DB	$00,$03,$14,$15 ;(58) DYGR8
	DB	$06,$07,$12,$11 ;(59) DYGR9
	DB	$02,$01,$16,$17 ;(5A) DYGRA
	DB	$06,$07,$10,$11 ;(5B) DYGRB
	DB	$00,$01,$16,$17 ;(5C) DYGRC
	DB	$06,$07,$10,$13 ;(5D) DYGRD
	DB	$00,$03,$16,$17 ;(5E) DYGRE
	DB	$64,$65,$74,$75 ;(5F) DYGK0
	DB	$66,$67,$76,$77 ;(60) DYGK1
	DB	$68,$69,$78,$79 ;(61) DYGK2
	DB	$0A,$0B,$0A,$0B ;(62) DYTH0
	DB	$0A,$0B,$0A,$0B ;(63) DYKH0
	DB	$1A,$1B,$1A,$1B ;(64) DYTH1
	DB	$1A,$1B,$1A,$1B ;(65) DYKH1
	DB	$1C,$1D,$1C,$1D ;(66) DYTH2
	DB	$1C,$1D,$1C,$1D ;(67) DYKH2
	DB	$0E,$0F,$1E,$1F ;(68) DYK00
	DB	$08,$09,$18,$19 ;(69) DYK01
	DB	$7E,$7E,$1E,$1F ;(6A) DYK02
	DB	$7E,$7E,$18,$19 ;(6B) DYK03
	DB	$20,$21,$30,$31 ;(6C) DYK04
	DB	$22,$23,$32,$33 ;(6D) DYK05
	DB	$7E,$7E,$30,$31 ;(6E) DYK06
	DB	$7E,$7E,$32,$33 ;(6F) DYK07
	DB	$24,$25,$34,$35 ;(70) DYK08
	DB	$26,$27,$36,$37 ;(71) DYK09
	DB	$28,$29,$38,$39 ;(72) DYBL0
	DB	$7E,$7E,$38,$7E ;(73) DYBL1
	DB	$7E,$7E,$7E,$39 ;(74) DYBL2
	DB	$2A,$2B,$3A,$3B ;(75) DYBL3
	DB	$2C,$2D,$3C,$3D ;(76) DYBL4
	DB	$2E,$2F,$3E,$3F ;(77) DYBL5
	DB	$40,$41,$50,$51 ;(78) DYBL6
	DB	$42,$43,$52,$53 ;(79) DYBL7
	DB	$00,$00,$00,$00 ;(7A)
	DB	$46,$47,$56,$57 ;(7B) DYBL9
	DB	$48,$49,$58,$59 ;(7C) DYBLA
	DB	$4A,$4B,$5A,$5B ;(7D) DYBLB
	DB	$4E,$4F,$5E,$5F ;(7E) DYBLC
	DB	$60,$61,$70,$71 ;(7F) DYBLD
	DB	$6C,$6C,$7D,$7D ;(80) DYWA0
	DB	$7D,$7D,$7D,$7D ;(81) DYWA1
	DB	$6D,$6E,$0C,$0D ;(82) DYFR0
	DB	$6F,$6F,$7E,$7E ;(83) DYWA2
	DB	$7E,$7E,$7E,$7E ;(84) DYWA3
;- - - - - - - - - - - - - - - - - - - - - - - - - - - -
	DB	$6C,$6D,$6E,$6F ;(85) YYGAN
	DB	$00,$01,$02,$03 ;(86) SATAN0
	DB	$04,$05,$06,$07 ;(87) SATAN1
	DB	$04,$05,$06,$07 ;(88) DDBL3
	DB	$6C,$6D,$6E,$6F ;(89) DGEJI
	DB	$6C,$6D,$6E,$6F ;(8A) DHIMI
	DB	$18,$19,$1A,$1B ;(8B) DTUZZ
	DB	$29,$11,$39,$13 ;(8C) DTU02
	DB	$08,$09,$0A,$0B ;(8D) DTURZ
;---------------------------------------
	DB	$F0,$F2,$F1,$F3 ;(8E) STUBO
	DB	$4C,$4D,$5C,$5D ;(8F) FUKBL
	DB	$04,$05,$06,$07 ;(90) DHEK0
	DB	$08,$09,$0A,$0B ;(91) DHEK1
	DB	$68,$68,$68,$68 ;(92) DENSS
	DB	$68,$11,$12,$13 ;(93) DENS1
	DB	$10,$68,$12,$13 ;(94) DENS2
	DB	$10,$11,$68,$13 ;(95) DENS3
	DB	$10,$11,$12,$68 ;(96) DENS4
	DB	$78,$78,$78,$78	;(97) DLHAG
	DB	$78,$78,$78,$78	;(98) DDHAG
	DB	$FC,$FD,$FE,$FF ;(99) DHTN0
	DB	$FE,$FF,$12,$13 ;(9A) DHTN1
	DB	$0C,$04,$0E,$05 ;(9B) DLGDK
	DB	$04,$0D,$05,$0F ;(9C) DRGDK
	DB	$04,$05,$04,$05 ;(9D) DFKB0
	DB	$06,$07,$08,$09 ;(9E) DFKB1
	DB	$0A,$0B,$06,$07 ;(9F) DFKB2
;CGB	DB	$60,$61,$70,$71 ;(A0) DTRE0
	DB	$60,$60,$70,$70 ;(A0) DTRE0  宝箱（閉じたやつ）
;CGB	DB	$62,$63,$70,$71 ;(A1) DTOP0
	DB	$62,$62,$70,$70 ;(A1) DTOP0  宝箱（開いたやつ）
	DB	$0C,$0D,$0E,$0F ;(A2) DKAD0
	DB	$00,$01,$02,$03 ;(A3) DKAU0
	DB	$28,$00,$38,$02 ;(A4) DBO00
	DB	$01,$28,$03,$38 ;(A5) DBO01
	DB	$F8,$FA,$F9,$FB ;(A6) DBL00
	DB	$F8,$FA,$F9,$FB ;(A7) DBLMV
	DB	$0C,$0D,$0E,$0F ;(A8) DKAU1
	DB	$FC,$FE,$FD,$FF ;(A9) DBOMB
	DB	$14,$15,$16,$17 ;(AA) DSWCH
	DB	$64,$65,$74,$75 ;(AB) DSOK0
	DB	$6C,$6D,$74,$75 ;(AC) DSOK1
	DB	$7C,$7C,$7C,$7C ;(AD) YYGA2
	DB	$76,$76,$77,$77 ;(AE) DANA0
	DB	$76,$76,$7E,$7E ;(AF) DANA1
	DB	$7E,$7E,$77,$77 ;(B0) DANA2
	DB	$28,$00,$38,$02 ;(B1) DKUR0
	DB	$01,$28,$03,$38 ;(B2) DKUR1
	DB	$10,$0B,$12,$0B ;(B3) DEXT0
	DB	$0B,$0B,$06,$06 ;(B4) DEXT1
	DB	$0B,$11,$0B,$13 ;(B5) DEXT2
	DB	$10,$0B,$12,$00 ;(B6) DEXT3
	DB	$06,$07,$01,$09 ;(B7) DEXT4
	DB	$08,$06,$09,$00 ;(B8) DEXT5
	DB	$0B,$11,$01,$13 ;(B9) DEXT6
	DB	$29,$02,$39,$04 ;(BA) DEXT7
	DB	$03,$0A,$05,$7F ;(BB) DEXT8
	DB	$0A,$02,$7F,$04 ;(BC) DEXT9
	DB	$03,$29,$05,$39 ;(BD) DEXTA
	DB	$6A,$6B,$7A,$7B ;(BE) DTKD0
	DB	$6A,$6B,$7A,$7B ;(BF) DNTK0
	DB	$F4,$F6,$F5,$F7 ;(C0) DKNHT
	DB	$00,$7F,$01,$7F ;(C1) DHINL
	DB	$7F,$02,$7F,$03 ;(C2) DHINR
	DB	$00,$00,$01,$01 ;(C3) DHWD0
	DB	$02,$02,$03,$03 ;(C4) DHWU0
	DB	$08,$09,$0A,$0B ;(C5) DHBTU
	DB	$0A,$0B,$06,$07 ;(C6) DHBTD
	DB	$6E,$6E,$4C,$4C	;(C7) DKLU0
	DB	$4F,$4F,$6E,$6E	;(C8) DKLD0
	DB	$6E,$5C,$6E,$5C	;(C9) DKLL0
	DB	$5F,$6E,$5F,$6E	;(CA) DKLR0
	DB	$08,$09,$0A,$0B	;(CB) DTKU0
	DB	$04,$05,$06,$07 ;(CC) HTANA
	DB	$0B,$0B,$12,$13 ;(CD) DHSTG
	DB	$0C,$0D,$0E,$0F ;(CE) DHREG
	DB	$0C,$0C,$0C,$0C ;(CF) BELTD
	DB	$0D,$0D,$0D,$0D ;(D0) BELTU
	DB	$0E,$0E,$0E,$0E ;(D1) BELTL
	DB	$0F,$0F,$0F,$0F ;(D2) BELTR
	DB	$7F,$7F,$0B,$0B ;(D3) DHST2
	DB	$6F,$6F,$6F,$6F ;(D4) DTOGE
	DB	$08,$08,$09,$0B	;(D5) DKAN0
	DB	$08,$08,$0B,$0A	;(D6) DKAN1
	DB	$05,$07,$04,$04	;(D7) DKAN2
	DB	$07,$06,$04,$04	;(D8) DKAN3
	DB	$6A,$6B,$7A,$7B ;(D9) FUKB2
	DB	$5B,$5B,$5B,$5B ;(DA) DTYUK
	DB	$04,$05,$06,$07	;(DB) DBL01
	DB	$08,$09,$0A,$0B	;(DC) DBL02
	DB	$0C,$0D,$0E,$0F	;(DD) DSKEB
	DB	$0C,$0D,$0E,$0F	;(DE) DKEYB
	DB	$1C,$1D,$1E,$1F	;(DF) DTUB1
	DB	$0E,$0F,$1E,$1F ;(E0) DYKS0
	DB	$20,$21,$30,$31 ;(E1) DYKS1
	DB	$22,$23,$32,$33 ;(E2) DYKS2
	DB	$6A,$7A,$50,$61 ;(E3) YWOD0
	DB	$7A,$7A,$44,$45 ;(E4) YWOD1
	DB	$7A,$6B,$4C,$53 ;(E5) YWOD2
	DB	$4C,$4D,$5C,$5D ;(E6) YWOD5
	DB	$00,$01,$02,$03 ;(E7) ARMO0
	DB	$04,$05,$06,$07 ;(E8) ARMO1
	DB	$08,$09,$0A,$0B ;(E9) ARMO2
	DB	$0C,$0D,$0E,$0F ;(EA) ARMO3
	DB	$00,$00,$00,$00 ;$EB

;=========================================================
;=	新ダンジョン用ユニット（カラーゲームボーイ用）	 =
;=========================================================
; ＜ fukupnl.pnl : キャラＮｏ．＞
DJUNCH2
	DB	$7f,$7f,$7f,$7f		;  0
	DB	$7e,$7e,$7e,$7e		;  1
	DB	$7d,$7d,$7d,$7d		;  2
	DB	$7c,$7c,$7c,$7c		;  3
	DB	$7e,$7e,$7e,$7e		;  4
	DB	$5a,$5a,$5a,$5a		;  5
	DB	$6e,$6f,$6f,$6e		;  6
	DB	$7c,$7d,$7d,$7c		;  7
	DB	$10,$29,$12,$39		;  8
	DB	$2a,$2b,$12,$13		;  9
	DB	$10,$11,$2a,$2b		;  a
	DB	$3a,$3b,$12,$13		;  b
	DB	$10,$11,$3a,$3b		;  c
	DB	$10,$11,$12,$13		;  d
	DB	$6d,$6d,$6d,$6d		;  e
	DB	$18,$19,$1a,$1b		;  f
	DB	$10,$68,$12,$68		; 10
	DB	$68,$11,$68,$13		; 11
	DB	$68,$68,$12,$13		; 12
	DB	$10,$11,$68,$68		; 13
	DB	$10,$68,$68,$68		; 14
	DB	$68,$11,$68,$68		; 15
	DB	$68,$68,$12,$68		; 16
	DB	$68,$68,$68,$13		; 17
	DB	$1c,$1d,$1e,$1f		; 18
	DB	$10,$68,$68,$13		; 19
	DB	$68,$11,$12,$68		; 1a
	DB	$6c,$6c,$6c,$6c		; 1b
	DB	$48,$48,$48,$48		; 1c
	DB	$76,$76,$49,$49		; 1d
	DB	$76,$76,$48,$48		; 1e
	DB	$48,$48,$49,$49		; 1f
	DB	$f0,$f2,$f1,$f3		; 20
	DB	$28,$28,$38,$38		; 21
	DB	$29,$29,$39,$39		; 22
	DB	$2a,$2b,$2a,$2b		; 23
	DB	$3a,$3b,$3a,$3b		; 24
	DB	$20,$28,$2a,$30		; 25
	DB	$28,$21,$31,$3b		; 26
	DB	$2a,$32,$22,$39		; 27
	DB	$33,$3b,$39,$23		; 28
	DB	$24,$2b,$38,$34		; 29
	DB	$3a,$25,$35,$38		; 2a
	DB	$29,$36,$26,$2b		; 2b
	DB	$37,$29,$3a,$27		; 2c
	DB	$28,$40,$38,$50		; 2d
	DB	$41,$28,$51,$38		; 2e
	DB	$29,$42,$39,$52		; 2f
	DB	$43,$29,$53,$39		; 30
	DB	$2a,$2b,$44,$45		; 31
	DB	$54,$55,$2a,$2b		; 32
	DB	$3a,$3b,$46,$47		; 33
	DB	$56,$57,$3a,$3b		; 34
	DB	$28,$40,$38,$58		; 35
	DB	$41,$28,$59,$38		; 36
	DB	$29,$4a,$39,$52		; 37
	DB	$4b,$29,$53,$39		; 38
	DB	$2a,$2b,$44,$4d		; 39
	DB	$54,$5d,$2a,$2b		; 3a
	DB	$3a,$3b,$4e,$47		; 3b
	DB	$5e,$57,$3a,$3b		; 3c
	DB	$72,$73,$72,$73		; 3d
	DB	$69,$69,$79,$79		; 3e
	DB	$2c,$2c,$3c,$3c		; 3f
	DB	$29,$29,$39,$39		; 40
	DB	$2e,$2f,$2e,$2f		; 41
	DB	$3e,$3f,$3e,$3f		; 42
	DB	$28,$11,$38,$13		; 43
	DB	$10,$28,$12,$38		; 44
	DB	$29,$66,$39,$52		; 45
	DB	$67,$29,$53,$39		; 46
	DB	$28,$28,$38,$38		; 47
	DB	$29,$29,$39,$39		; 48
	DB	$2a,$2b,$2a,$2b		; 49
	DB	$3a,$3b,$3a,$3b		; 4a
	DB	$08,$09,$18,$19		; 4b
	DB	$7e,$7e,$72,$73		; 4c
	DB	$44,$45,$54,$55		; 4d
	DB	$0c,$0d,$0e,$0f		; 4e
	DB	$00,$01,$02,$03		; 4f
	DB	$fc,$fd,$fe,$ff		; 50
	DB	$fc,$fd,$fe,$ff		; 51
	DB	$fc,$fd,$fe,$ff		; 52
	DB	$1c,$1d,$1e,$1f		; 53
	DB	$1c,$1d,$1e,$1f		; 54
	DB	$1c,$1d,$1e,$1f		; 55
	DB	$6e,$11,$6f,$13		; 56
	DB	$10,$6e,$12,$6f		; 57
	DB	$10,$11,$04,$05		; 58
	DB	$10,$06,$12,$07		; 59
	DB	$0c,$0d,$0e,$0f		; 5a
	DB	$08,$11,$09,$13		; 5b
	DB	$0a,$0b,$12,$13		; 5c
	DB	$10,$11,$04,$05		; 5d
	DB	$10,$06,$12,$07		; 5e
	DB	$0c,$0d,$0e,$0f		; 5f
	DB	$08,$11,$09,$13		; 60
	DB	$0a,$0b,$12,$13		; 61
	DB	$10,$11,$04,$05		; 62
	DB	$10,$06,$12,$07		; 63
	DB	$0c,$0d,$0e,$0f		; 64
	DB	$08,$11,$09,$13		; 65
	DB	$0a,$0b,$12,$13		; 66
	DB	$0c,$0d,$0e,$0f		; 67
	DB	$0c,$0d,$0e,$0f		; 68
	DB	$0c,$0d,$0e,$0f		; 69
	DB	$b0,$b1,$b2,$b3		; 6a
	DB	$b0,$b1,$b2,$b3		; 6b
	DB	$b0,$b1,$b2,$b3		; 6c
	DB	$b0,$b1,$b2,$b3		; 6d
	DB	$b0,$b1,$b2,$b3		; 6e
	DB	$b0,$b1,$b2,$b3		; 6f
	DB	$24,$25,$34,$35		; 70
	DB	$26,$27,$36,$37		; 71
	DB	$28,$29,$38,$39		; 72
	DB	$7e,$7e,$38,$7e		; 73
	DB	$7e,$7e,$7e,$39		; 74
	DB	$2a,$2b,$3a,$3b		; 75
	DB	$2c,$2d,$3c,$3d		; 76
	DB	$2e,$2f,$3e,$3f		; 77
	DB	$40,$41,$50,$51		; 78
	DB	$42,$43,$52,$53		; 79
	DB	$00,$00,$00,$00		; 7a
	DB	$46,$47,$56,$57		; 7b
	DB	$48,$49,$58,$59		; 7c
	DB	$4a,$4b,$5a,$5b		; 7d
	DB	$4e,$4f,$5e,$5f		; 7e
	DB	$60,$61,$70,$71		; 7f
	DB	$6c,$6c,$7d,$7d		; 80
	DB	$7d,$7d,$7d,$7d		; 81
	DB	$6d,$6e,$0c,$0d		; 82
	DB	$6f,$6f,$7e,$7e		; 83
	DB	$7e,$7e,$7e,$7e		; 84
	DB	$6c,$6d,$6e,$6f		; 85
	DB	$00,$01,$02,$03		; 86
	DB	$04,$05,$06,$07		; 87
	DB	$04,$05,$06,$07		; 88
	DB	$6c,$6d,$6e,$6f		; 89
	DB	$6c,$6d,$6e,$6f		; 8a
	DB	$18,$19,$1a,$1b		; 8b
	DB	$29,$11,$39,$13		; 8c
	DB	$08,$09,$0a,$0b		; 8d
	DB	$f0,$f2,$f1,$f3		; 8e
	DB	$4c,$4d,$5c,$5d		; 8f
	DB	$04,$05,$06,$07		; 90
	DB	$08,$09,$0a,$0b		; 91
	DB	$68,$68,$68,$68		; 92
	DB	$68,$11,$12,$13		; 93
	DB	$10,$68,$12,$13		; 94
	DB	$10,$11,$68,$13		; 95
	DB	$10,$11,$12,$68		; 96
	DB	$78,$78,$78,$78		; 97
	DB	$78,$78,$78,$78		; 98
	DB	$fc,$fd,$fe,$ff		; 99
	DB	$fe,$ff,$12,$13		; 9a
	DB	$04,$04,$05,$05		; 9b
	DB	$06,$07,$08,$09		; 9c
	DB	$04,$05,$04,$05		; 9d
	DB	$06,$07,$08,$09		; 9e
	DB	$0a,$0b,$06,$07		; 9f
	DB	$60,$60,$70,$70		; a0
	DB	$62,$62,$70,$70		; a1
	DB	$0c,$0d,$0e,$0f		; a2
	DB	$00,$01,$02,$03		; a3
	DB	$28,$00,$38,$02		; a4
	DB	$01,$28,$03,$38		; a5
	DB	$f8,$fa,$f9,$fb		; a6
	DB	$f8,$fa,$f9,$fb		; a7
	DB	$0c,$0d,$0e,$0f		; a8
	DB	$fc,$fe,$fd,$ff		; a9
	DB	$14,$15,$16,$17		; aa
	DB	$64,$65,$74,$75		; ab
	DB	$6c,$6d,$74,$75		; ac
	DB	$7c,$7c,$7c,$7c		; ad
	DB	$76,$76,$77,$77		; ae
	DB	$76,$76,$7e,$7e		; af
	DB	$7e,$7e,$77,$77		; b0
	DB	$28,$00,$38,$02		; b1
	DB	$01,$28,$03,$38		; b2
	DB	$10,$0b,$12,$0b		; b3
	DB	$7c,$7c,$0b,$0b		; b4
	DB	$0b,$11,$0b,$13		; b5
	DB	$10,$0b,$12,$00		; b6
	DB	$06,$07,$01,$09		; b7
	DB	$08,$06,$09,$00		; b8
	DB	$0b,$11,$01,$13		; b9
	DB	$29,$02,$39,$04		; ba
	DB	$03,$0a,$05,$7f		; bb
	DB	$0a,$02,$7f,$04		; bc
	DB	$03,$29,$05,$39		; bd
	DB	$6a,$6b,$7a,$7b		; be
	DB	$6a,$6b,$7a,$7b		; bf
	DB	$f4,$f6,$f5,$f7		; c0
	DB	$00,$7f,$01,$7f		; c1
	DB	$7f,$02,$7f,$03		; c2
	DB	$00,$00,$01,$01		; c3
	DB	$02,$02,$03,$03		; c4
	DB	$08,$09,$0a,$0b		; c5
	DB	$0a,$0b,$06,$07		; c6
	DB	$6e,$6e,$4c,$4c		; c7
	DB	$4f,$4f,$6e,$6e		; c8
	DB	$6e,$5c,$6e,$5c		; c9
	DB	$5f,$6e,$5f,$6e		; ca
	DB	$08,$09,$0A,$0B		; cb
	DB	$04,$05,$06,$07		; cc
	DB	$0b,$0b,$12,$13		; cd
	DB	$0c,$0d,$0e,$0f		; ce
	DB	$0c,$0c,$0c,$0c		; cf
	DB	$0d,$0d,$0d,$0d		; d0
	DB	$0e,$0e,$0e,$0e		; d1
	DB	$0f,$0f,$0f,$0f		; d2
	DB	$7f,$7f,$0b,$0b		; d3
	DB	$6f,$6f,$6f,$6f		; d4
	DB	$08,$08,$09,$0b		; d5
	DB	$08,$08,$0b,$0a		; d6
	DB	$05,$07,$04,$04		; d7
	DB	$07,$06,$04,$04		; d8
	DB	$6a,$6b,$7a,$7b		; d9
	DB	$5b,$5b,$5b,$5b		; da
	DB	$04,$05,$06,$07		; db
	DB	$08,$09,$0a,$0b		; dc
;
;=================================================
GRBGCR
;     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F  
 DB $01,$00,$00,$00,$00,$01,$01,$01,$00,$00,$06,$00,$00,$00,$07,$00 ;0
 DB $00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$05,$01,$01,$05,$04 ;1
 DB $30,$01,$01,$00,$00,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01 ;2
 DB $05,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01 ;3
 DB $01,$01,$01,$10,$00,$01,$01,$01,$01,$01,$10,$01,$01,$01,$01,$01 ;4
 DB $01,$01,$01,$0A,$C0,$01,$01,$01,$01,$01,$01,$01,$30,$01,$01,$01 ;5
 DB $01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$60,$01 ;6
 DB $C0,$01,$01,$01,$01,$01,$01,$02,$08,$08,$08,$50,$01,$01,$01,$01 ;7
;     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F  
 DB $01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01 ;8
 DB $01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01 ;9
 DB $60,$60,$01,$01,$00,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01 ;A
 DB $01,$01,$01,$00,$01,$01,$01,$01,$01,$00,$99,$01,$01,$01,$01,$01 ;B
 DB $C0,$01,$01,$01,$01,$01,$09,$01,$60,$01,$01,$03,$09,$01,$01,$F4 ;C
 DB $F5,$F6,$F7,$30,$60,$01,$01,$01,$01,$07,$01,$08,$00,$01,$01,$01 ;D
 DB $02,$03,$03,$03,$01,$01,$81,$03,$50,$01,$01,$07,$07,$07,$07,$50 ;E
 DB $D1,$01,$01,$D0,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$FF ;F
;----------------------------------------------------------------------
DJBGCR
DJBGCR2
;     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F  
 DB $00,$50,$00,$00,$00,$00,$0B,$00,$7D,$7E,$7F,$7E,$7F,$00,$07,$00 ;0
 DB $81,$80,$82,$83,$84,$85,$86,$87,$00,$8C,$8D,$05,$51,$51,$51,$51 ;1
 DB $30,$D3,$D2,$D0,$D1,$01,$01,$01,$01,$01,$01,$01,$01,$90,$90,$91 ;2
 DB $91,$92,$92,$93,$93,$D3,$D3,$D2,$D2,$D0,$D0,$D1,$D1,$00,$00,$99 ;3
 DB $9A,$9B,$9C,$7C,$7D,$01,$01,$99,$9A,$9B,$9C,$B0,$00,$00,$60,$60 ;4
 DB $01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01 ;5
 DB $01,$01,$B1,$B1,$B1,$B1,$B1,$B0,$01,$00,$00,$00,$01,$01,$00,$00 ;6
 DB $00,$00,$B0,$B0,$B0,$00,$00,$00,$00,$00,$00,$01,$00,$B0,$B0,$00 ;7
;     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F  
 DB $B0,$B0,$00,$B0,$B0,$B0,$01,$01,$60,$00,$01,$01,$7C,$00,$30,$60 ;8
 DB $01,$01,$00,$88,$89,$8A,$8B,$0A,$02,$01,$7E,$01,$01,$00,$00,$00 ;9
 DB $60,$60,$03,$03,$98,$98,$60,$60,$03,$30,$00,$01,$01,$01,$50,$50 ;A
 DB $50,$7C,$7D,$00,$00,$00,$8B,$8A,$8B,$8A,$01,$7C,$7D,$01,$00,$00 ;B
 DB $01,$7C,$7D,$01,$01,$01,$01,$D3,$D2,$D0,$D1,$08,$09,$7E,$01,$F0 ;C
 DB $F1,$F2,$F3,$7F,$E0,$01,$01,$01,$01,$60,$00,$04,$04,$30,$01,$00 ;D
 DB $00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$01,$01,$01,$01,$01 ;E
 DB $01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$FE,$FF ;F
;----------------------------------------------------------------------
	;新ダンジョン用当たり判定テーブルデータ
;     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F  
 DB $00,$50,$00,$00,$00,$00,$0B,$00,$7D,$7E,$7F,$7E,$7F,$00,$07,$00 ;0
 DB $81,$80,$82,$83,$84,$85,$86,$87,$00,$8C,$8D,$05,$51,$51,$51,$51 ;1
 DB $30,$D3,$D2,$D0,$D1,$01,$01,$01,$01,$01,$01,$01,$01,$90,$90,$91 ;2
 DB $91,$92,$92,$93,$93,$D3,$D3,$D2,$D2,$D0,$D0,$D1,$D1,$00,$00,$99 ;3
 DB $9A,$9B,$9C,$7C,$7D,$01,$01,$99,$9A,$9B,$9C,$B0,$00,$00,$60,$60 ;4
 DB $00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$50,$00,$00,$00,$00,$50 ;5
 DB $00,$00,$00,$00,$50,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00 ;6
 DB $00,$00,$B0,$B0,$B0,$00,$00,$00,$00,$00,$00,$01,$00,$B0,$B0,$00 ;7
;     0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F  
 DB $B0,$B0,$00,$B0,$B0,$B0,$01,$01,$60,$00,$01,$01,$7C,$00,$30,$60 ;8
 DB $01,$01,$00,$88,$89,$8A,$8B,$0A,$02,$01,$7E,$01,$01,$00,$00,$00 ;9
 DB $60,$60,$03,$03,$98,$98,$60,$60,$03,$30,$00,$01,$01,$01,$50,$50 ;A
 DB $50,$7C,$7D,$00,$00,$00,$8B,$8A,$8B,$8A,$01,$7C,$7D,$01,$00,$00 ;B
 DB $01,$7C,$7D,$01,$01,$01,$01,$D3,$D2,$D0,$D1,$08,$09,$7E,$01,$F0 ;C
 DB $F1,$F2,$F3,$7F,$E0,$01,$01,$01,$01,$60,$00,$04,$04,$30,$01,$00 ;D
 DB $00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$01,$01,$01,$01,$01 ;E
 DB $01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$FE,$FF ;F
;=================================================
;=================================================
;;;;;;;;;シャッター保存用 DB $91,$92,$92,$93,$93,$94,$94,$95,$95,$96,$96,$97,$97,$00,$00,$99 ;3
;=================================================
;=================================================
;=================================================
;=================================================
;=================================================
;;;;;	LIB	ZVD
;
	END
